[
    {
        "Date":"2024-09-05T14:44:52Z",
        "Title":"Is Wells Fargo Stock Underperforming the S&P 500?",
        "Description":"Barchart Premier: The most comprehensive method for keeping track of all your investments.\nFREE 30 Day Trial\n- Market Pulse\n-\n- Options Market Overview\n- Unusual Options Activity\n- IV Rank and IV Percentile\n- Most Active Options\n- Unusual Options Volume\n- Hig…",
        "Content":"Barchart Premier: The most comprehensive method for keeping track of all your investments.FREE 30 Day Trial- Market Pulse-- Options Market Overview- Unusual Options Activity- IV Rank and IV Percentil… [+124 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/6df594c9ff4689e5"
    },
    {
        "Date":"2024-09-05T14:44:37Z",
        "Title":"Morning Bid: Stocks calmed as action switches to rates, jobs",
        "Description":"Morning Bid: Stocks calmed as action switches to rates, jobs Reuters\nS&P 500 and Nasdaq rise for first time in three days as tech tries to rebound: Live updates CNBC\nStock market today: S&P 500, Nasdaq climb amid more soft jobs market data Yahoo Finance\nStock…",
        "Content":"Morning Bid: Stocks calmed as action switches to rates, jobs ReutersS&amp;P 500 and Nasdaq rise for first time in three days as tech tries to rebound: Live updates CNBCStock market today: S&amp;P 500… [+142 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/3027b9722c0030d7"
    },
    {
        "Date":"2024-09-05T14:38:52Z",
        "Title":"S&P 500 Tempest in a Teapot",
        "Description":"As we have discussed many times, financial markets are fractal. Different timeframes produce similar price structures. This is a very valuable phenomena for the study and practice of trading. When tracking the intraday time frame; Wyckoff structures of Accumu…",
        "Content":"As we have discussed many times, financial markets are fractal. Different timeframes produce similar price structures. This is a very valuable phenomena for the study and practice of trading. When tr… [+5537 chars]",
        "Source":"Stockcharts.com",
        "URL":"https:\/\/stockcharts.com\/articles\/wyckoff\/2024\/09\/sp-500-tempest-in-a-teapot-268.html"
    },
    {
        "Date":"2024-09-05T14:34:24Z",
        "Title":"These 5 Stocks Can Help Supercharge Your Portfolio. Here's Why",
        "Description":"Over the long term, the S&P 500 has produced an annualized return of about 10% per year. For the individual investor who wants to pick single businesses, perhaps the obvious goal is to outperform the broader index over the long haul.\nThis might seem like a da…",
        "Content":"Over the long term, the S&amp;P 500 has produced an annualized return of about 10% per year. For the individual investor who wants to pick single businesses, perhaps the obvious goal is to outperform… [+132 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/22f74bc70947bd33"
    },
    {
        "Date":"2024-09-05T14:34:05Z",
        "Title":"Is Lowe's Stock Underperforming the S&P 500?",
        "Description":"UNLIMITED Watchlists, Portfolios, Screeners, and other Barchart tools with Barchart Premier.\nFREE 30 Day Trial\n- Market Pulse\n-\n- Options Market Overview\n- Unusual Options Activity\n- IV Rank and IV Percentile\n- Most Active Options\n- Unusual Options Volume\n- H…",
        "Content":"UNLIMITED Watchlists, Portfolios, Screeners, and other Barchart tools with Barchart Premier.FREE 30 Day Trial- Market Pulse-- Options Market Overview- Unusual Options Activity- IV Rank and IV Percent… [+126 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/c638ceb83fe35480"
    },
    {
        "Date":"2024-09-05T14:34:02Z",
        "Title":"Why the Stock Market Is So Jittery This Week",
        "Description":"LIVE UPDATES\nStock Market Mixed as ADP, Jobless Claims Provide Murky Picture\nThe Dow Jones Industrial Average was lower, the S&P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs report.\nLast Updated:\nSep. 5, 2024 at 10:28 AM EDT\n4 min ago\nWh…",
        "Content":"LIVE UPDATESStock Market Mixed as ADP, Jobless Claims Provide Murky PictureThe Dow Jones Industrial Average was lower, the S&amp;P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs r… [+130 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/789f6d3ea3df8017"
    },
    {
        "Date":"2024-09-05T14:28:49Z",
        "Title":"S&P Global Inc. (NYSE:SPGI) Shares Purchased by Founders Financial Securities LLC",
        "Description":"Founders Financial Securities LLC boosted its position in S&P Global Inc. (NYSE:SPGI – Free Report) by 4.1% during the second quarter, Holdings Channel.com reports. The institutional investor owned 1,685 shares of the business services provider’s stock after …",
        "Content":"Founders Financial Securities LLC boosted its position in S&amp;P Global Inc. (NYSE:SPGI – Free Report) by 4.1% during the second quarter, Holdings Channel.com reports. The institutional investor own… [+7184 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/sp-global-inc-nysespgi-shares-purchased-by-founders-financial-securities-llc\/"
    },
    {
        "Date":"2024-09-05T14:23:11Z",
        "Title":"These 5 Stocks Can Help Supercharge Your Portfolio. Here's Why",
        "Description":"Over the long term, the S&P 500 has produced an annualized return of about 10% per year. For the individual investor who wants to pick single businesses, perhaps the obvious goal is to outperform the broader index over the long haul.\nThis might seem like a da…",
        "Content":"Over the long term, the S&amp;P 500 has produced an annualized return of about 10% per year. For the individual investor who wants to pick single businesses, perhaps the obvious goal is to outperform… [+142 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/db752817646904a8"
    },
    {
        "Date":"2024-09-05T14:11:41Z",
        "Title":"ISM Services Data Provide Some Good News for Stocks",
        "Description":"LIVE UPDATES\nStock Market Mixed as ADP, Jobless Claims Provide Murky Picture\nThe Dow Jones Industrial Average was lower, the S&P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs report.\nLast Updated:\nSep. 5, 2024 at 10:07 AM EDT\n3 min ago\nIS…",
        "Content":"LIVE UPDATESStock Market Mixed as ADP, Jobless Claims Provide Murky PictureThe Dow Jones Industrial Average was lower, the S&amp;P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs r… [+134 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/f28d44b901ae1644"
    },
    {
        "Date":"2024-09-05T14:11:32Z",
        "Title":"Stock market today: Nasdaq, S&P 500 futures slide amid more soft jobs market data",
        "Description":"Stock market today: Nasdaq, S&P 500 futures slide amid more soft jobs market data Yahoo Finance\nStock market today: Nasdaq, S&P 500 waver amid more soft jobs market data Yahoo Finance\nStock Market Today: Dow Futures Little Changed; Bond Yields Hold Near Year …",
        "Content":"Stock market today: Nasdaq, S&amp;P 500 futures slide amid more soft jobs market data Yahoo FinanceStock market today: Nasdaq, S&amp;P 500 waver amid more soft jobs market data Yahoo FinanceStock Mar… [+144 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/c4c00d10a0821631"
    },
    {
        "Date":"2024-09-05T14:11:32Z",
        "Title":"Stock market today: Dow, Nasdaq seesaw amid more soft jobs market data",
        "Description":"Ines Ferré\nIn this article:\nUS stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the health of the US economy.\nThe S&P 500 (^GSPC) rose 0.4%, while…",
        "Content":"Ines FerréIn this article:US stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the heal… [+140 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/b8d2f7c019206bf5"
    },
    {
        "Date":"2024-09-05T14:03:41Z",
        "Title":"US stocks mixed following key labor market data",
        "Description":"US stocks mixed following key labor market data",
        "Content":"Investing.com -- U.S. stock futures traded largely flat Thursday, attempting to stabilize after a rocky start to the month ahead of key employment data for clues for future Federal Reserve monetary p… [+3009 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/stock-market-news\/us-stock-futures-steady-ahead-of-key-labor-market-data-3602279"
    },
    {
        "Date":"2024-09-05T14:00:00Z",
        "Title":"ATRX restricts Human Cytomegalovirus (HCMV) viral DNA replication through heterochromatinization and minimizes unpackaged viral genomes",
        "Description":"Author summary Viruses infect host cells and often kill them, so cells encode proteins geared to protect them from viral predators. Viruses, as obligate intracellular parasites, rely on host cell proteins for functions they require to replicate. Thus, cellula…",
        "Content":"Abstract\r\nATRX limits the accumulation of human cytomegalovirus (HCMV) Immediate Early (IE) proteins at the start of productive, lytic infections, and thus is a part of the cell-intrinsic defenses ag… [+85757 chars]",
        "Source":"Plos.org",
        "URL":"https:\/\/journals.plos.org\/plospathogens\/article?id=10.1371\/journal.ppat.1012516"
    },
    {
        "Date":"2024-09-05T14:00:00Z",
        "Title":"Dual-role epitope on SARS-CoV-2 spike enhances and neutralizes viral entry across different variants",
        "Description":"Author summary Antibodies bind to specific epitopes on viral surface glycoproteins to perform their function: inhibiting viral infection, having no effect, or, in rare cases, enhancing viral infection. In our research, we used nanobodies (small, single-domain…",
        "Content":"Citation: Ye G, Bu F, Pan R, Mendoza A, Saxena D, Zheng J, et al. (2024) Dual-role epitope on SARS-CoV-2 spike enhances and neutralizes viral entry across different variants. PLoS Pathog 20(9):\r\n e10… [+50853 chars]",
        "Source":"Plos.org",
        "URL":"https:\/\/journals.plos.org\/plospathogens\/article?id=10.1371\/journal.ppat.1012493"
    },
    {
        "Date":"2024-09-05T14:00:00Z",
        "Title":"Unveiling inter-embryo variability in spindle length over time: Towards quantitative phenotype analysis",
        "Description":"Author summary When quantifying the cell, scientists need to accurately measure cell-to-cell variability as it carries unique information about the underlying mechanisms. In this article, we focused on the spindle length as a proxy for correct mitosis. We use…",
        "Content":"Abstract\r\nHow can inter-individual variability be quantified? Measuring many features per experiment raises the question of choosing them to recapitulate high-dimensional data. Tackling this challeng… [+94019 chars]",
        "Source":"Plos.org",
        "URL":"https:\/\/journals.plos.org\/ploscompbiol\/article?id=10.1371\/journal.pcbi.1012330"
    },
    {
        "Date":"2024-09-05T14:00:00Z",
        "Title":"Variance in multi-blade induced lightning overvoltages among different wind farm topologies",
        "Description":"The impact of the topological formation of wind farms upon the lightning induced overvoltages injected into the grid was not covered earlier in literature. However, this topic is highly important to be investigated to allow the usage of the most reliable topo…",
        "Content":"Abstract\r\nThe impact of the topological formation of wind farms upon the lightning induced overvoltages injected into the grid was not covered earlier in literature. However, this topic is highly imp… [+32474 chars]",
        "Source":"Plos.org",
        "URL":"https:\/\/journals.plos.org\/plosone\/article?id=10.1371\/journal.pone.0308449"
    },
    {
        "Date":"2024-09-05T14:00:00Z",
        "Title":"Centrosome amplification primes ovarian cancer cells for apoptosis and potentiates the response to chemotherapy",
        "Description":"What are the effects of centrosome amplification in cancer? This study shows that extra centrosomes prime ovarian cancer cells for apoptosis, acting in synergy with chemotherapy to induce cell death. High centrosome numbers correlate with improved treatment r…",
        "Content":"Citation: Edwards F, Fantozzi G, Simon AY, Morretton J-P, Herbette A, Tijhuis AE, et al. (2024) Centrosome amplification primes ovarian cancer cells for apoptosis and potentiates the response to chem… [+89297 chars]",
        "Source":"Plos.org",
        "URL":"https:\/\/journals.plos.org\/plosbiology\/article?id=10.1371\/journal.pbio.3002759"
    },
    {
        "Date":"2024-09-05T14:00:00Z",
        "Title":"Pleiotropic effects of PAB1 deletion: Extensive changes in the yeast proteome, transcriptome, and translatome",
        "Description":"Author summary Many human diseases are caused by having too much or too little of certain cellular proteins. The amount of an individual protein is influenced by the level of its messenger mRNA (mRNA) and the efficiency of translation of the mRNA into a polyp…",
        "Content":"Introduction\r\nEukaryotic mRNAs are subject to complex post-transcriptional regulation by RNA binding proteins (RBPs) that control protein output. Cytoplasmic poly(A)-binding proteins (PABPCs) are RBP… [+95008 chars]",
        "Source":"Plos.org",
        "URL":"https:\/\/journals.plos.org\/plosgenetics\/article?id=10.1371\/journal.pgen.1011392"
    },
    {
        "Date":"2024-09-05T14:00:00Z",
        "Title":"Inositol trisphosphate and ryanodine receptor signaling distinctly regulate neurite pathfinding in response to engineered micropatterned surfaces",
        "Description":"Micro and nanoscale patterning of surface features and biochemical cues have emerged as tools to precisely direct neurite growth into close proximity with next generation neural prosthesis electrodes. Biophysical cues can exert greater influence on neurite pa…",
        "Content":"Citation: Vecchi JT, Rhomberg M, Allan Guymon C, Hansen MR (2024) Inositol trisphosphate and ryanodine receptor signaling distinctly regulate neurite pathfinding in response to engineered micropatter… [+61964 chars]",
        "Source":"Plos.org",
        "URL":"https:\/\/journals.plos.org\/plosone\/article?id=10.1371\/journal.pone.0308389"
    },
    {
        "Date":"2024-09-05T13:52:07Z",
        "Title":"CME Group to Launch Options on Bloomberg Commodity Index Futures on September 23",
        "Description":"CME Group to Launch Options on Bloomberg Commodity Index Futures on September 23",
        "Content":"CHICAGO\r\n, Sept. 5, 2024\r\n \/PRNewswire\/ -- CME Group, the world's leading derivatives marketplace, today announced that it will launch options on Bloomberg Commodity Index (BCOM) futures on September… [+3543 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/cme-group-to-launch-options-on-bloomberg-commodity-index-futures-on-september-23-93CH-3603247"
    },
    {
        "Date":"2024-09-05T13:50:03Z",
        "Title":"Stock market today: Indexes mixed as investors assess labor data ahead of Friday payroll report",
        "Description":"Indexes were mixed on Thursday amid fresh labor data ahead of Friday's August nonfarm payroll report. Private payroll data was weaker than expected last month.",
        "Content":"Indexes wavered on Thursday as investors mulled mixed labor market data ahead of Friday's August jobs report.\r\nThe S&amp;P 500 and the Nasdaq Composite were slightly higher, while the Dow Jones Indus… [+1932 chars]",
        "Source":"Business Insider",
        "URL":"https:\/\/markets.businessinsider.com\/news\/stocks\/stock-market-today-jobless-claims-unemployment-payroll-openings-labor-department-2024-9"
    },
    {
        "Date":"2024-09-05T13:49:38Z",
        "Title":"Stock market today: Dow, Nasdaq seesaw amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the health of the US economy.\r\nThe… [+2674 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-dow-nasdaq-seesaw-amid-more-soft-jobs-market-data-134938592.html"
    },
    {
        "Date":"2024-09-05T13:49:38Z",
        "Title":"Stock market today: Dow falls, Nasdaq rises amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stocks were mixed on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest rate cut hopes and the health of the US economy.\r… [+3996 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-dow-falls-nasdaq-rises-amid-more-soft-jobs-market-data-134938786.html"
    },
    {
        "Date":"2024-09-05T13:49:38Z",
        "Title":"Stock market today: S&P 500, Nasdaq climb amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest rate cut hopes and the health of the US economy.\r\nThe… [+3340 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-sp-500-nasdaq-climb-amid-more-soft-jobs-market-data-134938220.html"
    },
    {
        "Date":"2024-09-05T13:49:06Z",
        "Title":"Is Philip Morris Stock Outperforming the S&P 500?",
        "Description":"Get all the relevant market information you need — get it fast, on time, and accurately with Barchart Plus.\nFREE 30 Day Trial\n- Market Pulse\n-\n- Options Market Overview\n- Unusual Options Activity\n- IV Rank and IV Percentile\n- Most Active Options\n- Unusual Opt…",
        "Content":"Get all the relevant market information you need get it fast, on time, and accurately with Barchart Plus.FREE 30 Day Trial- Market Pulse-- Options Market Overview- Unusual Options Activity- IV Rank a… [+127 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/d066a8edaa765aff"
    },
    {
        "Date":"2024-09-05T13:48:00Z",
        "Title":"Chevron Stock Near 52-Week Lows: Is It Good Enough to Invest?",
        "Description":"CVX remains one of the best-positioned global integrated oil companies to achieve sustainable production growth.",
        "Content":"Shares of Chevron Corporation CVX have dropped by nearly 9% over the past three months to close at $142.07 on Wednesday, near 52-week lows of $139.62. Having underperformed its rival ExxonMobil XOM, … [+6618 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/chevron-stock-near-52-week-134800913.html"
    },
    {
        "Date":"2024-09-05T13:37:08Z",
        "Title":"US stocks open muted after mixed labor market data",
        "Description":"The S&P 500 and the Dow were subdued at the open on Thursday as investors parsed through mixed labor market data to gauge the size of the Federal Reserve's interest rate cut that is expected later this month.",
        "Content":"(What's moving Sensex and Nifty Track latest market news, stock tips, Budget 2024 and expert advice, on ETMarkets. Also, ETMarkets.com is now on Telegram. For fastest news alerts on financial markets… [+317 chars]",
        "Source":"The Times of India",
        "URL":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/us-stocks-open-muted-after-mixed-labor-market-data\/articleshow\/113099517.cms"
    },
    {
        "Date":"2024-09-05T13:23:04Z",
        "Title":"Gold Rallies, Yen Surges, Treasury Yields Fall As Disappointing Payrolls Data Supports Large Rate-Cut Bets",
        "Description":"Lower-than-expected private employment growth in August triggered positive reactions Thursday in interest rate-sensitive assets like gold and the Japanese...",
        "Content":"Gold Rallies, Yen Surges, Treasury Yields Fall As Disappointing Payrolls Data Supports Large Rate-Cut Bets\r\nLower-than-expected private employment growth in August triggered positive reactions Thursd… [+3001 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/gold-rallies-yen-surges-treasury-132304604.html"
    },
    {
        "Date":"2024-09-05T13:05:29Z",
        "Title":"Treasury Yields Wobble as Jobless Claims Counter ADP Report",
        "Description":"LIVE UPDATES\nStock Market News: Dow Set to Open Down\nS&P 500 and Nasdaq futures are falling in premarket trading Thursday.\nLast Updated:\nSep. 5, 2024 at 8:56 AM EDT\n8 min ago\nTreasury Yields Wobble as Jobless Claims Counter ADP Report\nMixed U.S. labor data se…",
        "Content":"LIVE UPDATESStock Market News: Dow Set to Open DownS&amp;P 500 and Nasdaq futures are falling in premarket trading Thursday.Last Updated:Sep. 5, 2024 at 8:56 AM EDT8 min agoTreasury Yields Wobble as … [+135 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/4ce3c4d562bbe38e"
    },
    {
        "Date":"2024-09-05T13:02:54Z",
        "Title":"Versor Investments LP Acquires Shares of 5,100 Camden Property Trust (NYSE:CPT)",
        "Description":"Versor Investments LP acquired a new stake in Camden Property Trust (NYSE:CPT – Free Report) during the second quarter, according to its most recent disclosure with the SEC. The institutional investor acquired 5,100 shares of the real estate investment trust’…",
        "Content":"Versor Investments LP acquired a new stake in Camden Property Trust (NYSE:CPT – Free Report) during the second quarter, according to its most recent disclosure with the SEC. The institutional investo… [+5296 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/versor-investments-lp-acquires-shares-of-5100-camden-property-trust-nysecpt\/"
    },
    {
        "Date":"2024-09-05T13:00:36Z",
        "Title":"Here’s Why DexCom (DXCM) Fell in Q2",
        "Description":"Investment advisory firm Ithaka Group released the “Ithaka US Growth Strategy” second-quarter 2024 investor letter. A copy of the letter can be downloaded...",
        "Content":"Investment advisory firm Ithaka Group released the Ithaka US Growth Strategy second-quarter 2024 investor letter. A copy of the letter can be downloaded here. The second quarter of 2024 saw a surge i… [+3554 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/why-dexcom-dxcm-fell-q2-130036885.html"
    },
    {
        "Date":"2024-09-05T13:00:36Z",
        "Title":"Dick's Sporting stock target raised 10% on strong Q2 results",
        "Description":"Dick's Sporting stock target raised 10% on strong Q2 results",
        "Content":"On Thursday, Loop Capital maintained a Hold rating on Dick's Sporting Goods (NYSE:DKS) but increased the price target to $220 from the previous $200. This adjustment follows the retailer's announceme… [+3958 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/company-news\/dicks-sporting-stock-target-raised-10-on-strong-q2-results-93CH-3603049"
    },
    {
        "Date":"2024-09-05T13:00:01Z",
        "Title":"NFL team sales are likely to stall as valuations soar",
        "Description":"The Seattle Seahawks will likely sell in the coming years, but rising valuations and modernized estate planning may slow down other full NFL team sales.",
        "Content":"The Seattle Seahawks may be the next National Football League team to sell. Beyond that, it's anyone's guess when another franchise will change hands.\r\nFormer Seahawks owner and Microsoft co-founder … [+9180 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/nfl-team-sales-are-likely-to-stall-as-valuations-soar.html"
    },
    {
        "Date":"2024-09-05T13:00:00Z",
        "Title":"Thinking Outside The Box Stock: Time To Pick Alternatives?",
        "Description":"Motorola Solutions and Fortinet stocks have both seen higher growth in revenue and operating profits than Box in the last twelve months, as well as the most recent qua...",
        "Content":"UKRAINE - 2021\/11\/10: In this photo illustration, a Box Inc. logo of a software company is seen on a ... [+] smartphone and a pc screen. (Photo Illustration by Pavlo Gonchar\/SOPA Images\/LightRocket v… [+5166 chars]",
        "Source":"Forbes",
        "URL":"https:\/\/www.forbes.com\/sites\/greatspeculations\/2024\/09\/05\/thinking-outside-the-box-stock-time-to-pick-alternatives\/"
    },
    {
        "Date":"2024-09-05T12:55:50Z",
        "Title":"Trump Media erases all 2024 stock gains days before Donald Trump can cash out his $1.95 billion stake",
        "Description":"Donald Trump's stake is still worth nearly $2 billion, but fears he might follow its CEO Devin Nunes and sell stock is weighing on sentiment.",
        "Content":"Donald Trump is nearing the day he can cash out of Truth Socials parent company, raising concerns of a potential sell-off that could hit the meme stock hard.On paper, Trumps stake in Trump Media and … [+3228 chars]",
        "Source":"Fortune",
        "URL":"https:\/\/fortune.com\/2024\/09\/05\/donald-trump-truth-social-tmtg-stock-price\/"
    },
    {
        "Date":"2024-09-05T12:55:50Z",
        "Title":"Trump Media erases all 2024 stock gains days before Donald Trump can cash out his $1.95 billion stake",
        "Description":"Donald Trump's stake is still worth nearly $2 billion, but fears he might follow its CEO Devin Nunes and sell stock is weighing on sentiment.",
        "Content":"Donald Trump is nearing the day he can cash out of Truth Social's parent company, raising concerns of a potential sell-off that could hit the meme stock hard.\r\nOn paper, Trump's stake in Trump Media … [+3395 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/trump-media-erases-2024-stock-125550409.html"
    },
    {
        "Date":"2024-09-05T12:54:27Z",
        "Title":"Jobless Claims Decline More Than Expected",
        "Description":"LIVE UPDATES\nStock Market News: Dow Set to Open Down\nS&P 500 and Nasdaq futures are falling in premarket trading Thursday.\nLast Updated:\nSep. 5, 2024 at 8:53 AM EDT\n5 min ago\nJobless Claims Decline More Than Expected\nInitial jobless claims for the week ending…",
        "Content":"LIVE UPDATESStock Market News: Dow Set to Open DownS&amp;P 500 and Nasdaq futures are falling in premarket trading Thursday.Last Updated:Sep. 5, 2024 at 8:53 AM EDT5 min agoJobless Claims Decline Mor… [+129 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/92732793503e141e"
    },
    {
        "Date":"2024-09-05T12:53:58Z",
        "Title":"Top 3 Emerging Market ETFs to Watch as the U.S. Dollar Weakens",
        "Description":"As U.S. interest rates remain elevated and the dollar continues its strong run for much of 2024, emerging market equities have still delivered impressive performances. While trailing behind the S&P 500, the iShares MSCI Emerging Markets ETF NYSE: EEM has clim…",
        "Content":"As U.S. interest rates remain elevated and the dollar continues its strong run for much of 2024, emerging market equities have still delivered impressive performances. While trailing behind the S&amp… [+141 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/065df7ef4bb1a09c"
    },
    {
        "Date":"2024-09-05T12:43:02Z",
        "Title":"S&P 500 futures slide for a third day after weak ADP jobs data, tech shares lead decline: Live updates",
        "Description":"S&P 500 futures slide for a third day after weak ADP jobs data, tech shares lead decline: Live updates CNBC\nAugust private payrolls rose by 99,000, smallest gain since 2021 and far below estimates, ADP says CNBC\nADP National Employment Report: Private Sector …",
        "Content":"S&amp;P 500 futures slide for a third day after weak ADP jobs data, tech shares lead decline: Live updates CNBCAugust private payrolls rose by 99,000, smallest gain since 2021 and far below estimates… [+137 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/329f04b95ef8935a"
    },
    {
        "Date":"2024-09-05T12:41:57Z",
        "Title":"Stock market today: Nasdaq, S&P 500 futures slide amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stock futures turned lower on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the health of the US … [+1579 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-nasdaq-sp-500-futures-slide-amid-more-soft-jobs-market-data-124157907.html"
    },
    {
        "Date":"2024-09-05T12:41:03Z",
        "Title":"Financial Counselors Inc. Raises Holdings in Sanofi (NASDAQ:SNY)",
        "Description":"Financial Counselors Inc. increased its position in Sanofi (NASDAQ:SNY – Free Report) by 22.4% in the 2nd quarter, Holdings Channel reports. The firm owned 10,835 shares of the company’s stock after buying an additional 1,984 shares during the period. Financi…",
        "Content":"Financial Counselors Inc. increased its position in Sanofi (NASDAQ:SNY – Free Report) by 22.4% in the 2nd quarter, Holdings Channel reports. The firm owned 10,835 shares of the company’s stock after … [+3835 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/financial-counselors-inc-raises-holdings-in-sanofi-nasdaqsny\/"
    },
    {
        "Date":"2024-09-05T12:35:39Z",
        "Title":"Archer Investment Corp Purchases 853 Shares of FT Cboe Vest U.S. Equity Moderate Buffer ETF – May (NYSEARCA:GMAY)",
        "Description":"Archer Investment Corp grew its position in FT Cboe Vest U.S. Equity Moderate Buffer ETF – May (NYSEARCA:GMAY – Free Report) by 2,369.4% in the second quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission. The fund …",
        "Content":"Archer Investment Corp grew its position in FT Cboe Vest U.S. Equity Moderate Buffer ETF – May (NYSEARCA:GMAY – Free Report) by 2,369.4% in the second quarter, according to its most recent Form 13F f… [+2280 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/archer-investment-corp-purchases-853-shares-of-ft-cboe-vest-u-s-equity-moderate-buffer-etf-may-nysearcagmay\/"
    },
    {
        "Date":"2024-09-05T12:33:13Z",
        "Title":"Possible US corporate tax reforms may alter outlook for S&P 500 earnings - GS",
        "Description":"Possible US corporate tax reforms may alter outlook for S&P 500 earnings - GS",
        "Content":"Investing.com -- Reforms to the US corporate tax code following November's presidential election could change the outlook for earnings for S&amp;P 500 companies, according to analysts at Goldman Sach… [+969 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/stock-market-news\/possible-us-corporate-tax-reforms-may-alter-outlook-for-sp-500-earnings--gs-3602844"
    },
    {
        "Date":"2024-09-05T12:32:58Z",
        "Title":"Archer Investment Corp Has $76,000 Stock Holdings in iShares S&P 500 Value ETF (NYSEARCA:IVE)",
        "Description":"Archer Investment Corp lessened its position in iShares S&P 500 Value ETF (NYSEARCA:IVE – Free Report) by 35.5% during the 2nd quarter, Holdings Channel reports. The firm owned 416 shares of the company’s stock after selling 229 shares during the quarter. Arc…",
        "Content":"Archer Investment Corp lessened its position in iShares S&amp;P 500 Value ETF (NYSEARCA:IVE – Free Report) by 35.5% during the 2nd quarter, Holdings Channel reports. The firm owned 416 shares of the … [+3021 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/archer-investment-corp-has-76000-stock-holdings-in-ishares-sp-500-value-etf-nysearcaive\/"
    },
    {
        "Date":"2024-09-05T12:32:56Z",
        "Title":"Founders Financial Securities LLC Has $679,000 Stock Holdings in iShares S&P 500 Growth ETF (NYSEARCA:IVW)",
        "Description":"Founders Financial Securities LLC raised its stake in iShares S&P 500 Growth ETF (NYSEARCA:IVW – Free Report) by 14.9% during the 2nd quarter, according to the company in its most recent 13F filing with the SEC. The firm owned 7,338 shares of the company’s st…",
        "Content":"Founders Financial Securities LLC raised its stake in iShares S&amp;P 500 Growth ETF (NYSEARCA:IVW – Free Report) by 14.9% during the 2nd quarter, according to the company in its most recent 13F fili… [+2505 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/founders-financial-securities-llc-has-679000-stock-holdings-in-ishares-sp-500-growth-etf-nysearcaivw\/"
    },
    {
        "Date":"2024-09-05T12:32:49Z",
        "Title":"Archer Investment Corp Sells 12,975 Shares of FT Cboe Vest U.S. Equity Moderate Buffer ETF – December (NYSEARCA:GDEC)",
        "Description":"Archer Investment Corp trimmed its holdings in FT Cboe Vest U.S. Equity Moderate Buffer ETF – December (NYSEARCA:GDEC – Free Report) by 79.2% in the second quarter, according to its most recent disclosure with the Securities & Exchange Commission. The fund ow…",
        "Content":"Archer Investment Corp trimmed its holdings in FT Cboe Vest U.S. Equity Moderate Buffer ETF – December (NYSEARCA:GDEC – Free Report) by 79.2% in the second quarter, according to its most recent discl… [+2300 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/archer-investment-corp-sells-12975-shares-of-ft-cboe-vest-u-s-equity-moderate-buffer-etf-december-nysearcagdec\/"
    },
    {
        "Date":"2024-09-05T12:32:48Z",
        "Title":"Archer Investment Corp Sells 804 Shares of Innovator Premium Income 30 Barrier ETF – October (BATS:OCTJ)",
        "Description":"Archer Investment Corp trimmed its holdings in shares of Innovator Premium Income 30 Barrier ETF – October (BATS:OCTJ – Free Report) by 20.8% in the 2nd quarter, according to its most recent Form 13F filing with the Securities and Exchange Commission. The fir…",
        "Content":"Archer Investment Corp trimmed its holdings in shares of Innovator Premium Income 30 Barrier ETF – October (BATS:OCTJ – Free Report) by 20.8% in the 2nd quarter, according to its most recent Form 13F… [+2434 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/archer-investment-corp-sells-804-shares-of-innovator-premium-income-30-barrier-etf-october-batsoctj\/"
    },
    {
        "Date":"2024-09-05T12:30:26Z",
        "Title":"Funeral business' slow but inevitable march attracts investors to these stocks",
        "Description":"Death and taxes, the saying goes, are the only certainties in life",
        "Content":"NEW YORK -- Death and taxes, the saying goes, are the only certainties in life. If so, funeral companies like Houston's Service Corporation International might look like a sure bet to investors.\r\nThe… [+2767 chars]",
        "Source":"ABC News",
        "URL":"https:\/\/abcnews.go.com\/Business\/wireStory\/funeral-business-slow-inevitable-march-attracts-investors-stocks-113413006"
    },
    {
        "Date":"2024-09-05T12:27:00Z",
        "Title":"5 things to know before the stock market opens Thursday",
        "Description":"Here are the most important news items that investors need to start their trading day.",
        "Content":"Here are the most important news items that investors need to start their trading day:\r\n1. Another day down\r\nThe S&amp;P 500 and Nasdaq Composite moved lower for the second trading session in a row, … [+4135 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/5-things-to-know-before-the-stock-market-opens-thursday-september-5.html"
    },
    {
        "Date":"2024-09-05T12:21:34Z",
        "Title":"Bitcoin Could Hit $400,000 Before the End of this Cycle if Trump Wins and Keeps His Crypto Promises, Predicts Serial Entrepreneur Mark Moss",
        "Description":"In a recent interview with Michelle Makori, Lead Anchor and Editor-in-Chief at Kitco News, Mark Moss, host of the ‘Mark Moss Show’ and Partner of the Bitcoin Opportunity Fund, discussed his bullish outlook on Bitcoin, predicting that its price could reach $1 …",
        "Content":"In a recent interview with Michelle Makori, Lead Anchor and Editor-in-Chief at Kitco News, Mark Moss, host of the Mark Moss Show and Partner of the Bitcoin Opportunity Fund, discussed his bullish out… [+5180 chars]",
        "Source":"CryptoGlobe",
        "URL":"https:\/\/www.cryptoglobe.com\/latest\/2024\/09\/bitcoin-could-hit-400000-before-the-end-of-this-cycle-if-trump-wins-and-keeps-his-crypto-promises-predicts-serial-entrepreneur-mark-moss\/"
    },
    {
        "Date":"2024-09-05T12:21:09Z",
        "Title":"SPDR S&P 500 ETF Trust: Pivot points",
        "Description":"See the rest of the story here.\n\nthefly.com provides the latest financial news as it breaks. Known as a leader in market intelligence, The Fly's real-time, streaming news feed keeps individual investors, professional money managers, active traders, and corpor…",
        "Content":"Earnings calls, analyst events, roadshows and more",
        "Source":"Thefly.com",
        "URL":"https:\/\/thefly.com\/permalinks\/entry.php\/id3979017\/SPY-SPDR-SampP--ETF-Trust-Pivot-points"
    },
    {
        "Date":"2024-09-05T12:21:06Z",
        "Title":"Is Automatic Data Processing Stock Underperforming the S&P 500?",
        "Description":"Less than $10\/month! View ALL results for your Stocks, ETFs and Funds Screeners with Barchart Plus.\nFREE 30 Day Trial\n- Market Pulse\n-\n- Options Market Overview\n- Unusual Options Activity\n- IV Rank and IV Percentile\n- Most Active Options\n- Unusual Options Vol…",
        "Content":"Less than $10\/month! View ALL results for your Stocks, ETFs and Funds Screeners with Barchart Plus.FREE 30 Day Trial- Market Pulse-- Options Market Overview- Unusual Options Activity- IV Rank and IV … [+121 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/12368aa9a9b0dbc5"
    },
    {
        "Date":"2024-09-05T12:20:49Z",
        "Title":"Funeral business' slow but inevitable march attracts investors to these stocks",
        "Description":"Death and taxes, the saying goes, are the only certainties in life. If so, funeral companies like Houston’s Service Corporation International might look like a sure bet to investors. The slow-growing but inevitable business is supported by the aging U.S. popu…",
        "Content":"FILE - Workers prepare a gravesite, lower left, April 1, 2020, at Calvary Cemetery in the Queens borough of New York.Mark Lennihan\/AP\r\nNEW YORK (AP) Death and taxes, the saying goes, are the only cer… [+3046 chars]",
        "Source":"seattlepi.com",
        "URL":"https:\/\/www.seattlepi.com\/business\/article\/funeral-business-slow-but-inevitable-march-19744763.php"
    },
    {
        "Date":"1970-01-01T00:00:00Z",
        "Title":"[Removed]",
        "Description":"[Removed]",
        "Content":"[Removed]",
        "Source":"[Removed]",
        "URL":"https:\/\/removed.com"
    },
    {
        "Date":"2024-09-05T12:15:00Z",
        "Title":"Regency Centers to Present at the BofA Securities 2024 Global Real Estate Conference",
        "Description":"JACKSONVILLE, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Regency Centers Corporation (“Regency Centers” or the “Company”) (Nasdaq: REG) today announced that Mike Mas, Executive Vice President and Chief Financial Officer, is scheduled to make a presentation at t…",
        "Content":"JACKSONVILLE, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Regency Centers Corporation (Regency Centers or the Company) (Nasdaq: REG) today announced that Mike Mas, Executive Vice President and Chief Fin… [+1144 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941336\/37116\/en\/Regency-Centers-to-Present-at-the-BofA-Securities-2024-Global-Real-Estate-Conference.html"
    },
    {
        "Date":"2024-09-05T12:08:05Z",
        "Title":"PayPal pushes into in-person payments with cashback rewards, Apple integration",
        "Description":"The bid to grab a slice of in-person purchases at stores, cafes and restaurants is part of an ambitious turnaround strategy by new CEO Alex Chriss who joined the company from Intuit last year.",
        "Content":"PayPal is expanding into U.S. point-of-sale payments by integrating its debit card with Apple's mobile wallet and offering cashback rewards, as the global online payments giant seeks direct competiti… [+2295 chars]",
        "Source":"The Times of India",
        "URL":"https:\/\/economictimes.indiatimes.com\/tech\/technology\/paypal-pushes-into-in-person-payments-with-cashback-rewards-apple-integration\/articleshow\/113097116.cms"
    },
    {
        "Date":"2024-09-05T12:05:48Z",
        "Title":"PayPal pushes into in-person payments with cashback rewards, Apple integration",
        "Description":"PayPal is expanding into U.S. point-of-sale payments by integrating its debit card with Apple's mobile wallet and offering cashback rewards, as the global online payments giant seeks direct competition with tech companies and banks.The bid to grab a slice of …",
        "Content":"PayPal is expanding into U.S. point-of-sale payments by integrating its debit card with Apple's mobile wallet and offering cashback rewards, as the global online payments giant seeks direct competiti… [+2344 chars]",
        "Source":"CNA",
        "URL":"https:\/\/www.channelnewsasia.com\/business\/paypal-pushes-person-payments-cashback-rewards-apple-integration-4588781"
    },
    {
        "Date":"2024-09-05T12:05:48Z",
        "Title":"PayPal pushes into in-person payments with cashback rewards, Apple integration",
        "Description":"PayPal is expanding into U.S. point-of-sale payments by integrating its debit card with Apple's mobile wallet and offering cashback rewards, as the global...",
        "Content":"By Hannah Lang\r\n(Reuters) - PayPal is expanding into U.S. point-of-sale payments by integrating its debit card with Apple's mobile wallet and offering cashback rewards, as the global online payments … [+2414 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/paypal-pushes-person-payments-cashback-120548629.html"
    },
    {
        "Date":"2024-09-05T12:00:03Z",
        "Title":"Analysts Predict The Start Of Crypto’s First Ever Secular Bear Market",
        "Description":"A new narrative is emerging among seasoned crypto analysts who are now forecasting the advent of the industry’s first ever secular bear market. This prediction suggests a sweeping transformation could be imminent, characterized by a prolonged downturn lasting…",
        "Content":"A new narrative is emerging among seasoned crypto analysts who are now forecasting the advent of the industrys first ever secular bear market. This prediction suggests a sweeping transformation could… [+3996 chars]",
        "Source":"newsBTC",
        "URL":"http:\/\/www.newsbtc.com\/news\/start-of-crypto-first-ever-secular-bear-market\/"
    },
    {
        "Date":"2024-09-05T12:00:01Z",
        "Title":"Why the LA Rams are worth $2 billion more than the LA Chargers",
        "Description":"The Rams have a recent Super Bowl to their name and the Chargers don't, but the gap in value is about much more than performance. It's about stadium economics.",
        "Content":"There is a $2 billion gulf growing in Los Angeles.\r\nThe National Football League's Los Angeles Rams, No. 2 on CNBC's Official 2024 NFL Team Valuations list, are worth $8 billion, while the Los Angele… [+4426 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/los-angeles-rams-vs-chargers-value.html"
    },
    {
        "Date":"2024-09-05T12:00:01Z",
        "Title":"The Cowboys are worth $11 billion. Here's how Dallas went from losing $1 million a month to topping the NFL in value",
        "Description":"The Cowboys are the most profitable team in the NFL, ahead of the New England Patriots, according to CNBC's 2024 Valuations list.",
        "Content":"DaRon Bland, #26 of the Dallas Cowboys, celebrates after an interception returned for a touchdown in the game against the Washington Commanders during the fourth quarter at AT&amp;T Stadium in Arling… [+4689 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/dallas-cowboys-most-valuable-nfl-team.html"
    },
    {
        "Date":"2024-09-05T12:00:01Z",
        "Title":"Rising NFL valuations mean massive returns for owners. Here's how good the investment is",
        "Description":"The returns NFL owners have seen on their initial investments dwarf the gains of traditional stocks over matching time periods.",
        "Content":"Ryan Flournoy, #18 of the Dallas Cowboys, catches a touchdown pass as Matt Hankins, #23 of the Los Angeles Chargers, defends during the first half of a preseason game at AT&amp;T Stadium in Arlington… [+9727 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/rising-nfl-valuations-massive-returns-for-owners.html"
    },
    {
        "Date":"2024-09-05T12:00:00Z",
        "Title":"Intel Stock Could Dive To $10",
        "Description":"Intel’s Revenues could languish around current levels Intel’s sales have declined considerably of late.",
        "Content":"CHINA - 2024\/08\/28: In this photo illustration, an Intel logo is displayed on the screen of a ... [+] smartphone. (Photo Illustration by Sheldon Cooper\/SOPA Images\/LightRocket via Getty Images)\r\nSOPA… [+9037 chars]",
        "Source":"Forbes",
        "URL":"https:\/\/www.forbes.com\/sites\/greatspeculations\/2024\/09\/05\/intel-stock-could-dive-to-10\/"
    },
    {
        "Date":"2024-09-05T11:58:01Z",
        "Title":"Kamala Harris' tax plan may cut down 5% of corporate profits: Goldman Sachs",
        "Description":"On Wednesday, Harris said Trump's plans would cut off federal programs that offer loans to small businesses, cut the corporate tax rate and push the US deficit higher",
        "Content":"On Wednesday, Harris said Trump's plans would cut off federal programs that offer loans to small businesses, cut the corporate tax rate and push the US deficit higher\r\nGoldman Sachs (Photo: Reuters)\r… [+2440 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/world-news\/kamala-harris-tax-plan-may-cut-down-5-of-corporate-profits-goldman-sachs-124090501023_1.html"
    },
    {
        "Date":"2024-09-05T11:53:39Z",
        "Title":"Stocks Pause Days of Losses Ahead of US Jobs Data: Markets Wrap - Yahoo Finance",
        "Description":"Stocks Pause Days of Losses Ahead of US Jobs Data: Markets WrapYahoo Finance Stock futures are flat after two straight down days for S&P 500, Nasdaq: Live updatesCNBC Morning Bid: Stocks calmed as action switches to rates, jobsReuters US Futures Signal Steady…",
        "Content":"Check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your GitHub releases to SourceForge quickly a… [+228 chars]",
        "Source":"Slashdot.org",
        "URL":"https:\/\/slashdot.org\/firehose.pl?op=view&amp;id=174926036"
    },
    {
        "Date":"2024-09-05T11:53:00Z",
        "Title":"Sensex slips 151 pts, Nifty ends below 25,150 ahead of US data",
        "Description":"Domestic equity benchmarks closed slightly lower on Thursday, with the Nifty50 settling below 25,150 after reaching a high of 25,275.45. Volatility was heightened due to the expiry of weekly index options on the NSE. IT, media, and consumer durables stocks ou…",
        "Content":"Domestic equity benchmarks closed slightly lower on Thursday, with the Nifty50 settling below 25,150 after reaching a high of 25,275.45. Volatility was heightened due to the expiry of weekly index op… [+6133 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/capital-market-news\/sensex-slips-151-pts-nifty-ends-below-25-150-ahead-of-us-data-124090501029_1.html"
    },
    {
        "Date":"2024-09-05T11:50:06Z",
        "Title":"Is Verizon’s Acquisition Of Frontier A Good Idea?",
        "Description":"Wireless behemoth Verizon announced early Thursday morning that it would be acquiring Frontier Communications - the largest pure-play fiber internet provider in the U....",
        "Content":"OCEANSIDE, NEW YORK - AUGUST 23: A general view of a Verizon store on August 23, 2024 in Oceanside, ... [+] New York. Long Island is the home for a plethora of local and national business concerns. (… [+3874 chars]",
        "Source":"Forbes",
        "URL":"https:\/\/www.forbes.com\/sites\/greatspeculations\/2024\/09\/05\/is-verizons-acquisition-of-frontier-a-good-idea\/"
    },
    {
        "Date":"2024-09-05T11:47:45Z",
        "Title":"Bulls need a lot of help but the stock market isn’t willing to give it",
        "Description":"S&P 500 is facing resistance to move higher; 5,370 is the number to watch.",
        "Content":"S&amp;P 500 is facing resistance to move higher; 5,370 is the number to watch.\r\nThis story appeared on marketwatch.com, 2024-09-05.",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/0c871e6e8ad4d69c"
    },
    {
        "Date":"2024-09-05T11:46:56Z",
        "Title":"Wolverine Asset Management LLC Grows Stock Position in Camden Property Trust (NYSE:CPT)",
        "Description":"Wolverine Asset Management LLC increased its holdings in Camden Property Trust (NYSE:CPT – Free Report) by 91.5% during the 2nd quarter, according to its most recent 13F filing with the Securities & Exchange Commission. The institutional investor owned 12,492…",
        "Content":"Wolverine Asset Management LLC increased its holdings in Camden Property Trust (NYSE:CPT – Free Report) by 91.5% during the 2nd quarter, according to its most recent 13F filing with the Securities &a… [+5372 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/wolverine-asset-management-llc-grows-stock-position-in-camden-property-trust-nysecpt\/"
    },
    {
        "Date":"2024-09-05T11:44:47Z",
        "Title":"Natixis Advisors LLC Boosts Stock Holdings in Extra Space Storage Inc. (NYSE:EXR)",
        "Description":"Natixis Advisors LLC grew its position in Extra Space Storage Inc. (NYSE:EXR – Free Report) by 35.0% during the 2nd quarter, HoldingsChannel.com reports. The fund owned 106,593 shares of the real estate investment trust’s stock after buying an additional 27,6…",
        "Content":"Natixis Advisors LLC grew its position in Extra Space Storage Inc. (NYSE:EXR – Free Report) by 35.0% during the 2nd quarter, HoldingsChannel.com reports. The fund owned 106,593 shares of the real est… [+6509 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/natixis-advisors-llc-boosts-stock-holdings-in-extra-space-storage-inc-nyseexr\/"
    },
    {
        "Date":"2024-09-05T11:42:58Z",
        "Title":"Fiera Capital Corp Lowers Position in Vanguard S&P 500 Value ETF (NYSEARCA:VOOV)",
        "Description":"Fiera Capital Corp decreased its stake in shares of Vanguard S&P 500 Value ETF (NYSEARCA:VOOV – Free Report) by 4.7% during the 2nd quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The fund owned 5,998…",
        "Content":"Fiera Capital Corp decreased its stake in shares of Vanguard S&amp;P 500 Value ETF (NYSEARCA:VOOV – Free Report) by 4.7% during the 2nd quarter, according to the company in its most recent disclosure… [+2422 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/fiera-capital-corp-lowers-position-in-vanguard-sp-500-value-etf-nysearcavoov\/"
    },
    {
        "Date":"2024-09-05T11:40:55Z",
        "Title":"Concurrent Investment Advisors LLC Purchases Shares of 790 Essex Property Trust, Inc. (NYSE:ESS)",
        "Description":"Concurrent Investment Advisors LLC acquired a new position in shares of Essex Property Trust, Inc. (NYSE:ESS – Free Report) in the 2nd quarter, according to its most recent filing with the Securities & Exchange Commission. The fund acquired 790 shares of the …",
        "Content":"Concurrent Investment Advisors LLC acquired a new position in shares of Essex Property Trust, Inc. (NYSE:ESS – Free Report) in the 2nd quarter, according to its most recent filing with the Securities… [+6145 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/concurrent-investment-advisors-llc-purchases-shares-of-790-essex-property-trust-inc-nyseess\/"
    },
    {
        "Date":"2024-09-05T11:38:24Z",
        "Title":"Mogo to Participate in the H.C. Wainwright 26th Annual Global Investment Conference",
        "Description":"VANCOUVER, British Columbia — Mogo Inc. (NASDAQ:MOGO) (TSX:MOGO) (“Mogo” or the “Company”), a digital wealth and payments business, today announced that Greg Feller, President, will be participating in the H.C. Wainwright 26th Annual Global Investment Confere…",
        "Content":"VANCOUVER, British Columbia Mogo Inc. (NASDAQ:MOGO) (TSX:MOGO) (Mogo or the Company), a digital wealth and payments business, today announced that Greg Feller, President, will be participating in the… [+1884 chars]",
        "Source":"Financial Post",
        "URL":"https:\/\/financialpost.com\/pmn\/business-wire-news-releases-pmn\/mogo-to-participate-in-the-h-c-wainwright-26th-annual-global-investment-conference"
    },
    {
        "Date":"2024-09-05T11:36:55Z",
        "Title":"Verizon To Acquire Frontier In $20B Deal, Reaffirms FY24 Outlook",
        "Description":"Frontier Communications Parent, Inc. (NASDAQ:FYBR) shares are trading lower after the company inked an acquisition deal with Verizon Communications Inc...",
        "Content":"Verizon To Acquire Frontier In $20B Deal, Reaffirms FY24 Outlook\r\nFrontier Communications Parent, Inc. (NASDAQ:FYBR) shares are trading lower after the company inked an acquisition deal with Verizon … [+2663 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/verizon-acquire-frontier-20b-deal-113655353.html"
    },
    {
        "Date":"2024-09-05T11:36:44Z",
        "Title":"Stocks Pause Days of Losses Ahead of US Jobs Data: Markets Wrap",
        "Description":"Stocks Pause Days of Losses Ahead of US Jobs Data: Markets Wrap Yahoo Finance\nStock futures are flat after two straight down days for S&P 500, Nasdaq: Live updates CNBC\nMorning Bid: Stocks calmed as action switches to rates, jobs Reuters\nOpinion | The Point: …",
        "Content":"Stocks Pause Days of Losses Ahead of US Jobs Data: Markets Wrap Yahoo FinanceStock futures are flat after two straight down days for S&amp;P 500, Nasdaq: Live updates CNBCMorning Bid: Stocks calmed a… [+139 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/203d9b4ba96cc7e6"
    },
    {
        "Date":"2024-09-05T11:35:02Z",
        "Title":"TIAA Trust National Association Has $3.19 Million Stake in iShares S&P 500 Value ETF (NYSEARCA:IVE)",
        "Description":"TIAA Trust National Association grew its holdings in shares of iShares S&P 500 Value ETF (NYSEARCA:IVE – Free Report) by 0.8% during the second quarter, according to the company in its most recent filing with the Securities & Exchange Commission. The institut…",
        "Content":"TIAA Trust National Association grew its holdings in shares of iShares S&amp;P 500 Value ETF (NYSEARCA:IVE – Free Report) by 0.8% during the second quarter, according to the company in its most recen… [+2858 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/tiaa-trust-national-association-has-3-19-million-stake-in-ishares-sp-500-value-etf-nysearcaive\/"
    },
    {
        "Date":"2024-09-05T11:30:44Z",
        "Title":"Ryan Specialty subsidiary to issue $500 million in senior notes",
        "Description":"Ryan Specialty subsidiary to issue $500 million in senior notes",
        "Content":"CHICAGO - Ryan Specialty Holdings, Inc. (NYSE: RYAN), a global specialty insurance organization, disclosed on Monday its plans for a private offering of senior secured notes by its indirect subsidiar… [+5097 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/company-news\/ryan-specialty-subsidiary-to-issue-500-million-in-senior-notes-93CH-3602713"
    },
    {
        "Date":"2024-09-05T11:24:56Z",
        "Title":"Rhumbline Advisers Purchases 44,260 Shares of iShares Core S&P 500 ETF (NYSEARCA:IVV)",
        "Description":"Rhumbline Advisers increased its position in iShares Core S&P 500 ETF (NYSEARCA:IVV – Free Report) by 44.7% in the second quarter, according to its most recent 13F filing with the Securities and Exchange Commission (SEC). The fund owned 143,349 shares of the …",
        "Content":"Rhumbline Advisers increased its position in iShares Core S&amp;P 500 ETF (NYSEARCA:IVV – Free Report) by 44.7% in the second quarter, according to its most recent 13F filing with the Securities and … [+3109 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/rhumbline-advisers-purchases-44260-shares-of-ishares-core-sp-500-etf-nysearcaivv\/"
    },
    {
        "Date":"2024-09-05T11:23:29Z",
        "Title":"Summit Financial LLC Makes New Investment in Host Hotels & Resorts, Inc. (NASDAQ:HST)",
        "Description":"Summit Financial LLC purchased a new stake in Host Hotels & Resorts, Inc. (NASDAQ:HST – Free Report) during the 2nd quarter, according to the company in its most recent filing with the Securities & Exchange Commission. The fund purchased 11,685 shares of the …",
        "Content":"Summit Financial LLC purchased a new stake in Host Hotels &amp; Resorts, Inc. (NASDAQ:HST – Free Report) during the 2nd quarter, according to the company in its most recent filing with the Securities… [+4688 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/summit-financial-llc-makes-new-investment-in-host-hotels-resorts-inc-nasdaqhst\/"
    },
    {
        "Date":"2024-09-05T11:18:53Z",
        "Title":"Rothschild Investment LLC Takes $67,000 Position in Realty Income Co. (NYSE:O)",
        "Description":"Rothschild Investment LLC acquired a new stake in Realty Income Co. (NYSE:O – Free Report) during the second quarter, according to its most recent Form 13F filing with the SEC. The firm acquired 1,275 shares of the real estate investment trust’s stock, valued…",
        "Content":"Rothschild Investment LLC acquired a new stake in Realty Income Co. (NYSE:O – Free Report) during the second quarter, according to its most recent Form 13F filing with the SEC. The firm acquired 1,27… [+5442 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/rothschild-investment-llc-takes-67000-position-in-realty-income-co-nyseo\/"
    },
    {
        "Date":"2024-09-05T11:12:52Z",
        "Title":"Financial Counselors Inc. Purchases Shares of 4,140 SPDR Portfolio S&P 500 Growth ETF (NYSEARCA:SPYG)",
        "Description":"Financial Counselors Inc. acquired a new position in SPDR Portfolio S&P 500 Growth ETF (NYSEARCA:SPYG – Free Report) in the 2nd quarter, according to its most recent 13F filing with the Securities & Exchange Commission. The firm acquired 4,140 shares of the c…",
        "Content":"Financial Counselors Inc. acquired a new position in SPDR Portfolio S&amp;P 500 Growth ETF (NYSEARCA:SPYG – Free Report) in the 2nd quarter, according to its most recent 13F filing with the Securitie… [+2304 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/financial-counselors-inc-purchases-shares-of-4140-spdr-portfolio-sp-500-growth-etf-nysearcaspyg\/"
    },
    {
        "Date":"2024-09-05T11:09:04Z",
        "Title":"Gryphon Digital Mining boosts operations with new acquisition",
        "Description":"Gryphon Digital Mining boosts operations with new acquisition",
        "Content":"LAS VEGAS - Gryphon Digital Mining, Inc. (NASDAQ:GRYP), a bitcoin mining company known for its environmentally sustainable practices, recently announced a significant expansion of its operations. The… [+5150 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/company-news\/gryphon-digital-mining-boosts-operations-with-new-acquisition-93CH-3602641"
    },
    {
        "Date":"2024-09-05T11:07:05Z",
        "Title":"CIBC Asset Management Inc Sells 1,374 Shares of Extra Space Storage Inc. (NYSE:EXR)",
        "Description":"CIBC Asset Management Inc decreased its stake in Extra Space Storage Inc. (NYSE:EXR – Free Report) by 4.6% in the 2nd quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission (SEC). The fund owned 28,478 shar…",
        "Content":"CIBC Asset Management Inc decreased its stake in Extra Space Storage Inc. (NYSE:EXR – Free Report) by 4.6% in the 2nd quarter, according to the company in its most recent 13F filing with the Securiti… [+6204 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/cibc-asset-management-inc-sells-1374-shares-of-extra-space-storage-inc-nyseexr\/"
    },
    {
        "Date":"2024-09-05T11:02:24Z",
        "Title":"Kamala Harris' tax plan may cut corporate profits by 5%, says Goldman Sachs",
        "Description":"Democratic presidential candidate Kamala Harris' proposed corporate tax hike to 28% could reduce S&P 500 company earnings by about 5%, according to Goldman Sachs analysts. They also noted that the broader economy might benefit if Democrats win the White House…",
        "Content":"Democratic presidential candidate Kamala Harris' proposed corporate tax hike could reduce S&amp;P 500 company earnings by about 5%, with additional taxes potentially hitting profits harder, Goldman S… [+1954 chars]",
        "Source":"The Times of India",
        "URL":"https:\/\/economictimes.indiatimes.com\/news\/international\/world-news\/kamala-harris-tax-plan-may-cut-corporate-profits-by-5-says-goldman-sachs\/articleshow\/113095184.cms"
    },
    {
        "Date":"2024-09-05T11:00:01Z",
        "Title":"One Issue That Unites a Divided America—Curbing Excessive CEO Pay | Opinion",
        "Description":"Nearly half of the country's largest low-wage corporations spent more on CEO pay-inflating stock buybacks than on capital expenditures over the past five years.",
        "Content":"At a time of intense political divisions, Americans across the political spectrum share enormous common ground on at least one problem—the extreme divide between CEO and worker pay.\r\nA recent Bentley… [+5151 chars]",
        "Source":"Newsweek",
        "URL":"https:\/\/www.newsweek.com\/one-issue-that-unites-divided-americacurbing-excessive-ceo-pay-opinion-1948806"
    },
    {
        "Date":"2024-09-05T11:00:00Z",
        "Title":"Why Is Xpeng Stock Down 50% This Year?",
        "Description":"Chinese luxury EV maker Xpeng delivered a total of 14,036 vehicles in August, up 2.5% compared to last year and up 26% versus last month.",
        "Content":"BANGKOK, THAILAND - 2024\/08\/30: Visitors inspect a Xpeng G6 car during the Thailand Big Motor Sale ... [+] 2024 at Bangkok International Trade and Exhibition Center (BITEC). (Photo by Peerapon Boonya… [+3956 chars]",
        "Source":"Forbes",
        "URL":"https:\/\/www.forbes.com\/sites\/greatspeculations\/2024\/09\/05\/why-is-xpeng-stock-down-50-this-year\/"
    },
    {
        "Date":"2024-09-05T10:52:39Z",
        "Title":"Stock futures are flat after two straight down days for S&P 500, Nasdaq: Live updates - CNBC",
        "Description":"Stock futures are flat after two straight down days for S&P 500, Nasdaq: Live updatesCNBC Stock Market News, Sept. 4, 2024: S&P 500, Nasdaq Extend Declines Ahead of Jobs ReportThe Wall Street Journal Futures steady, private payrolls and jobless claims ahead -…",
        "Content":"Check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your GitHub releases to SourceForge quickly a… [+228 chars]",
        "Source":"Slashdot.org",
        "URL":"https:\/\/slashdot.org\/firehose.pl?op=view&amp;id=174925418"
    },
    {
        "Date":"2024-09-05T10:50:54Z",
        "Title":"Ritholtz Wealth Management Grows Stake in iShares S&P 500 Growth ETF (NYSEARCA:IVW)",
        "Description":"Ritholtz Wealth Management lifted its stake in iShares S&P 500 Growth ETF (NYSEARCA:IVW – Free Report) by 36.0% in the 2nd quarter, Holdings Channel.com reports. The firm owned 5,449 shares of the company’s stock after buying an additional 1,441 shares during…",
        "Content":"Ritholtz Wealth Management lifted its stake in iShares S&amp;P 500 Growth ETF (NYSEARCA:IVW – Free Report) by 36.0% in the 2nd quarter, Holdings Channel.com reports. The firm owned 5,449 shares of th… [+2640 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/ritholtz-wealth-management-grows-stake-in-ishares-sp-500-growth-etf-nysearcaivw\/"
    },
    {
        "Date":"2024-09-05T10:48:51Z",
        "Title":"Stock market today: US futures steady as investors wait for next wave of data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stock futures were steady on Thursday as investors awaited fresh data to provide a reality check for both interest-rate cut hopes and growing doubts about the health of the US economy.\r\nFutures on… [+1334 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-us-futures-steady-as-investors-wait-for-next-wave-of-data-104851389.html"
    },
    {
        "Date":"2024-09-05T10:45:55Z",
        "Title":"Futures subdued as caution prevails ahead of jobs data",
        "Description":"U.S. stock index futures were flat to marginally lower ahead of a series of economic data on Thursday as investors scoured for clues to determine the size of the Federal Reserve's interest rate cut that is expected later this month.\nThe S&P 500 and the tech-h…",
        "Content":"U.S. stock index futures were flat to marginally lower ahead of a series of economic data on Thursday as investors scoured for clues to determine the size of the Federal Reserve's interest rate cut t… [+135 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/d898de3aab366eae"
    },
    {
        "Date":"2024-09-05T10:42:58Z",
        "Title":"Oregon Public Employees Retirement Fund Buys 97 Shares of Public Storage (NYSE:PSA)",
        "Description":"Oregon Public Employees Retirement Fund lifted its stake in shares of Public Storage (NYSE:PSA – Free Report) by 0.7% in the 2nd quarter, according to the company in its most recent 13F filing with the SEC. The institutional investor owned 13,585 shares of th…",
        "Content":"Oregon Public Employees Retirement Fund lifted its stake in shares of Public Storage (NYSE:PSA – Free Report) by 0.7% in the 2nd quarter, according to the company in its most recent 13F filing with t… [+5544 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/oregon-public-employees-retirement-fund-buys-97-shares-of-public-storage-nysepsa\/"
    },
    {
        "Date":"2024-09-05T10:42:58Z",
        "Title":"Founders Financial Securities LLC Increases Stock Holdings in Realty Income Co. (NYSE:O)",
        "Description":"Founders Financial Securities LLC increased its stake in shares of Realty Income Co. (NYSE:O – Free Report) by 0.9% during the 2nd quarter, according to its most recent filing with the SEC. The institutional investor owned 21,210 shares of the real estate inv…",
        "Content":"Founders Financial Securities LLC increased its stake in shares of Realty Income Co. (NYSE:O – Free Report) by 0.9% during the 2nd quarter, according to its most recent filing with the SEC. The insti… [+6023 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/founders-financial-securities-llc-increases-stock-holdings-in-realty-income-co-nyseo\/"
    },
    {
        "Date":"2024-09-05T10:42:57Z",
        "Title":"Founders Financial Securities LLC Reduces Stock Position in Public Storage (NYSE:PSA)",
        "Description":"Founders Financial Securities LLC trimmed its holdings in shares of Public Storage (NYSE:PSA – Free Report) by 1.7% in the second quarter, Holdings Channel reports. The institutional investor owned 3,401 shares of the real estate investment trust’s stock afte…",
        "Content":"Founders Financial Securities LLC trimmed its holdings in shares of Public Storage (NYSE:PSA – Free Report) by 1.7% in the second quarter, Holdings Channel reports. The institutional investor owned 3… [+6441 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/founders-financial-securities-llc-reduces-stock-position-in-public-storage-nysepsa\/"
    },
    {
        "Date":"2024-09-05T10:30:42Z",
        "Title":"Global investors, fund managers struggle to keep up as India's market grows",
        "Description":"Part of the reason for the long-term underweight has been that many investors preferred China's cheaper and dynamic market, while entry and exit costs for funds can be high in India",
        "Content":"Part of the reason for the long-term underweight has been that many investors preferred China's cheaper and dynamic market, while entry and exit costs for funds can be high in India\r\nRepresentative I… [+4803 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/news\/global-investors-fund-managers-struggle-to-keep-up-as-india-s-market-grows-124090500646_1.html"
    },
    {
        "Date":"2024-09-05T10:22:00Z",
        "Title":"Barometers end with moderate losses; Realty shares decline",
        "Description":"As per provisional closing data, the barometer index, the S&P BSE Sensex, declined 151.48 points or 0.18% to 82,201.16. The Nifty 50 index lost 53.60 points or 0.21% to 25,145.10.",
        "Content":"The key equity benchmarks ended with limited losses on Thursday. The Nifty settled below 25,150 level after hitting the days high of 25,275.45 in early trade. Midsmall healthcare, media and consumer … [+4649 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/capital-market-news\/barometers-end-with-moderate-losses-realty-shares-decline-124090500936_1.html"
    },
    {
        "Date":"2024-09-05T10:16:50Z",
        "Title":"Commonwealth Equity Services LLC Sells 45,723 Shares of FT Vest U.S. Equity Enhance & Moderate Buffer ETF – June (BATS:XJUN)",
        "Description":"Commonwealth Equity Services LLC reduced its holdings in FT Vest U.S. Equity Enhance & Moderate Buffer ETF – June (BATS:XJUN – Free Report) by 13.1% during the second quarter, according to the company in its most recent 13F filing with the SEC. The fund owned…",
        "Content":"Commonwealth Equity Services LLC reduced its holdings in FT Vest U.S. Equity Enhance &amp; Moderate Buffer ETF – June (BATS:XJUN – Free Report) by 13.1% during the second quarter, according to the co… [+2705 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/commonwealth-equity-services-llc-sells-45723-shares-of-ft-vest-u-s-equity-enhance-moderate-buffer-etf-june-batsxjun\/"
    },
    {
        "Date":"2024-09-05T10:16:49Z",
        "Title":"Commonwealth Equity Services LLC Has $11.27 Million Position in Innovator U.S. Equity Ultra Buffer ETF – October (BATS:UOCT)",
        "Description":"Commonwealth Equity Services LLC cut its stake in Innovator U.S. Equity Ultra Buffer ETF – October (BATS:UOCT – Free Report) by 1.1% during the second quarter, according to its most recent disclosure with the Securities and Exchange Commission. The fund owned…",
        "Content":"Commonwealth Equity Services LLC cut its stake in Innovator U.S. Equity Ultra Buffer ETF – October (BATS:UOCT – Free Report) by 1.1% during the second quarter, according to its most recent disclosure… [+2664 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/commonwealth-equity-services-llc-has-11-27-million-position-in-innovator-u-s-equity-ultra-buffer-etf-october-batsuoct\/"
    },
    {
        "Date":"2024-09-05T10:08:59Z",
        "Title":"TIAA Trust National Association Has $2.18 Million Stock Holdings in Invesco S&P 500 Equal Weight ETF (NYSEARCA:RSP)",
        "Description":"TIAA Trust National Association raised its holdings in Invesco S&P 500 Equal Weight ETF (NYSEARCA:RSP – Free Report) by 12.1% during the second quarter, according to its most recent disclosure with the Securities and Exchange Commission. The institutional inv…",
        "Content":"TIAA Trust National Association raised its holdings in Invesco S&amp;P 500 Equal Weight ETF (NYSEARCA:RSP – Free Report) by 12.1% during the second quarter, according to its most recent disclosure wi… [+2611 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/tiaa-trust-national-association-has-2-18-million-stock-holdings-in-invesco-sp-500-equal-weight-etf-nysearcarsp\/"
    },
    {
        "Date":"2024-09-05T10:08:57Z",
        "Title":"TIAA Trust National Association Buys 689 Shares of Vanguard S&P 500 Growth ETF (NYSEARCA:VOOG)",
        "Description":"TIAA Trust National Association lifted its stake in Vanguard S&P 500 Growth ETF (NYSEARCA:VOOG – Free Report) by 23.1% in the 2nd quarter, according to the company in its most recent filing with the Securities and Exchange Commission. The institutional invest…",
        "Content":"TIAA Trust National Association lifted its stake in Vanguard S&amp;P 500 Growth ETF (NYSEARCA:VOOG – Free Report) by 23.1% in the 2nd quarter, according to the company in its most recent filing with … [+2641 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/tiaa-trust-national-association-buys-689-shares-of-vanguard-sp-500-growth-etf-nysearcavoog\/"
    },
    {
        "Date":"2024-09-05T10:04:53Z",
        "Title":"Principal Financial Group Inc. Purchases 6,253 Shares of UDR, Inc. (NYSE:UDR)",
        "Description":"Principal Financial Group Inc. raised its position in shares of UDR, Inc. (NYSE:UDR – Free Report) by 1.7% in the 2nd quarter, Holdings Channel reports. The firm owned 369,170 shares of the real estate investment trust’s stock after acquiring an additional 6,…",
        "Content":"Principal Financial Group Inc. raised its position in shares of UDR, Inc. (NYSE:UDR – Free Report) by 1.7% in the 2nd quarter, Holdings Channel reports. The firm owned 369,170 shares of the real esta… [+5583 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/principal-financial-group-inc-purchases-6253-shares-of-udr-inc-nyseudr\/"
    },
    {
        "Date":"2024-09-05T14:46:00Z",
        "Title":"SHAREHOLDER ALERT: Class Action Lawsuit Filed on Behalf of GitLab Inc. (GTLB) Investors – Holzer & Holzer, LLC Encourages Investors With Significant Losses to Contact the Firm",
        "Description":"ATLANTA, Sept. 05, 2024 (GLOBE NEWSWIRE) -- A shareholder class action lawsuit has been filed against GitLab Inc. (“GitLab” or “the Company”) (NASDAQ: GTLB). The lawsuit alleges that Defendants disseminated materially false and misleading statements and\/or co…",
        "Content":"ATLANTA, Sept. 05, 2024 (GLOBE NEWSWIRE) -- A shareholder class action lawsuit has been filed against GitLab Inc. (GitLab or the Company) (NASDAQ: GTLB). The lawsuit alleges that Defendants dissemina… [+1504 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941535\/0\/en\/SHAREHOLDER-ALERT-Class-Action-Lawsuit-Filed-on-Behalf-of-GitLab-Inc-GTLB-Investors-Holzer-Holzer-LLC-Encourages-Investors-With-Significant-Losses-to-Contact-the-Firm.html"
    },
    {
        "Date":"2024-09-05T14:44:37Z",
        "Title":"Morning Bid: Stocks calmed as action switches to rates, jobs",
        "Description":"Morning Bid: Stocks calmed as action switches to rates, jobs Reuters\nS&P 500 and Nasdaq rise for first time in three days as tech tries to rebound: Live updates CNBC\nStock market today: S&P 500, Nasdaq climb amid more soft jobs market data Yahoo Finance\nStock…",
        "Content":"Morning Bid: Stocks calmed as action switches to rates, jobs ReutersS&amp;P 500 and Nasdaq rise for first time in three days as tech tries to rebound: Live updates CNBCStock market today: S&amp;P 500… [+142 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/3027b9722c0030d7"
    },
    {
        "Date":"2024-09-05T14:44:00Z",
        "Title":"Gainey McKenna & Egleston Announces A Class Action Lawsuit Has Been Filed Against GitLab Inc. (GTLB)",
        "Description":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Gainey McKenna & Egleston announces that a securities class action lawsuit has been filed in the United States District Court for the Northern District of California on behalf of all persons or entities who purchas…",
        "Content":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Gainey McKenna &amp; Egleston announces that a securities class action lawsuit has been filed in the United States District Court for the Northern Distric… [+2116 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941532\/10782\/en\/Gainey-McKenna-Egleston-Announces-A-Class-Action-Lawsuit-Has-Been-Filed-Against-GitLab-Inc-GTLB.html"
    },
    {
        "Date":"2024-09-05T14:42:00Z",
        "Title":"Gainey McKenna & Egleston Announces A Class Action Lawsuit Has Been Filed Against ZoomInfo Technologies, Inc. (ZI)",
        "Description":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Gainey McKenna & Egleston announces that a securities class action lawsuit has been filed in the United States District Court for the Western District of Washington on behalf of all persons or entities who purchase…",
        "Content":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Gainey McKenna &amp; Egleston announces that a securities class action lawsuit has been filed in the United States District Court for the Western District… [+2086 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941530\/10782\/en\/Gainey-McKenna-Egleston-Announces-A-Class-Action-Lawsuit-Has-Been-Filed-Against-ZoomInfo-Technologies-Inc-ZI.html"
    },
    {
        "Date":"2024-09-05T14:35:00Z",
        "Title":"Acasti to Participate in the H.C. Wainwright 26th Annual Global Investment Conference",
        "Description":"PRINCETON, N.J., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Acasti Pharma Inc. (Nasdaq: ACST) (Acasti or the Company), a late-stage, biopharma company advancing GTX-104, its novel injectable formulation of nimodipine that addresses high unmet medical needs for a rare…",
        "Content":"PRINCETON, N.J., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Acasti Pharma Inc. (Nasdaq: ACST) (Acasti or the Company), a late-stage, biopharma company advancing GTX-104, its novel injectable formulation of n… [+7903 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941525\/0\/en\/Acasti-to-Participate-in-the-H-C-Wainwright-26th-Annual-Global-Investment-Conference.html"
    },
    {
        "Date":"2024-09-05T14:34:37Z",
        "Title":"Why Peloton Stock Jumped 31% in August",
        "Description":"Shares of Peloton Interactive (NASDAQ: PTON) were soaring last month after the struggling connected-fitness company posted better-than-expected results in its fiscal fourth-quarter earnings report, showing investors that the business could finally be mounting…",
        "Content":"Shares of Peloton Interactive (NASDAQ: PTON) were soaring last month after the struggling connected-fitness company posted better-than-expected results in its fiscal fourth-quarter earnings report, s… [+130 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/ff4c24064a543d55"
    },
    {
        "Date":"2024-09-05T14:34:22Z",
        "Title":"1 Chart Shows Why Nvidia Is Still the Best \"Magnificent Seven\" Stock to Own",
        "Description":"Nvidia (NASDAQ: NVDA) has dominated stock market headlines over the last year, and for good reason.\nThe inventor of graphics processing units (GPUs) is leading the AI revolution as its chips have been in high demand ever since OpenAI unveiled ChatGPT in late …",
        "Content":"Nvidia (NASDAQ: NVDA) has dominated stock market headlines over the last year, and for good reason.The inventor of graphics processing units (GPUs) is leading the AI revolution as its chips have been… [+129 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/5d3c97a5041f235c"
    },
    {
        "Date":"2024-09-05T14:34:02Z",
        "Title":"Why the Stock Market Is So Jittery This Week",
        "Description":"LIVE UPDATES\nStock Market Mixed as ADP, Jobless Claims Provide Murky Picture\nThe Dow Jones Industrial Average was lower, the S&P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs report.\nLast Updated:\nSep. 5, 2024 at 10:28 AM EDT\n4 min ago\nWh…",
        "Content":"LIVE UPDATESStock Market Mixed as ADP, Jobless Claims Provide Murky PictureThe Dow Jones Industrial Average was lower, the S&amp;P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs r… [+130 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/789f6d3ea3df8017"
    },
    {
        "Date":"2024-09-05T14:32:17Z",
        "Title":"Crocs Announces Industry Leading Sustainability Milestone as the Brand Reaches 25% Bio-Circular Croslite Material Across Its Entire Product Portfolio",
        "Description":"Crocs Announces Industry Leading Sustainability Milestone as the Brand Reaches 25% Bio-Circular Croslite Material Across Its Entire Product Portfolio",
        "Content":"Announcement underscores the brand's unique approach to circularity through using more sustainable materials and progress to 2030 bio-circular goal\r\nBROOMFIELD, Colo.\r\n, Sept. 5, 2024\r\n \/PRNewswire\/ … [+4497 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/crocs-announces-industry-leading-sustainability-milestone-as-the-brand-reaches-25-biocircular-croslite-material-across-its-entire-product-portfolio-93CH-3603382"
    },
    {
        "Date":"2024-09-05T14:32:16Z",
        "Title":"Red Robin Gourmet Burgers, Inc. to Participate in Two Investor Conferences in September",
        "Description":"Red Robin Gourmet Burgers, Inc. to Participate in Two Investor Conferences in September",
        "Content":"ENGLEWOOD, Colo.\r\n, Sept. 5, 2024\r\n \/PRNewswire\/ -- Red Robin Gourmet (NASDAQ:RRGB) Burgers, Inc. (NASDAQ: RRGB) (\"Red Robin\" or the \"Company\"), a full-service restaurant chain serving an innovative … [+1818 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/red-robin-gourmet-burgers-inc-to-participate-in-two-investor-conferences-in-september-93CH-3603380"
    },
    {
        "Date":"2024-09-05T14:32:15Z",
        "Title":"AI Shapes Analytics for Complex, Expanding Supply Chains",
        "Description":"AI Shapes Analytics for Complex, Expanding Supply Chains",
        "Content":"Enterprises, providers tap into new technologies, integrated data to better monitor and manage operations, ISG Provider Lens report says\r\n STAMFORD, Conn.--(BUSINESS WIRE)--Many companies with comple… [+6495 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/ai-shapes-analytics-for-complex-expanding-supply-chains-93CH-3603379"
    },
    {
        "Date":"2024-09-05T14:24:00Z",
        "Title":"CSX President and Chief Executive Officer to Address Morgan Stanley Laguna Conference",
        "Description":"JACKSONVILLE, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) President and Chief Executive Officer, Joe Hinrichs, will address the 12th Annual Morgan Stanley Laguna Conference in California on Thursday, September 12, at 9:20 a.m. Pacific tim…",
        "Content":"JACKSONVILLE, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- CSX Corp. (NASDAQ: CSX) President and Chief Executive Officer, Joe Hinrichs, will address the 12th Annual Morgan Stanley Laguna Conference in Ca… [+1360 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941513\/0\/en\/CSX-President-and-Chief-Executive-Officer-to-Address-Morgan-Stanley-Laguna-Conference.html"
    },
    {
        "Date":"2024-09-05T14:20:00Z",
        "Title":"32\/2024・Trifork Group AG – Reporting of transactions made by persons discharging managerial responsibilities and persons closely associated with them",
        "Description":"Company announcement no. 32 \/ 2024 Schindellegi, Switzerland – 5 September 2024           Reporting of transactions made by persons discharging...",
        "Content":"Company announcement no. 32 \/ 2024 Schindellegi, Switzerland 5 September 2024\r\nReporting of transactions made by persons discharging managerial responsibilities and persons closely associated with th… [+4047 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941511\/0\/en\/32-2024-Trifork-Group-AG-Reporting-of-transactions-made-by-persons-discharging-managerial-responsibilities-and-persons-closely-associated-with-them.html"
    },
    {
        "Date":"2024-09-05T14:12:05Z",
        "Title":"Is T-Mobile Stock Outperforming the Nasdaq?",
        "Description":"UNLIMITED Watchlists, Portfolios, Screeners, and other Barchart tools with Barchart Premier.\nFREE 30 Day Trial\n- Market Pulse\n-\n- Options Market Overview\n- Unusual Options Activity\n- IV Rank and IV Percentile\n- Most Active Options\n- Unusual Options Volume\n- H…",
        "Content":"UNLIMITED Watchlists, Portfolios, Screeners, and other Barchart tools with Barchart Premier.FREE 30 Day Trial- Market Pulse-- Options Market Overview- Unusual Options Activity- IV Rank and IV Percent… [+126 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/4dbef7c5cd673dab"
    },
    {
        "Date":"2024-09-05T14:11:41Z",
        "Title":"ISM Services Data Provide Some Good News for Stocks",
        "Description":"LIVE UPDATES\nStock Market Mixed as ADP, Jobless Claims Provide Murky Picture\nThe Dow Jones Industrial Average was lower, the S&P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs report.\nLast Updated:\nSep. 5, 2024 at 10:07 AM EDT\n3 min ago\nIS…",
        "Content":"LIVE UPDATESStock Market Mixed as ADP, Jobless Claims Provide Murky PictureThe Dow Jones Industrial Average was lower, the S&amp;P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs r… [+134 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/f28d44b901ae1644"
    },
    {
        "Date":"2024-09-05T14:11:32Z",
        "Title":"Stock market today: Nasdaq, S&P 500 futures slide amid more soft jobs market data",
        "Description":"Stock market today: Nasdaq, S&P 500 futures slide amid more soft jobs market data Yahoo Finance\nStock market today: Nasdaq, S&P 500 waver amid more soft jobs market data Yahoo Finance\nStock Market Today: Dow Futures Little Changed; Bond Yields Hold Near Year …",
        "Content":"Stock market today: Nasdaq, S&amp;P 500 futures slide amid more soft jobs market data Yahoo FinanceStock market today: Nasdaq, S&amp;P 500 waver amid more soft jobs market data Yahoo FinanceStock Mar… [+144 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/c4c00d10a0821631"
    },
    {
        "Date":"2024-09-05T14:11:32Z",
        "Title":"Stock market today: Dow, Nasdaq seesaw amid more soft jobs market data",
        "Description":"Ines Ferré\nIn this article:\nUS stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the health of the US economy.\nThe S&P 500 (^GSPC) rose 0.4%, while…",
        "Content":"Ines FerréIn this article:US stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the heal… [+140 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/b8d2f7c019206bf5"
    },
    {
        "Date":"2024-09-05T14:07:36Z",
        "Title":"Oregon Public Employees Retirement Fund Acquires 114 Shares of Equinix, Inc. (NASDAQ:EQIX)",
        "Description":"Oregon Public Employees Retirement Fund boosted its holdings in shares of Equinix, Inc. (NASDAQ:EQIX – Free Report) by 1.4% in the second quarter, according to the company in its most recent 13F filing with the Securities and Exchange Commission (SEC). The fi…",
        "Content":"Oregon Public Employees Retirement Fund boosted its holdings in shares of Equinix, Inc. (NASDAQ:EQIX – Free Report) by 1.4% in the second quarter, according to the company in its most recent 13F fili… [+4967 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/oregon-public-employees-retirement-fund-acquires-114-shares-of-equinix-inc-nasdaqeqix\/"
    },
    {
        "Date":"2024-09-05T14:05:00Z",
        "Title":"NAPCO Security Technologies Investors Who Have Lost Money Should Contact Block & Leviton to Find Out How They Might Recover Money Through The Firm’s Investigation",
        "Description":"Block & Leviton is investigating NAPCO Security Technologies (Nasdaq: NSSC) for potential securities law violations. Investors should contact the firm.......",
        "Content":"BOSTON, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Block &amp; Leviton is investigating NAPCO Security Technologies (Nasdaq: NSSC) for potential securities law violations. Investors who have lost money in th… [+2494 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941501\/23044\/en\/NAPCO-Security-Technologies-Investors-Who-Have-Lost-Money-Should-Contact-Block-Leviton-to-Find-Out-How-They-Might-Recover-Money-Through-The-Firm-s-Investigation.html"
    },
    {
        "Date":"2024-09-05T14:04:10Z",
        "Title":"Acentra Health Awarded a $298 Million Contract Renewal from the Centers for Medicare & Medicaid Services to Continue Improving Care Quality for Medicare Beneficiaries",
        "Description":"Acentra Health Awarded a $298 Million Contract Renewal from the Centers for Medicare & Medicaid Services to Continue Improving Care Quality for Medicare Beneficiaries",
        "Content":"The company has established the largest geographic footprint of any CMS-contracted partner for beneficiary and family centered care-quality improvement services, serving Medicare enrollees across 29 … [+3734 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/acentra-health-awarded-a-298-million-contract-renewal-from-the-centers-for-medicare--medicaid-services-to-continue-improving-care-quality-for-medicare-beneficiaries-93CH-3603289"
    },
    {
        "Date":"2024-09-05T14:04:08Z",
        "Title":"2024 Principal ® Charity Classic raised record $8.6 million for Iowa youth",
        "Description":"2024 Principal ® Charity Classic raised record $8.6 million for Iowa youth",
        "Content":"More than $62 million raised since 2007\r\n DES MOINES, Iowa--(BUSINESS WIRE)--The Principal ® Charity Classic today announced its 2024 tournament raised a record $8.6 million in support of Iowa youth.… [+3490 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/2024-principal--charity-classic-raised-record-86-million-for-iowa-youth-93CH-3603288"
    },
    {
        "Date":"2024-09-05T14:03:41Z",
        "Title":"US stocks mixed following key labor market data",
        "Description":"US stocks mixed following key labor market data",
        "Content":"Investing.com -- U.S. stock futures traded largely flat Thursday, attempting to stabilize after a rocky start to the month ahead of key employment data for clues for future Federal Reserve monetary p… [+3009 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/stock-market-news\/us-stock-futures-steady-ahead-of-key-labor-market-data-3602279"
    },
    {
        "Date":"2024-09-05T13:57:00Z",
        "Title":"Powell Max Limited Announces Pricing of Initial Public Offering",
        "Description":"HONG KONG, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Powell Max Limited (Nasdaq: PMAX) (the “Company” or “Powell Max”), a financial communications services provider headquarted in Hong Kong, today announced the pricing of its initial public offering (the “Offering”)…",
        "Content":"HONG KONG, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Powell Max Limited (Nasdaq: PMAX) (the Company or Powell Max), a financial communications services provider headquarted in Hong Kong, today announced the… [+4154 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941487\/0\/en\/Powell-Max-Limited-Announces-Pricing-of-Initial-Public-Offering.html"
    },
    {
        "Date":"2024-09-05T13:56:52Z",
        "Title":"Fiera Capital Corp Purchases 1,204 Shares of Honeywell International Inc. (NASDAQ:HON)",
        "Description":"Fiera Capital Corp grew its holdings in Honeywell International Inc. (NASDAQ:HON – Free Report) by 10.7% during the second quarter, according to its most recent disclosure with the Securities & Exchange Commission. The fund owned 12,499 shares of the conglome…",
        "Content":"Fiera Capital Corp grew its holdings in Honeywell International Inc. (NASDAQ:HON – Free Report) by 10.7% during the second quarter, according to its most recent disclosure with the Securities &amp; E… [+5811 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/fiera-capital-corp-purchases-1204-shares-of-honeywell-international-inc-nasdaqhon\/"
    },
    {
        "Date":"2024-09-05T13:55:00Z",
        "Title":"Baltic Horizon Fund publishes its pre-contractual disclosure under SFDR",
        "Description":"Baltic Horizon Fund publishes its pre-contractual disclosure under article 8 or EU’s Sustainable Finance Disclosure Regulation (SFDR) (2019\/2088).        ...",
        "Content":"Baltic Horizon Fund publishes its pre-contractual disclosure under article 8 or EUs Sustainable Finance Disclosure Regulation (SFDR) (2019\/2088).\r\nThe disclosure is attached and can also be found on … [+1020 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941485\/0\/en\/Baltic-Horizon-Fund-publishes-its-pre-contractual-disclosure-under-SFDR.html"
    },
    {
        "Date":"2024-09-05T13:52:09Z",
        "Title":"Progress Announces Powerful New Generative AI Capabilities in Latest Release of MarkLogic Server",
        "Description":"Progress Announces Powerful New Generative AI Capabilities in Latest Release of MarkLogic Server",
        "Content":"New release more than doubles accuracy of response and simplifies development of secure generative AI-enhanced applications\r\nBURLINGTON, Mass., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Progress (Nasdaq: PR… [+4710 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/progress-announces-powerful-new-generative-ai-capabilities-in-latest-release-of-marklogic-server-93CH-3603248"
    },
    {
        "Date":"2024-09-05T13:52:06Z",
        "Title":"Beacon Joins Forces With U.S. Army to Create Career Opportunities for Veterans",
        "Description":"Beacon Joins Forces With U.S. Army to Create Career Opportunities for Veterans",
        "Content":"HERNDON, Va.--(BUSINESS WIRE)--Beacon (the Company) (Nasdaq: BECN) the leading publicly-traded wholesale distributor specializing in roofing, waterproofing and exterior products, announced today a pa… [+3181 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/beacon-joins-forces-with-us-army-to-create-career-opportunities-for-veterans-93CH-3603244"
    },
    {
        "Date":"2024-09-05T13:50:03Z",
        "Title":"Stock market today: Indexes mixed as investors assess labor data ahead of Friday payroll report",
        "Description":"Indexes were mixed on Thursday amid fresh labor data ahead of Friday's August nonfarm payroll report. Private payroll data was weaker than expected last month.",
        "Content":"Indexes wavered on Thursday as investors mulled mixed labor market data ahead of Friday's August jobs report.\r\nThe S&amp;P 500 and the Nasdaq Composite were slightly higher, while the Dow Jones Indus… [+1932 chars]",
        "Source":"Business Insider",
        "URL":"https:\/\/markets.businessinsider.com\/news\/stocks\/stock-market-today-jobless-claims-unemployment-payroll-openings-labor-department-2024-9"
    },
    {
        "Date":"2024-09-05T13:49:38Z",
        "Title":"Stock market today: Dow, Nasdaq seesaw amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the health of the US economy.\r\nThe… [+2674 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-dow-nasdaq-seesaw-amid-more-soft-jobs-market-data-134938592.html"
    },
    {
        "Date":"2024-09-05T13:49:38Z",
        "Title":"Stock market today: Dow falls, Nasdaq rises amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stocks were mixed on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest rate cut hopes and the health of the US economy.\r… [+3996 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-dow-falls-nasdaq-rises-amid-more-soft-jobs-market-data-134938786.html"
    },
    {
        "Date":"2024-09-05T13:49:38Z",
        "Title":"Stock market today: S&P 500, Nasdaq climb amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest rate cut hopes and the health of the US economy.\r\nThe… [+3340 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-sp-500-nasdaq-climb-amid-more-soft-jobs-market-data-134938220.html"
    },
    {
        "Date":"2024-09-05T13:43:29Z",
        "Title":"Legacy Capital Wealth Partners LLC Takes $297,000 Position in Westrock Coffee (NASDAQ:WEST)",
        "Description":"Legacy Capital Wealth Partners LLC purchased a new stake in shares of Westrock Coffee (NASDAQ:WEST – Free Report) during the second quarter, according to its most recent disclosure with the Securities & Exchange Commission. The institutional investor purchase…",
        "Content":"Legacy Capital Wealth Partners LLC purchased a new stake in shares of Westrock Coffee (NASDAQ:WEST – Free Report) during the second quarter, according to its most recent disclosure with the Securitie… [+5687 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/legacy-capital-wealth-partners-llc-takes-297000-position-in-westrock-coffee-nasdaqwest\/"
    },
    {
        "Date":"2024-09-05T13:31:00Z",
        "Title":"Pheton Holdings Ltd Announces Pricing of Initial Public Offering",
        "Description":"BEIJING, China, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Pheton Holdings Ltd (the “Company” or “Pheton”), a healthcare solution provider specializing in treatment planning systems for brachytherapy and other related products and services, today announced the pricin…",
        "Content":"BEIJING, China, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Pheton Holdings Ltd (the Company or Pheton), a healthcare solution provider specializing in treatment planning systems for brachytherapy and other r… [+4980 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941463\/0\/en\/Pheton-Holdings-Ltd-Announces-Pricing-of-Initial-Public-Offering.html"
    },
    {
        "Date":"2024-09-05T13:30:00Z",
        "Title":"Global Carbon Credit Trading Platform Market to Reach a Valuation of USD 815.0 Million by 2034 | Future Market Insights, Inc.",
        "Description":"The carbon credit trading platform market is experiencing robust growth, fueled by increasing global efforts to address climate change and reduce greenhouse gas emissions. Governments and organizations are implementing various regulations, such as cap-and-tra…",
        "Content":"NEWARK, Del, Sept. 05, 2024 (GLOBE NEWSWIRE) -- The global carbon credit trading platform market is anticipated to reach a valuation of USD 159.3 million in 2024, driven by participation of non-state… [+9501 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941461\/0\/en\/Global-Carbon-Credit-Trading-Platform-Market-to-Reach-a-Valuation-of-USD-815-0-Million-by-2034-Future-Market-Insights-Inc.html"
    },
    {
        "Date":"2024-09-05T13:29:00Z",
        "Title":"Kuehn Law Encourages Investors of Relmada Therapeutics, Inc. to Contact Law Firm",
        "Description":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Kuehn Law, PLLC, a shareholder litigation law firm, is investigating whether certain officers and directors of Relmada Therapeutics, Inc. (NASDAQ: RLMD)\r\n breached their fiduciary duties to shareholders. The invest…",
        "Content":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Kuehn Law, PLLC, a shareholder litigation law firm, is investigating whether certain officers and directors of Relmada Therapeutics, Inc. (NASDAQ: RLMD)\r\n… [+1007 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941458\/0\/en\/Kuehn-Law-Encourages-Investors-of-Relmada-Therapeutics-Inc-to-Contact-Law-Firm.html"
    },
    {
        "Date":"2024-09-05T13:27:54Z",
        "Title":"Forget Nvidia: Buy This Magnificent Artificial Intelligence (AI) Stock Instead",
        "Description":"Nvidia has captured the vast majority of artificial intelligence (AI) investment dollars. This has shown up in its pricey valuation, and I think it's time for investors to look elsewhere for AI investments.\nMeta Platforms (NASDAQ: META) is one of the top AI i…",
        "Content":"Nvidia has captured the vast majority of artificial intelligence (AI) investment dollars. This has shown up in its pricey valuation, and I think it's time for investors to look elsewhere for AI inves… [+126 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/ddd439f7198cc2de"
    },
    {
        "Date":"2024-09-05T13:26:00Z",
        "Title":"FYBR Alert: Monsey Firm of Wohl & Fruchter Investigating Fairness of the Proposed Sale of Frontier Communications to Verizon",
        "Description":"We are investigating the fairness of the proposed sale of Frontier Communications to Verizon for $38.50 per share in cash.......",
        "Content":"MONSEY, N.Y., Sept. 05, 2024 (GLOBE NEWSWIRE) -- The law firm of Wohl &amp; Fruchter LLP is investigating the fairness of the proposed sale of Frontier Communications Parent, Inc. (Nasdaq: FYBR) (Fro… [+1685 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941457\/0\/en\/FYBR-Alert-Monsey-Firm-of-Wohl-Fruchter-Investigating-Fairness-of-the-Proposed-Sale-of-Frontier-Communications-to-Verizon.html"
    },
    {
        "Date":"2024-09-05T13:24:59Z",
        "Title":"Legacy Capital Wealth Partners LLC Buys Shares of 3,380 The Trade Desk, Inc. (NASDAQ:TTD)",
        "Description":"Legacy Capital Wealth Partners LLC acquired a new position in The Trade Desk, Inc. (NASDAQ:TTD – Free Report) during the second quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The fund acquired 3,38…",
        "Content":"Legacy Capital Wealth Partners LLC acquired a new position in The Trade Desk, Inc. (NASDAQ:TTD – Free Report) during the second quarter, according to the company in its most recent disclosure with th… [+6016 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/legacy-capital-wealth-partners-llc-buys-shares-of-3380-the-trade-desk-inc-nasdaqttd\/"
    },
    {
        "Date":"2024-09-05T13:24:05Z",
        "Title":"First Connect and Root Launch Streamlined Quote & Bind Process for Independent Insurance Agents",
        "Description":"First Connect and Root Launch Streamlined Quote & Bind Process for Independent Insurance Agents",
        "Content":"PALO ALTO, Calif.\r\n, Sept. 5, 2024\r\n \/PRNewswire\/ --  First Connect Insurance Services\r\n, a digital platform designed to support independent agents by providing access to the nation's top carriers, t… [+4768 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/first-connect-and-root-launch-streamlined-quote--bind-process-for-independent-insurance-agents-93CH-3603140"
    },
    {
        "Date":"2024-09-05T13:24:04Z",
        "Title":"Huron to Present at the Sidoti Small-Cap Virtual Investor Conference on September 18",
        "Description":"Huron to Present at the Sidoti Small-Cap Virtual Investor Conference on September 18",
        "Content":"CHICAGO--(BUSINESS WIRE)--Global professional services firm Huron (NASDAQ: HURN) today announced that John Kelly, executive vice president and chief financial officer, will present to investors and f… [+1252 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/huron-to-present-at-the-sidoti-smallcap-virtual-investor-conference-on-september-18-93CH-3603139"
    },
    {
        "Date":"2024-09-05T13:23:04Z",
        "Title":"Gold Rallies, Yen Surges, Treasury Yields Fall As Disappointing Payrolls Data Supports Large Rate-Cut Bets",
        "Description":"Lower-than-expected private employment growth in August triggered positive reactions Thursday in interest rate-sensitive assets like gold and the Japanese...",
        "Content":"Gold Rallies, Yen Surges, Treasury Yields Fall As Disappointing Payrolls Data Supports Large Rate-Cut Bets\r\nLower-than-expected private employment growth in August triggered positive reactions Thursd… [+3001 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/gold-rallies-yen-surges-treasury-132304604.html"
    },
    {
        "Date":"2024-09-05T13:21:11Z",
        "Title":"Freight Technologies reports revenue growth and TMS launch",
        "Description":"Freight Technologies reports revenue growth and TMS launch",
        "Content":"HOUSTON - Freight Technologies, Inc. (NASDAQ:FRGT), known as Fr8Tech, has reported a revenue increase of 6.6% in the first half of 2024, totaling approximately $8.1 million. The company, which specia… [+5409 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/company-news\/freight-technologies-reports-revenue-growth-and-tms-launch-93CH-3603133"
    },
    {
        "Date":"2024-09-05T13:21:00Z",
        "Title":"SMCI INVESTOR ALERT: Robbins Geller Rudman & Dowd LLP Announces that Super Micro Computer, Inc. Investors with Substantial Losses Have Opportunity to Lead Class Action Lawsuit",
        "Description":"SAN DIEGO, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Robbins Geller Rudman & Dowd LLP announces that the Super Micro class action lawsuit – captioned Averza v. Super Micro Computer, Inc., No. 24-cv-06147 (N.D. Cal.) – charges Super Micro Computer, Inc. (NASDAQ: SMCI…",
        "Content":"SAN DIEGO, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Robbins Geller Rudman &amp; Dowd LLP announces that the Super Micro class action lawsuit captioned Averza v. Super Micro Computer, Inc., No. 24-cv-06147 … [+4309 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941453\/0\/en\/SMCI-INVESTOR-ALERT-Robbins-Geller-Rudman-Dowd-LLP-Announces-that-Super-Micro-Computer-Inc-Investors-with-Substantial-Losses-Have-Opportunity-to-Lead-Class-Action-Lawsuit.html"
    },
    {
        "Date":"2024-09-05T13:19:07Z",
        "Title":"Mullen Subsidiary, Bollinger Motors, Agrees to Partnership with Texas Consulting & Development",
        "Description":"Partnership establishes all-electric Bollinger B4 truck as part of new TCD client solution BREA, Calif., Sept. 05, 2024 (GLOBE NEWSWIRE) — via IBN — Mullen Automotive, Inc. (NASDAQ: MULN) (“Mullen” or the “Company”), an electric vehicle (“EV”) manufacturer, a…",
        "Content":"Author of the article:\r\nArticle content\r\nPartnership establishes all-electric Bollinger B4 truck as part of new TCD client solution\r\nBREA, Calif., Sept. 05, 2024 (GLOBE NEWSWIRE) via IBN Mullen Autom… [+12050 chars]",
        "Source":"Financial Post",
        "URL":"https:\/\/financialpost.com\/globe-newswire\/mullen-subsidiary-bollinger-motors-agrees-to-partnership-with-texas-consulting-development"
    },
    {
        "Date":"2024-09-05T13:15:00Z",
        "Title":"Freight Technologies Reports Strong Preliminary 2024 Mid-Year Results and Announces Exciting Advances in its Product Offerings",
        "Description":"Revenue Growth, Enhanced Profit Margins, and Strategic Software Innovations Highlight Mid-Year Performance Revenue Growth, Enhanced Profit Margins, and Strategic Software Innovations Highlight Mid-Year Performance",
        "Content":"HOUSTON, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Freight Technologies, Inc. (Nasdaq: FRGT, Fr8Tech or the Company), a logistics management innovation company, offering a diverse portfolio of technology-dr… [+8205 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941446\/0\/en\/Freight-Technologies-Reports-Strong-Preliminary-2024-Mid-Year-Results-and-Announces-Exciting-Advances-in-its-Product-Offerings.html"
    },
    {
        "Date":"2024-09-05T13:15:00Z",
        "Title":"Mullen Subsidiary, Bollinger Motors, Agrees to Partnership with Texas Consulting & Development",
        "Description":"Partnership establishes all-electric Bollinger B4 truck as part of new TCD client solution Partnership establishes all-electric Bollinger B4 truck as part of new TCD client solution",
        "Content":"BREA, Calif., Sept. 05, 2024 (GLOBE NEWSWIRE) -- via IBN -- Mullen Automotive, Inc\r\n. (NASDAQ: MULN\r\n) (Mullen or the Company), an electric vehicle (EV) manufacturer, announces today that its subsidi… [+9381 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941445\/0\/en\/Mullen-Subsidiary-Bollinger-Motors-Agrees-to-Partnership-with-Texas-Consulting-Development.html"
    },
    {
        "Date":"2024-09-05T13:13:21Z",
        "Title":"Weyco Group VP sells over $41k in company stock",
        "Description":"Weyco Group VP sells over $41k in company stock",
        "Content":"Weyco Group Inc. (NASDAQ:WEYS), a leading distributor in wholesale apparel, has reported a recent sale of shares by VP and President of BOGS &amp; RAFTERS, Dustin Combs. The executive sold a total of… [+4324 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/company-news\/weyco-group-vp-sells-over-41k-in-company-stock-93CH-3603105"
    },
    {
        "Date":"2024-09-05T13:13:03Z",
        "Title":"Applied Digital stock soars 50% after raising $160m from Nvidia, other investors - WSJ",
        "Description":"Applied Digital stock soars 50% after raising $160m from Nvidia, other investors - WSJ",
        "Content":"Data center operator Applied Digital (APLD) raised $160 million in a funding round, the Wall Street Journal reported Thursday. The companys CEO Wes Cummins revealed that Nvidia (NASDAQ:NVDA) and real… [+1701 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/stock-market-news\/applied-digital-stock-soars-50-after-raising-160m-from-nvidia-other-investors--wsj-432SI-3603100"
    },
    {
        "Date":"2024-09-05T13:11:56Z",
        "Title":"iLearningEngines director Matthew Barger resigns",
        "Description":"iLearningEngines director Matthew Barger resigns",
        "Content":"Software company iLearningEngines, Inc., trading on the Nasdaq Capital Market under the symbols NASDAQ:AILE for its common stock and NASDAQ:AILEW for its warrants, announced the resignation of board … [+4040 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/company-news\/ilearningengines-director-matthew-barger-resigns-93CH-3603101"
    },
    {
        "Date":"2024-09-05T13:10:00Z",
        "Title":"STEALTHGAS INC. Reports Second Quarter and Six Months 2024 Financial and Operating Results",
        "Description":"ATHENS, Greece, Sept. 05, 2024 (GLOBE NEWSWIRE) -- STEALTHGAS INC. (NASDAQ: GASS), a ship-owning company serving the liquefied petroleum gas (LPG) sector of the international shipping industry, announced today its unaudited financial and operating results for…",
        "Content":"ATHENS, Greece, Sept. 05, 2024 (GLOBE NEWSWIRE) -- STEALTHGAS INC. (NASDAQ: GASS), a ship-owning company serving the liquefied petroleum gas (LPG) sector of the international shipping industry, annou… [+44172 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941440\/9952\/en\/STEALTHGAS-INC-Reports-Second-Quarter-and-Six-Months-2024-Financial-and-Operating-Results.html"
    },
    {
        "Date":"2024-09-05T13:10:00Z",
        "Title":"Actuate to Present at the H.C. Wainwright 26th Annual Global Investment Conference",
        "Description":"CHICAGO and FORT WORTH, Texas, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Actuate Therapeutics, Inc. (NASDAQ: ACTU) (“Actuate” or the “Company”), a clinical-stage biopharmaceutical company, focused on developing therapies for the treatment of high-impact, difficult-t…",
        "Content":"CHICAGO and FORT WORTH, Texas, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Actuate Therapeutics, Inc. (NASDAQ: ACTU) (Actuate or the Company), a clinical-stage biopharmaceutical company, focused on developing… [+1534 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941441\/0\/en\/Actuate-to-Present-at-the-H-C-Wainwright-26th-Annual-Global-Investment-Conference.html"
    },
    {
        "Date":"2024-09-05T13:05:29Z",
        "Title":"Treasury Yields Wobble as Jobless Claims Counter ADP Report",
        "Description":"LIVE UPDATES\nStock Market News: Dow Set to Open Down\nS&P 500 and Nasdaq futures are falling in premarket trading Thursday.\nLast Updated:\nSep. 5, 2024 at 8:56 AM EDT\n8 min ago\nTreasury Yields Wobble as Jobless Claims Counter ADP Report\nMixed U.S. labor data se…",
        "Content":"LIVE UPDATESStock Market News: Dow Set to Open DownS&amp;P 500 and Nasdaq futures are falling in premarket trading Thursday.Last Updated:Sep. 5, 2024 at 8:56 AM EDT8 min agoTreasury Yields Wobble as … [+135 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/4ce3c4d562bbe38e"
    },
    {
        "Date":"2024-09-05T13:05:14Z",
        "Title":"Is UnitedHealth Stock Outperforming the Nasdaq?",
        "Description":"Less than $10\/month! Get more Watchlists, Portfolios, Custom Views and Chart Templates with Barchart Plus.\nFREE 30 Day Trial\n- Market Pulse\n-\n- Options Market Overview\n- Unusual Options Activity\n- IV Rank and IV Percentile\n- Most Active Options\n- Unusual Opti…",
        "Content":"Less than $10\/month! Get more Watchlists, Portfolios, Custom Views and Chart Templates with Barchart Plus.FREE 30 Day Trial- Market Pulse-- Options Market Overview- Unusual Options Activity- IV Rank … [+128 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/743d52c8be0b2c77"
    },
    {
        "Date":"2024-09-05T13:05:00Z",
        "Title":"Rivian to participate in Morgan Stanley’s 12th Annual Laguna Conference",
        "Description":"IRVINE, Calif., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Rivian Automotive, Inc. (NASDAQ: RIVN) today announced that on Wednesday September 11, 2024, at 10:30 AM PT, Rivian founder and CEO RJ Scaringe will participate in a fireside chat at Morgan Stanley’s 12th Ann…",
        "Content":"IRVINE, Calif., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Rivian Automotive, Inc. (NASDAQ: RIVN) today announced that on Wednesday September 11, 2024, at 10:30 AM PT, Rivian founder and CEO RJ Scaringe will… [+1069 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941435\/0\/en\/Rivian-to-participate-in-Morgan-Stanley-s-12th-Annual-Laguna-Conference.html"
    },
    {
        "Date":"2024-09-05T13:01:00Z",
        "Title":"AUGA group, AB presentation of financial results for the 6 months of 2024",
        "Description":"AUGA group, AB (hereinafter, the “Company”) presented the Company‘s unaudited financial results for the 6 months of 2024 in an online webinar for investors on September 4 of 2024. The presentation (see attachment) covers detailed information on the results of…",
        "Content":"AUGA group, AB (hereinafter, the Company) presented the Companys unaudited financial results for the 6 months of 2024 in an online webinar for investors on September 4 of 2024. The presentation (see … [+433 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941433\/0\/en\/AUGA-group-AB-presentation-of-financial-results-for-the-6-months-of-2024.html"
    },
    {
        "Date":"2024-09-05T13:00:00Z",
        "Title":"lululemon athletica inc. Investors: Please contact the Portnoy Law Firm to recover your losses. October 7, 2024 Deadline to file Lead Plaintiff Motion.",
        "Description":"Investors can contact the law firm at no cost to learn more about recovering their losses  LOS ANGELES, Sept.  05, 2024  (GLOBE NEWSWIRE) -- The...",
        "Content":"Investors can contact the law firm at no cost to learn more about recovering their losses\r\nLOS ANGELES, Sept. 05, 2024 (GLOBE NEWSWIRE) -- The Portnoy Law Firm advises lululemon athletica inc. (\"lulu… [+1646 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941384\/0\/en\/lululemon-athletica-inc-Investors-Please-contact-the-Portnoy-Law-Firm-to-recover-your-losses-October-7-2024-Deadline-to-file-Lead-Plaintiff-Motion.html"
    },
    {
        "Date":"2024-09-05T13:00:00Z",
        "Title":"Qualigen Therapeutics, Inc. Announces Pricing of $3.46 Million Public Offering",
        "Description":"CARLSBAD, Calif., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Qualigen Therapeutics, Inc. (NASDAQ: QLGN) (the “Company”) today announced the pricing of a public offering of 14,724,058 shares of common stock, par value $0.001 per share (each a “Share,” and collectively…",
        "Content":"CARLSBAD, Calif., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Qualigen Therapeutics, Inc. (NASDAQ: QLGN) (the Company) today announced the pricing of a public offering of 14,724,058 shares of common stock, pa… [+5178 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941388\/0\/en\/Qualigen-Therapeutics-Inc-Announces-Pricing-of-3-46-Million-Public-Offering.html"
    },
    {
        "Date":"2024-09-05T13:00:00Z",
        "Title":"XPEL Inc. Investors: Please contact the Portnoy Law Firm to recover your losses. October 7, 2024 Deadline to file Lead Plaintiff Motion.",
        "Description":"Investors can contact the law firm at no cost to learn more about recovering their losses  LOS ANGELES, Sept.  05, 2024  (GLOBE NEWSWIRE) -- The...",
        "Content":"Investors can contact the law firm at no cost to learn more about recovering their losses\r\nLOS ANGELES, Sept. 05, 2024 (GLOBE NEWSWIRE) -- The Portnoy Law Firm advises XPEL Inc. (\"XPEL\" or the \"Compa… [+1512 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941386\/0\/en\/XPEL-Inc-Investors-Please-contact-the-Portnoy-Law-Firm-to-recover-your-losses-October-7-2024-Deadline-to-file-Lead-Plaintiff-Motion.html"
    },
    {
        "Date":"2024-09-05T12:54:27Z",
        "Title":"Jobless Claims Decline More Than Expected",
        "Description":"LIVE UPDATES\nStock Market News: Dow Set to Open Down\nS&P 500 and Nasdaq futures are falling in premarket trading Thursday.\nLast Updated:\nSep. 5, 2024 at 8:53 AM EDT\n5 min ago\nJobless Claims Decline More Than Expected\nInitial jobless claims for the week ending…",
        "Content":"LIVE UPDATESStock Market News: Dow Set to Open DownS&amp;P 500 and Nasdaq futures are falling in premarket trading Thursday.Last Updated:Sep. 5, 2024 at 8:53 AM EDT5 min agoJobless Claims Decline Mor… [+129 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/92732793503e141e"
    },
    {
        "Date":"2024-09-05T12:54:09Z",
        "Title":"Is The Cigna Group Stock Outperforming the Nasdaq?",
        "Description":"Market Pulse\n-\n- Options Market Overview\n- Unusual Options Activity\n- IV Rank and IV Percentile\n- Most Active Options\n- Unusual Options Volume\n- Highest Implied Volatility\n- %Change in Volatility\n- Options Volume Leaders\n- Change in Open Interest\n- %Chg in Op…",
        "Content":"Market Pulse-- Options Market Overview- Unusual Options Activity- IV Rank and IV Percentile- Most Active Options- Unusual Options Volume- Highest Implied Volatility- %Change in Volatility- Options Vo… [+119 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/057152ebf6c61249"
    },
    {
        "Date":"2024-09-05T12:48:00Z",
        "Title":"SEALSQ Demonstrates Enhanced IoT Security with ESP32 and VaultIC292 Secure Element for Matter Commissioning Process",
        "Description":"Geneva, Switzerland, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Video demonstration is available at https:\/\/www.youtube.com\/watch?v=M45YD4WMfeE&feature=youtu.be",
        "Content":"Geneva, Switzerland, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Video demonstration is available at https:\/\/www.youtube.com\/watch?v=M45YD4WMfeE&amp;feature=youtu.be\r\nGeneva, Switzerland September 5, 2024: SE… [+5536 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941378\/0\/en\/SEALSQ-Demonstrates-Enhanced-IoT-Security-with-ESP32-and-VaultIC292-Secure-Element-for-Matter-Commissioning-Process.html"
    },
    {
        "Date":"2024-09-05T12:45:00Z",
        "Title":"GRI Bio to Present at the H.C. Wainwright 26th Annual Global Investment Conference",
        "Description":"LA JOLLA, CA, Sept. 05, 2024 (GLOBE NEWSWIRE) -- GRI Bio, Inc. (NASDAQ: GRI) (“GRI Bio” or the “Company”), a biotechnology company advancing an innovative pipeline of Natural Killer T (NKT) cell modulators for the treatment of inflammatory, fibrotic and autoi…",
        "Content":"LA JOLLA, CA, Sept. 05, 2024 (GLOBE NEWSWIRE) -- GRI Bio, Inc. (NASDAQ: GRI) (GRI Bio or the Company), a biotechnology company advancing an innovative pipeline of Natural Killer T (NKT) cell modulato… [+2110 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941377\/0\/en\/GRI-Bio-to-Present-at-the-H-C-Wainwright-26th-Annual-Global-Investment-Conference.html"
    },
    {
        "Date":"2024-09-05T12:45:00Z",
        "Title":"Global Military Drone Industry Seeing Rapid Technological Advancements as Market Growth Accelerates",
        "Description":"PALM BEACH, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- FN Media Group News Commentary - The global military drone market industry is witnessing rapid technological advancements, with significant improvements in drone capabilities such as endurance, payload capa…",
        "Content":"PALM BEACH, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- FN Media GroupNews Commentary - The global military drone market industry is witnessing rapid technological advancements, with significant improve… [+12149 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941376\/0\/en\/Global-Military-Drone-Industry-Seeing-Rapid-Technological-Advancements-as-Market-Growth-Accelerates.html"
    },
    {
        "Date":"2024-09-05T12:43:24Z",
        "Title":"POET to Demonstrate Leading-Edge Optical Engines for AI Market at CIOE 2024",
        "Description":"TORONTO and SHENZHEN, China, Sept. 05, 2024 (GLOBE NEWSWIRE) — POET Technologies Inc. (“POET” or the “Company”) (TSX Venture: PTK; NASDAQ: POET), the designer and developer of the POET Optical Interposer™, Photonic Integrated Circuits (PICs) and light sources…",
        "Content":"Author of the article:\r\nArticle content\r\nTORONTO and SHENZHEN, China, Sept. 05, 2024 (GLOBE NEWSWIRE) POET Technologies Inc. (POET or the Company) (TSX Venture: PTK; NASDAQ: POET), the designer and d… [+9478 chars]",
        "Source":"Financial Post",
        "URL":"https:\/\/financialpost.com\/globe-newswire\/poet-to-demonstrate-leading-edge-optical-engines-for-ai-market-at-cioe-2024"
    },
    {
        "Date":"2024-09-05T12:43:14Z",
        "Title":"Why Europe needs its own Nasdaq",
        "Description":"The EU has to tackle the drain of valuable tech companies to US capital markets",
        "Content":"The EU has to tackle the drain of valuable tech companies to US capital markets\r\nThis story appeared on ft.com, 2024-09-05.",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/4ed108e734f967f3"
    },
    {
        "Date":"2024-09-05T12:42:00Z",
        "Title":"POET to Demonstrate Leading-Edge Optical Engines for AI Market at CIOE 2024",
        "Description":"TORONTO and SHENZHEN, China, Sept. 05, 2024 (GLOBE NEWSWIRE) -- POET Technologies Inc. (“POET” or the “Company”) (TSX Venture: PTK; NASDAQ: POET), the designer and developer of the POET Optical Interposer™, Photonic Integrated Circuits (PICs) and light source…",
        "Content":"TORONTO and SHENZHEN, China, Sept. 05, 2024 (GLOBE NEWSWIRE) -- POET Technologies Inc. (POET or the Company) (TSX Venture: PTK; NASDAQ: POET), the designer and developer of the POET Optical Interpose… [+6935 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941374\/0\/en\/POET-to-Demonstrate-Leading-Edge-Optical-Engines-for-AI-Market-at-CIOE-2024.html"
    },
    {
        "Date":"2024-09-05T12:41:57Z",
        "Title":"Stock market today: Nasdaq, S&P 500 futures slide amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stock futures turned lower on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the health of the US … [+1579 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-nasdaq-sp-500-futures-slide-amid-more-soft-jobs-market-data-124157907.html"
    },
    {
        "Date":"2024-09-05T12:32:52Z",
        "Title":"Founders Financial Securities LLC Has $676,000 Holdings in First Trust Capital Strength ETF (NASDAQ:FTCS)",
        "Description":"Founders Financial Securities LLC boosted its position in shares of First Trust Capital Strength ETF (NASDAQ:FTCS – Free Report) by 114.1% during the second quarter, according to its most recent disclosure with the Securities & Exchange Commission. The instit…",
        "Content":"Founders Financial Securities LLC boosted its position in shares of First Trust Capital Strength ETF (NASDAQ:FTCS – Free Report) by 114.1% during the second quarter, according to its most recent disc… [+3020 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/founders-financial-securities-llc-has-676000-holdings-in-first-trust-capital-strength-etf-nasdaqftcs\/"
    },
    {
        "Date":"2024-09-05T12:32:39Z",
        "Title":"The Best Stocks to Invest $50,000 in Right Now",
        "Description":"The tech-driven Nasdaq Composite index is up 14% year-to-date. While that growth is positive, the index is underperforming compared to the first eight months of last year, when it rose 34%. Geopolitical concerns, economic uncertainty, and cooling enthusiasm o…",
        "Content":"The tech-driven Nasdaq Composite index is up 14% year-to-date. While that growth is positive, the index is underperforming compared to the first eight months of last year, when it rose 34%. Geopoliti… [+127 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/f411a177ca8fa41e"
    },
    {
        "Date":"2024-09-05T12:32:00Z",
        "Title":"Paramount+ Announces September 24 Premiere Date for \"We Will Dance Again,\" Documentary Feature About the October 7th Terror Attack at the Nova Music Festival",
        "Description":"The See It Now Studios Original Documentary won two awards at Doc Edge in June, including Best International Editing and the In Truth We Trust category award.",
        "Content":"PARAMOUNT+ ANNOUNCES SEPTEMBER 24 PREMIERE DATE FOR \"WE WILL DANCE AGAIN,\" DOCUMENTARY FEATURE ABOUT THE OCTOBER 7TH TERROR ATTACK AT THE NOVA MUSIC FESTIVAL\r\nThe See It Now Studios Film Features Int… [+4653 chars]",
        "Source":"Thefutoncritic.com",
        "URL":"http:\/\/www.thefutoncritic.com\/news\/2024\/09\/05\/paramountplus-announces-september-24-premiere-date-for-we-will-dance-again-documentary-feature-about-the-october-7th-terror-attack-at-the-nova-music-festival-80213\/20240905cbs03\/"
    },
    {
        "Date":"2024-09-05T12:30:00Z",
        "Title":"Rezolve AI and SPH AG Partner to Revolutionize Retail with Cutting-Edge AI Solutions",
        "Description":"Strategic Alliance Set to Transform Fashion, Sports, Lifestyle, and Retail Industries Through AI-Driven Innovation Strategic Alliance Set to Transform Fashion, Sports, Lifestyle, and Retail Industries Through AI-Driven Innovation",
        "Content":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Rezolve AI (Nasdaq: RZLV), a global leader in artificial intelligence solutions, proudly announces a partnership with SPH AG, a leading IT and consulting … [+4312 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941351\/0\/en\/Rezolve-AI-and-SPH-AG-Partner-to-Revolutionize-Retail-with-Cutting-Edge-AI-Solutions.html"
    },
    {
        "Date":"2024-09-05T12:30:00Z",
        "Title":"Bridgeline Partners with Product Genius Technology for Patented Search Functionality for the Fastener Industry",
        "Description":"WOBURN, Mass., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Bridgeline Digital, Inc. (NASDAQ: BLIN), a global leader in AI-powered marketing technology, announces its partnership with Product Genius Technology, a leading provider of innovative solutions in the fastener…",
        "Content":"WOBURN, Mass., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Bridgeline Digital, Inc. (NASDAQ: BLIN), a global leader in AI-powered marketing technology, announces its partnership with Product Genius Technology… [+2586 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941346\/9238\/en\/Bridgeline-Partners-with-Product-Genius-Technology-for-Patented-Search-Functionality-for-the-Fastener-Industry.html"
    },
    {
        "Date":"2024-09-05T12:30:00Z",
        "Title":"Femasys to Exhibit at The Canadian Fertility and Andrology Society’s 70th Annual Meeting",
        "Description":"ATLANTA, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Femasys, Inc., (Nasdaq: FEMY), a leading biomedical company focused on addressing significant unmet needs of women worldwide with a broad portfolio of in-office, accessible, and innovative therapeutic and diagnostic…",
        "Content":"ATLANTA, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Femasys, Inc., (Nasdaq: FEMY), a leading biomedical company focused on addressing significant unmet needs of women worldwide with a broad portfolio of in-o… [+5541 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941349\/0\/en\/Femasys-to-Exhibit-at-The-Canadian-Fertility-and-Andrology-Society-s-70th-Annual-Meeting.html"
    },
    {
        "Date":"2024-09-05T12:30:00Z",
        "Title":"Lantheus Appoints Julie Eastland as New Board Member",
        "Description":"BEDFORD, Mass., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Lantheus Holdings, Inc. (“Lantheus”) (NASDAQ: LNTH), the leading radiopharmaceutical-focused company committed to enabling clinicians to Find, Fight and Follow disease to deliver better patient outcomes, toda…",
        "Content":"BEDFORD, Mass., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Lantheus Holdings, Inc. (Lantheus) (NASDAQ: LNTH), the leading radiopharmaceutical-focused company committed to enabling clinicians to Find, Fight a… [+5080 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941356\/0\/en\/Lantheus-Appoints-Julie-Eastland-as-New-Board-Member.html"
    },
    {
        "Date":"2024-09-05T12:30:00Z",
        "Title":"Intelligent Bio Solutions Inc. Announces Progress Toward Completion of Clinical Study Plan Required for FDA 510(k) Submission",
        "Description":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Intelligent Bio Solutions Inc. (Nasdaq: INBS) (\"INBS\" or the \"Company\"), a medical technology company delivering intelligent, rapid, non-invasive testing solutions, today announced its progress toward completion of…",
        "Content":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Intelligent Bio Solutions Inc. (Nasdaq: INBS) (\"INBS\" or the \"Company\"), a medical technology company delivering intelligent, rapid, non-invasive testing … [+4702 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941357\/0\/en\/Intelligent-Bio-Solutions-Inc-Announces-Progress-Toward-Completion-of-Clinical-Study-Plan-Required-for-FDA-510-k-Submission.html"
    },
    {
        "Date":"2024-09-05T12:30:00Z",
        "Title":"Lifeward’s First Annual Step Challenge Donates €5,000 to German Association for People Living with Spinal Cord Injury",
        "Description":"As part of the fundraising “Step Challenge”, ReWalk users in Germany completed 424,844 steps to raise 5,000 Euros for the European Spinal Cord Injury Federation (“ESCIF”) As part of the fundraising “Step Challenge”, ReWalk users in Germany completed 424,844 s…",
        "Content":"MARLBOROUGH, Mass., BERLIN, Germany, and YOKNEAM ILLIT, Israel, Sept. 05, 2024 (GLOBE NEWSWIRE) -- ReWalk Robotics Ltd. (DBA Lifeward) (Nasdaq: LFWD) (Lifeward or the Company), a global market leader… [+5823 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941347\/32993\/en\/Lifeward-s-First-Annual-Step-Challenge-Donates-5-000-to-German-Association-for-People-Living-with-Spinal-Cord-Injury.html"
    },
    {
        "Date":"2024-09-05T12:30:00Z",
        "Title":"CSW Industrials Announces Upsize and Pricing of Public Offering of Common Stock",
        "Description":"DALLAS, Texas, Sept. 05, 2024 (GLOBE NEWSWIRE) -- CSW Industrials, Inc. (Nasdaq: CSWI) today announced the upsize and pricing of its previously announced underwritten registered public offering of its common stock. The size of the offering increased from the …",
        "Content":"DALLAS, Texas, Sept. 05, 2024 (GLOBE NEWSWIRE) -- CSW Industrials, Inc. (Nasdaq: CSWI) today announced the upsize and pricing of its previously announced underwritten registered public offering of it… [+4691 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941372\/37075\/en\/CSW-Industrials-Announces-Upsize-and-Pricing-of-Public-Offering-of-Common-Stock.html"
    },
    {
        "Date":"2024-09-05T12:30:00Z",
        "Title":"Vimeo Appoints Robert Petrocelli as Company’s First Chief Product & Technology Officer",
        "Description":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Vimeo\r\n (NASDAQ: VMEO), the world’s most innovative video experience platform for creators and enterprises, today announced the appointment of technology veteran Robert (“Bob”) Petrocelli as Chief Product & Technol…",
        "Content":"NEW YORK, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Vimeo\r\n (NASDAQ: VMEO), the worlds most innovative video experience platform for creators and enterprises, today announced the appointment of technology v… [+2973 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941353\/0\/en\/Vimeo-Appoints-Robert-Petrocelli-as-Company-s-First-Chief-Product-Technology-Officer.html"
    },
    {
        "Date":"2024-09-05T12:30:00Z",
        "Title":"NewtekOne, Inc. Reconfirms its 2024 Annual EPS Forecast in a Range of $1.85 to $2.05 per Basic and Diluted Common Share",
        "Description":"BOCA RATON, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- NewtekOne, Inc. (NASDAQ: NEWT) announced today that it is reconfirming its 2024 annual earnings per share (“EPS”) forecast in a range of $1.85 to $2.05 per basic and diluted common share.",
        "Content":"BOCA RATON, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- NewtekOne, Inc. (NASDAQ: NEWT) announced today that it is reconfirming its 2024 annual earnings per share (EPS) forecast in a range of $1.85 to $2… [+3527 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941359\/0\/en\/NewtekOne-Inc-Reconfirms-its-2024-Annual-EPS-Forecast-in-a-Range-of-1-85-to-2-05-per-Basic-and-Diluted-Common-Share.html"
    },
    {
        "Date":"2024-09-05T12:27:00Z",
        "Title":"5 things to know before the stock market opens Thursday",
        "Description":"Here are the most important news items that investors need to start their trading day.",
        "Content":"Here are the most important news items that investors need to start their trading day:\r\n1. Another day down\r\nThe S&amp;P 500 and Nasdaq Composite moved lower for the second trading session in a row, … [+4135 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/5-things-to-know-before-the-stock-market-opens-thursday-september-5.html"
    },
    {
        "Date":"2024-09-05T12:26:56Z",
        "Title":"Founders Financial Securities LLC Sells 5,428 Shares of Intel Co. (NASDAQ:INTC)",
        "Description":"Founders Financial Securities LLC trimmed its position in Intel Co. (NASDAQ:INTC – Free Report) by 15.3% during the 2nd quarter, according to the company in its most recent Form 13F filing with the Securities & Exchange Commission. The firm owned 29,953 share…",
        "Content":"Founders Financial Securities LLC trimmed its position in Intel Co. (NASDAQ:INTC – Free Report) by 15.3% during the 2nd quarter, according to the company in its most recent Form 13F filing with the S… [+6001 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/founders-financial-securities-llc-sells-5428-shares-of-intel-co-nasdaqintc\/"
    },
    {
        "Date":"2024-09-05T12:26:55Z",
        "Title":"Founders Financial Securities LLC Acquires 205 Shares of Intuitive Surgical, Inc. (NASDAQ:ISRG)",
        "Description":"Founders Financial Securities LLC boosted its holdings in Intuitive Surgical, Inc. (NASDAQ:ISRG – Free Report) by 10.6% in the 2nd quarter, HoldingsChannel.com reports. The firm owned 2,139 shares of the medical equipment provider’s stock after acquiring an a…",
        "Content":"Founders Financial Securities LLC boosted its holdings in Intuitive Surgical, Inc. (NASDAQ:ISRG – Free Report) by 10.6% in the 2nd quarter, HoldingsChannel.com reports. The firm owned 2,139 shares of… [+6268 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/founders-financial-securities-llc-acquires-205-shares-of-intuitive-surgical-inc-nasdaqisrg\/"
    },
    {
        "Date":"2024-09-05T12:17:07Z",
        "Title":"SINTX Technologies initiates cost-cutting measures",
        "Description":"SINTX Technologies initiates cost-cutting measures",
        "Content":"SALT LAKE CITY - SINTX Technologies, Inc. (NASDAQ: SINT), a company specializing in advanced ceramics, announced today a series of strategic initiatives that have been completed to strengthen its fin… [+4842 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/company-news\/sintx-technologies-initiates-costcutting-measures-93CH-3602924"
    },
    {
        "Date":"2024-09-05T12:16:52Z",
        "Title":"J-Long Group faces Nasdaq non-compliance issue",
        "Description":"J-Long Group faces Nasdaq non-compliance issue",
        "Content":"HONG KONG - J-Long Group Limited (NASDAQ:JL), a Hong Kong-based distributor of garment trims, has been notified by the Nasdaq Stock Market LLC that it currently does not meet the minimum market value… [+3205 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/company-news\/jlong-group-faces-nasdaq-noncompliance-issue-93CH-3602910"
    },
    {
        "Date":"2024-09-05T12:15:00Z",
        "Title":"Genasys Receives ACOUSTICS Order from Alabama-Coushatta Tribe of Texas",
        "Description":"Genasys Protect Coverage Expanding in East Texas Genasys Protect Coverage Expanding in East Texas",
        "Content":"SAN DIEGO, Sept. 05, 2024 (GLOBE NEWSWIRE) --  Genasys Inc. (NASDAQ: GNSS), the global leader in Protective Communications, today announced an order from the Alabama-Coushatta Tribe of Texas for Gena… [+4190 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941337\/24431\/en\/Genasys-Receives-ACOUSTICS-Order-from-Alabama-Coushatta-Tribe-of-Texas.html"
    },
    {
        "Date":"2024-09-05T12:15:00Z",
        "Title":"STRATA Skin Sciences to Participate in the Lake Street Capital Markets 8th Annual Best Ideas Growth Conference",
        "Description":"HORSHAM, Pa., Sept. 05, 2024 (GLOBE NEWSWIRE) -- STRATA Skin Sciences, Inc. (“STRATA” or the “Company”) (NASDAQ: SSKN), a medical technology company dedicated to developing, commercializing, and marketing innovative products for the treatment of dermatologic …",
        "Content":"HORSHAM, Pa., Sept. 05, 2024 (GLOBE NEWSWIRE) -- STRATA Skin Sciences, Inc. (STRATA or the Company) (NASDAQ: SSKN), a medical technology company dedicated to developing, commercializing, and marketin… [+3288 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941338\/23161\/en\/STRATA-Skin-Sciences-to-Participate-in-the-Lake-Street-Capital-Markets-8th-Annual-Best-Ideas-Growth-Conference.html"
    },
    {
        "Date":"2024-09-05T12:15:00Z",
        "Title":"Regency Centers to Present at the BofA Securities 2024 Global Real Estate Conference",
        "Description":"JACKSONVILLE, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Regency Centers Corporation (“Regency Centers” or the “Company”) (Nasdaq: REG) today announced that Mike Mas, Executive Vice President and Chief Financial Officer, is scheduled to make a presentation at t…",
        "Content":"JACKSONVILLE, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- Regency Centers Corporation (Regency Centers or the Company) (Nasdaq: REG) today announced that Mike Mas, Executive Vice President and Chief Fin… [+1144 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941336\/37116\/en\/Regency-Centers-to-Present-at-the-BofA-Securities-2024-Global-Real-Estate-Conference.html"
    },
    {
        "Date":"2024-09-05T12:04:00Z",
        "Title":"Gauzy Ltd. to Attend B. Riley Securities Consumer & TMT Conference",
        "Description":"TEL AVIV, Israel, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Gauzy Ltd. (Nasdaq: GAUZ), a global leader in vision and light control solutions, today announced that its senior management will attend the B. Riley Securities Consumer & TMT Conference on Thursday, Septem…",
        "Content":"TEL AVIV, Israel, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Gauzy Ltd. (Nasdaq: GAUZ), a global leader in vision and light control solutions, today announced that its senior management will attend the B. Ri… [+865 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941326\/0\/en\/Gauzy-Ltd-to-Attend-B-Riley-Securities-Consumer-TMT-Conference.html"
    },
    {
        "Date":"2024-09-05T12:02:52Z",
        "Title":"Versor Investments LP Purchases New Holdings in TPG Inc. (NASDAQ:TPG)",
        "Description":"Versor Investments LP bought a new position in TPG Inc. (NASDAQ:TPG – Free Report) in the second quarter, Holdings Channel reports. The firm bought 10,500 shares of the company’s stock, valued at approximately $435,000. Other large investors have also bought …",
        "Content":"Versor Investments LP bought a new position in TPG Inc. (NASDAQ:TPG – Free Report) in the second quarter, Holdings Channel reports. The firm bought 10,500 shares of the company’s stock, valued at app… [+4918 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/versor-investments-lp-purchases-new-holdings-in-tpg-inc-nasdaqtpg\/"
    },
    {
        "Date":"2024-09-05T12:00:03Z",
        "Title":"Analysts Predict The Start Of Crypto’s First Ever Secular Bear Market",
        "Description":"A new narrative is emerging among seasoned crypto analysts who are now forecasting the advent of the industry’s first ever secular bear market. This prediction suggests a sweeping transformation could be imminent, characterized by a prolonged downturn lasting…",
        "Content":"A new narrative is emerging among seasoned crypto analysts who are now forecasting the advent of the industrys first ever secular bear market. This prediction suggests a sweeping transformation could… [+3996 chars]",
        "Source":"newsBTC",
        "URL":"http:\/\/www.newsbtc.com\/news\/start-of-crypto-first-ever-secular-bear-market\/"
    },
    {
        "Date":"2024-09-05T12:00:00Z",
        "Title":"Predictive Oncology to Present at the H.C. Wainwright 26th Annual Global Investment Conference",
        "Description":"PITTSBURGH, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Predictive Oncology Inc. (NASDAQ: POAI), a leader in AI-driven drug discovery and biologics, is scheduled to deliver a virtual presentation and host investor one-on-one meetings at the H.C. Wainwright 26th Annual…",
        "Content":"PITTSBURGH, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Predictive Oncology Inc. (NASDAQ: POAI), a leader in AI-driven drug discovery and biologics, is scheduled to deliver a virtual presentation and host inv… [+2700 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941269\/37244\/en\/Predictive-Oncology-to-Present-at-the-H-C-Wainwright-26th-Annual-Global-Investment-Conference.html"
    },
    {
        "Date":"2024-09-05T12:00:00Z",
        "Title":"FlexShopper to Present at H.C. Wainwright’s 26th Annual Global Investor Conference",
        "Description":"BOCA RATON, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- FlexShopper, Inc. (Nasdaq: FPAY), a prominent national online lease-to-own retailer and payment solutions provider, today announced that Russ Heiser, CEO, and John Davis, COO are participating at the 26th A…",
        "Content":"BOCA RATON, Fla., Sept. 05, 2024 (GLOBE NEWSWIRE) -- FlexShopper, Inc. (Nasdaq: FPAY), a prominent national online lease-to-own retailer and payment solutions provider, today announced that Russ Heis… [+2119 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941306\/29694\/en\/FlexShopper-to-Present-at-H-C-Wainwright-s-26th-Annual-Global-Investor-Conference.html"
    },
    {
        "Date":"2024-09-05T12:00:00Z",
        "Title":"Lottery.com Completes Acquisition of S&MI Ltd, Rebranding as Sports.com Media Ltd",
        "Description":"Company Expands Global Reach with Strategic Partnerships Company Expands Global Reach with Strategic Partnerships",
        "Content":"LONDON, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Lottery.com Inc. (Nasdaq: LTRY, LTRYW) (Lottery.com or the Company), a leading online lottery services provider, announces the successful completion of its … [+7717 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941322\/0\/en\/Lottery-com-Completes-Acquisition-of-S-MI-Ltd-Rebranding-as-Sports-com-Media-Ltd.html"
    },
    {
        "Date":"2024-09-05T12:00:00Z",
        "Title":"One Stop Systems to Participate at the Lake Street Best Ideas Growth Conference on September 12",
        "Description":"ESCONDIDO, Calif., Sept. 05, 2024 (GLOBE NEWSWIRE) -- One Stop Systems, Inc. (“OSS” or the \"Company\") (Nasdaq: OSS), a leader in rugged Enterprise Class compute for artificial intelligence (AI), machine learning (ML) and sensor processing at the Edge, today a…",
        "Content":"ESCONDIDO, Calif., Sept. 05, 2024 (GLOBE NEWSWIRE) -- One Stop Systems, Inc. (OSS or the \"Company\") (Nasdaq: OSS), a leader in rugged Enterprise Class compute for artificial intelligence (AI), machin… [+4055 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941307\/0\/en\/One-Stop-Systems-to-Participate-at-the-Lake-Street-Best-Ideas-Growth-Conference-on-September-12.html"
    },
    {
        "Date":"2024-09-05T12:00:00Z",
        "Title":"Spectral AI Awarded Additional Funding from Medical Technology Enterprise Consortium to Support Ongoing Development of DeepView SnapShot M®",
        "Description":"Project Funding Exceeds $7.0 Million Project Funding Exceeds $7.0 Million",
        "Content":"DALLAS, Sept. 05, 2024 (GLOBE NEWSWIRE) -- Spectral AI, Inc. (Nasdaq: MDAI) (Spectral AI or the Company), an artificial intelligence (AI) company focused on medical diagnostics for faster and more ac… [+5851 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941321\/0\/en\/Spectral-AI-Awarded-Additional-Funding-from-Medical-Technology-Enterprise-Consortium-to-Support-Ongoing-Development-of-DeepView-SnapShot-M.html"
    },
    {
        "Date":"2024-09-05T12:00:00Z",
        "Title":"SeaStar Medical to Webcast Fireside Chat at the H.C. Wainwright Global Investment Conference",
        "Description":"DENVER, Sept. 05, 2024 (GLOBE NEWSWIRE) -- SeaStar Medical Holding Corporation (Nasdaq: ICU), a commercial-stage medical device company developing proprietary solutions to reduce the consequences of hyperinflammation on vital organs, announces that management…",
        "Content":"DENVER, Sept. 05, 2024 (GLOBE NEWSWIRE) -- SeaStar Medical Holding Corporation (Nasdaq: ICU), a commercial-stage medical device company developing proprietary solutions to reduce the consequences of … [+1389 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/05\/2941270\/0\/en\/SeaStar-Medical-to-Webcast-Fireside-Chat-at-the-H-C-Wainwright-Global-Investment-Conference.html"
    },
    {
        "Date":"2024-09-05T11:56:55Z",
        "Title":"Rigel Announces First Patient Enrolled in Phase 1b\/2 Triplet Therapy Trial of REZLIDHIA ® (olutasidenib) in mIDH1 AML",
        "Description":"Rigel Announces First Patient Enrolled in Phase 1b\/2 Triplet Therapy Trial of REZLIDHIA ® (olutasidenib) in mIDH1 AML",
        "Content":"<ul><li>First trial in Rigel (NASDAQ:RIGL)'s multi-year strategic development alliance with MD Anderson <\/li><li>Phase 1b\/2 trial of decitabine and venetoclax in combination with Rigel's targeted mID… [+13657 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/rigel-announces-first-patient-enrolled-in-phase-1b2-triplet-therapy-trial-of-rezlidhia--olutasidenib-in-midh1-aml-93CH-3602808"
    },
    {
        "Date":"2024-09-05T11:56:41Z",
        "Title":"Jazz Pharmaceuticals to Present New Data Demonstrating Improved Epilepsy Outcomes with Epidiolex ®\/Epidyolex ® (cannabidiol) at the European Epilepsy Congress 2024",
        "Description":"Jazz Pharmaceuticals to Present New Data Demonstrating Improved Epilepsy Outcomes with Epidiolex ®\/Epidyolex ® (cannabidiol) at the European Epilepsy Congress 2024",
        "Content":"Data from eight abstracts to be presented, including results of the BECOME (BEhavior, COgnition and More with Epidyolex ®) Caregiver Survey on the real-world outcomes of Epidyolex ® (cannabidiol) tre… [+9682 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/jazz-pharmaceuticals-to-present-new-data-demonstrating-improved-epilepsy-outcomes-with-epidiolex-epidyolex--cannabidiol-at-the-european-epilepsy-congress-2024-93CH-3602806"
    },
    {
        "Date":"2024-09-05T11:55:11Z",
        "Title":"Baird maintains Neutral tag on Fastenal stock with steady price target",
        "Description":"Baird maintains Neutral tag on Fastenal stock with steady price target",
        "Content":"Baird has reaffirmed its Neutral stance on Fastenal (NASDAQ: FAST), with a steady price target of $67.00. \r\nThe decision came after reviewing the August Fastener Distributor Index (FDI), which presen… [+3667 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/company-news\/baird-maintains-neutral-tag-on-fastenal-stock-with-steady-price-target-93CH-3602793"
    },
    {
        "Date":"2024-09-05T11:53:39Z",
        "Title":"Stocks Pause Days of Losses Ahead of US Jobs Data: Markets Wrap - Yahoo Finance",
        "Description":"Stocks Pause Days of Losses Ahead of US Jobs Data: Markets WrapYahoo Finance Stock futures are flat after two straight down days for S&P 500, Nasdaq: Live updatesCNBC Morning Bid: Stocks calmed as action switches to rates, jobsReuters US Futures Signal Steady…",
        "Content":"Check out the new Slashdot job board to browse remote jobs or jobs in your areaDo you develop on GitHub? You can keep using GitHub but automatically sync your GitHub releases to SourceForge quickly a… [+228 chars]",
        "Source":"Slashdot.org",
        "URL":"https:\/\/slashdot.org\/firehose.pl?op=view&amp;id=174926036"
    },
    {
        "Date":"2024-09-05T14:34:02Z",
        "Title":"Why the Stock Market Is So Jittery This Week",
        "Description":"LIVE UPDATES\nStock Market Mixed as ADP, Jobless Claims Provide Murky Picture\nThe Dow Jones Industrial Average was lower, the S&P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs report.\nLast Updated:\nSep. 5, 2024 at 10:28 AM EDT\n4 min ago\nWh…",
        "Content":"LIVE UPDATESStock Market Mixed as ADP, Jobless Claims Provide Murky PictureThe Dow Jones Industrial Average was lower, the S&amp;P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs r… [+130 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/789f6d3ea3df8017"
    },
    {
        "Date":"2024-09-05T14:28:50Z",
        "Title":"Archer Investment Corp Sells 28 Shares of SPDR Dow Jones Industrial Average ETF Trust (NYSEARCA:DIA)",
        "Description":"Archer Investment Corp decreased its holdings in SPDR Dow Jones Industrial Average ETF Trust (NYSEARCA:DIA – Free Report) by 17.2% in the second quarter, according to its most recent disclosure with the Securities & Exchange Commission. The institutional inve…",
        "Content":"Archer Investment Corp decreased its holdings in SPDR Dow Jones Industrial Average ETF Trust (NYSEARCA:DIA – Free Report) by 17.2% in the second quarter, according to its most recent disclosure with … [+2799 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/archer-investment-corp-sells-28-shares-of-spdr-dow-jones-industrial-average-etf-trust-nysearcadia\/"
    },
    {
        "Date":"2024-09-05T14:28:49Z",
        "Title":"S&P Global Inc. (NYSE:SPGI) Shares Purchased by Founders Financial Securities LLC",
        "Description":"Founders Financial Securities LLC boosted its position in S&P Global Inc. (NYSE:SPGI – Free Report) by 4.1% during the second quarter, Holdings Channel.com reports. The institutional investor owned 1,685 shares of the business services provider’s stock after …",
        "Content":"Founders Financial Securities LLC boosted its position in S&amp;P Global Inc. (NYSE:SPGI – Free Report) by 4.1% during the second quarter, Holdings Channel.com reports. The institutional investor own… [+7184 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/sp-global-inc-nysespgi-shares-purchased-by-founders-financial-securities-llc\/"
    },
    {
        "Date":"2024-09-05T14:11:41Z",
        "Title":"ISM Services Data Provide Some Good News for Stocks",
        "Description":"LIVE UPDATES\nStock Market Mixed as ADP, Jobless Claims Provide Murky Picture\nThe Dow Jones Industrial Average was lower, the S&P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs report.\nLast Updated:\nSep. 5, 2024 at 10:07 AM EDT\n3 min ago\nIS…",
        "Content":"LIVE UPDATESStock Market Mixed as ADP, Jobless Claims Provide Murky PictureThe Dow Jones Industrial Average was lower, the S&amp;P 500 flat, and the Nasdaq Composite higher ahead of the Friday jobs r… [+134 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/f28d44b901ae1644"
    },
    {
        "Date":"2024-09-05T14:11:32Z",
        "Title":"Stock market today: Dow, Nasdaq seesaw amid more soft jobs market data",
        "Description":"Ines Ferré\nIn this article:\nUS stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the health of the US economy.\nThe S&P 500 (^GSPC) rose 0.4%, while…",
        "Content":"Ines FerréIn this article:US stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the heal… [+140 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/b8d2f7c019206bf5"
    },
    {
        "Date":"2024-09-05T14:03:41Z",
        "Title":"US stocks mixed following key labor market data",
        "Description":"US stocks mixed following key labor market data",
        "Content":"Investing.com -- U.S. stock futures traded largely flat Thursday, attempting to stabilize after a rocky start to the month ahead of key employment data for clues for future Federal Reserve monetary p… [+3009 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/stock-market-news\/us-stock-futures-steady-ahead-of-key-labor-market-data-3602279"
    },
    {
        "Date":"2024-09-05T13:52:07Z",
        "Title":"CME Group to Launch Options on Bloomberg Commodity Index Futures on September 23",
        "Description":"CME Group to Launch Options on Bloomberg Commodity Index Futures on September 23",
        "Content":"CHICAGO\r\n, Sept. 5, 2024\r\n \/PRNewswire\/ -- CME Group, the world's leading derivatives marketplace, today announced that it will launch options on Bloomberg Commodity Index (BCOM) futures on September… [+3543 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/cme-group-to-launch-options-on-bloomberg-commodity-index-futures-on-september-23-93CH-3603247"
    },
    {
        "Date":"2024-09-05T13:50:03Z",
        "Title":"Stock market today: Indexes mixed as investors assess labor data ahead of Friday payroll report",
        "Description":"Indexes were mixed on Thursday amid fresh labor data ahead of Friday's August nonfarm payroll report. Private payroll data was weaker than expected last month.",
        "Content":"Indexes wavered on Thursday as investors mulled mixed labor market data ahead of Friday's August jobs report.\r\nThe S&amp;P 500 and the Nasdaq Composite were slightly higher, while the Dow Jones Indus… [+1932 chars]",
        "Source":"Business Insider",
        "URL":"https:\/\/markets.businessinsider.com\/news\/stocks\/stock-market-today-jobless-claims-unemployment-payroll-openings-labor-department-2024-9"
    },
    {
        "Date":"2024-09-05T13:49:38Z",
        "Title":"Stock market today: Dow, Nasdaq seesaw amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the health of the US economy.\r\nThe… [+2674 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-dow-nasdaq-seesaw-amid-more-soft-jobs-market-data-134938592.html"
    },
    {
        "Date":"2024-09-05T13:49:38Z",
        "Title":"Stock market today: Dow falls, Nasdaq rises amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stocks were mixed on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest rate cut hopes and the health of the US economy.\r… [+3996 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-dow-falls-nasdaq-rises-amid-more-soft-jobs-market-data-134938786.html"
    },
    {
        "Date":"2024-09-05T13:49:38Z",
        "Title":"Stock market today: S&P 500, Nasdaq climb amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stocks gained on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest rate cut hopes and the health of the US economy.\r\nThe… [+3340 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-sp-500-nasdaq-climb-amid-more-soft-jobs-market-data-134938220.html"
    },
    {
        "Date":"2024-09-05T13:48:00Z",
        "Title":"Chevron Stock Near 52-Week Lows: Is It Good Enough to Invest?",
        "Description":"CVX remains one of the best-positioned global integrated oil companies to achieve sustainable production growth.",
        "Content":"Shares of Chevron Corporation CVX have dropped by nearly 9% over the past three months to close at $142.07 on Wednesday, near 52-week lows of $139.62. Having underperformed its rival ExxonMobil XOM, … [+6618 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/chevron-stock-near-52-week-134800913.html"
    },
    {
        "Date":"2024-09-05T13:00:09Z",
        "Title":"Intel Arrow Lake to be made elsewhere as 20A process node canned",
        "Description":"Meanwhile, Broadcom reportedly displeased with 18A wafers\nSurprising news about Intel continues to emerge with the chipmaker vowing to use an external foundry in place of its own 20A process to make the upcoming Arrow Lake processors, amid talk that Broadcom …",
        "Content":"Surprising news about Intel continues to emerge with the chipmaker vowing to use an external foundry in place of its own 20A process to make the upcoming Arrow Lake processors, amid talk that Broadco… [+3255 chars]",
        "Source":"Theregister.com",
        "URL":"https:\/\/www.theregister.com\/2024\/09\/05\/intel_arrow_lake\/"
    },
    {
        "Date":"2024-09-05T12:41:57Z",
        "Title":"Stock market today: Nasdaq, S&P 500 futures slide amid more soft jobs market data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stock futures turned lower on Thursday as investors digested more weaker-than-expected labor market data that could help set expectations for both interest-rate cut hopes and the health of the US … [+1579 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-nasdaq-sp-500-futures-slide-amid-more-soft-jobs-market-data-124157907.html"
    },
    {
        "Date":"2024-09-05T12:33:00Z",
        "Title":"Schwab US Dividend Equity ETF (NYSEARCA:SCHD) Shares Bought by Archer Investment Corp",
        "Description":"Archer Investment Corp boosted its stake in Schwab US Dividend Equity ETF (NYSEARCA:SCHD – Free Report) by 21.7% during the 2nd quarter, according to the company in its most recent filing with the Securities and Exchange Commission. The firm owned 723 shares …",
        "Content":"Archer Investment Corp boosted its stake in Schwab US Dividend Equity ETF (NYSEARCA:SCHD – Free Report) by 21.7% during the 2nd quarter, according to the company in its most recent filing with the Se… [+2288 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/schwab-us-dividend-equity-etf-nysearcaschd-shares-bought-by-archer-investment-corp\/"
    },
    {
        "Date":"2024-09-05T12:27:00Z",
        "Title":"5 things to know before the stock market opens Thursday",
        "Description":"Here are the most important news items that investors need to start their trading day.",
        "Content":"Here are the most important news items that investors need to start their trading day:\r\n1. Another day down\r\nThe S&amp;P 500 and Nasdaq Composite moved lower for the second trading session in a row, … [+4135 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/5-things-to-know-before-the-stock-market-opens-thursday-september-5.html"
    },
    {
        "Date":"2024-09-05T12:26:54Z",
        "Title":"iShares Dow Jones U.S. ETF (NYSEARCA:IYY) Stake Lessened by Founders Financial Securities LLC",
        "Description":"Founders Financial Securities LLC lowered its holdings in iShares Dow Jones U.S. ETF (NYSEARCA:IYY – Free Report) by 9.7% in the second quarter, according to its most recent Form 13F filing with the Securities & Exchange Commission. The institutional investor…",
        "Content":"Founders Financial Securities LLC lowered its holdings in iShares Dow Jones U.S. ETF (NYSEARCA:IYY – Free Report) by 9.7% in the second quarter, according to its most recent Form 13F filing with the … [+2601 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/ishares-dow-jones-u-s-etf-nysearcaiyy-stake-lessened-by-founders-financial-securities-llc\/"
    },
    {
        "Date":"2024-09-05T12:20:59Z",
        "Title":"August private payrolls rose by 99,000, smallest gain since 2021 and far below estimates, ADP says",
        "Description":"The total was less than the downwardly revised 111,000 in July and below the Dow Jones consensus forecast for 140,000.",
        "Content":"The total was less than the downwardly revised 111,000 in July and below the Dow Jones consensus forecast for 140,000.\r\nThis story appeared on cnbc.com, 2024-09-05.",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/d7d2bea29d785e7e"
    },
    {
        "Date":"2024-09-05T12:15:13Z",
        "Title":"August private payrolls rose by 99,000, smallest gain since 2021 and far below estimates, ADP says",
        "Description":"The total was less than the downwardly revised 111,000 in July and below the Dow Jones consensus forecast for 140,000.",
        "Content":"Private sector payrolls grew at the weakest pace in more than three-and-a-half years in August, providing yet another sign of a deteriorating labor market, according to ADP.\r\nCompanies hired just 99,… [+2983 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/august-private-payrolls-rose-by-99000-smallest-gain-since-2021-and-far-below-estimates-adp-says.html"
    },
    {
        "Date":"2024-09-05T12:00:03Z",
        "Title":"Analysts Predict The Start Of Crypto’s First Ever Secular Bear Market",
        "Description":"A new narrative is emerging among seasoned crypto analysts who are now forecasting the advent of the industry’s first ever secular bear market. This prediction suggests a sweeping transformation could be imminent, characterized by a prolonged downturn lasting…",
        "Content":"A new narrative is emerging among seasoned crypto analysts who are now forecasting the advent of the industrys first ever secular bear market. This prediction suggests a sweeping transformation could… [+3996 chars]",
        "Source":"newsBTC",
        "URL":"http:\/\/www.newsbtc.com\/news\/start-of-crypto-first-ever-secular-bear-market\/"
    },
    {
        "Date":"2024-09-05T11:53:00Z",
        "Title":"Sensex slips 151 pts, Nifty ends below 25,150 ahead of US data",
        "Description":"Domestic equity benchmarks closed slightly lower on Thursday, with the Nifty50 settling below 25,150 after reaching a high of 25,275.45. Volatility was heightened due to the expiry of weekly index options on the NSE. IT, media, and consumer durables stocks ou…",
        "Content":"Domestic equity benchmarks closed slightly lower on Thursday, with the Nifty50 settling below 25,150 after reaching a high of 25,275.45. Volatility was heightened due to the expiry of weekly index op… [+6133 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/capital-market-news\/sensex-slips-151-pts-nifty-ends-below-25-150-ahead-of-us-data-124090501029_1.html"
    },
    {
        "Date":"2024-09-05T11:12:52Z",
        "Title":"Financial Counselors Inc. Purchases Shares of 4,140 SPDR Portfolio S&P 500 Growth ETF (NYSEARCA:SPYG)",
        "Description":"Financial Counselors Inc. acquired a new position in SPDR Portfolio S&P 500 Growth ETF (NYSEARCA:SPYG – Free Report) in the 2nd quarter, according to its most recent 13F filing with the Securities & Exchange Commission. The firm acquired 4,140 shares of the c…",
        "Content":"Financial Counselors Inc. acquired a new position in SPDR Portfolio S&amp;P 500 Growth ETF (NYSEARCA:SPYG – Free Report) in the 2nd quarter, according to its most recent 13F filing with the Securitie… [+2304 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/financial-counselors-inc-purchases-shares-of-4140-spdr-portfolio-sp-500-growth-etf-nysearcaspyg\/"
    },
    {
        "Date":"2024-09-05T11:12:51Z",
        "Title":"Financial Counselors Inc. Buys Shares of 3,088 SPDR Dow Jones REIT ETF (NYSEARCA:RWR)",
        "Description":"Financial Counselors Inc. purchased a new position in shares of SPDR Dow Jones REIT ETF (NYSEARCA:RWR – Free Report) in the 2nd quarter, according to the company in its most recent 13F filing with the SEC. The firm purchased 3,088 shares of the company’s stoc…",
        "Content":"Financial Counselors Inc. purchased a new position in shares of SPDR Dow Jones REIT ETF (NYSEARCA:RWR – Free Report) in the 2nd quarter, according to the company in its most recent 13F filing with th… [+2075 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/financial-counselors-inc-buys-shares-of-3088-spdr-dow-jones-reit-etf-nysearcarwr\/"
    },
    {
        "Date":"2024-09-05T11:04:52Z",
        "Title":"Schwab US Broad Market ETF (NYSEARCA:SCHB) Shares Bought by Commonwealth Equity Services LLC",
        "Description":"Commonwealth Equity Services LLC boosted its holdings in shares of Schwab US Broad Market ETF (NYSEARCA:SCHB – Free Report) by 1.4% in the 2nd quarter, according to the company in its most recent Form 13F filing with the Securities & Exchange Commission. The …",
        "Content":"Commonwealth Equity Services LLC boosted its holdings in shares of Schwab US Broad Market ETF (NYSEARCA:SCHB – Free Report) by 1.4% in the 2nd quarter, according to the company in its most recent For… [+2387 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/schwab-us-broad-market-etf-nysearcaschb-shares-bought-by-commonwealth-equity-services-llc\/"
    },
    {
        "Date":"2024-09-05T10:59:54Z",
        "Title":"Ritholtz Wealth Management Sells 1,284 Shares of Schwab U.S. Large-Cap Growth ETF (NYSEARCA:SCHG)",
        "Description":"Ritholtz Wealth Management cut its holdings in shares of Schwab U.S. Large-Cap Growth ETF (NYSEARCA:SCHG – Free Report) by 23.7% during the second quarter, Holdings Channel.com reports. The firm owned 4,134 shares of the company’s stock after selling 1,284 sh…",
        "Content":"Ritholtz Wealth Management cut its holdings in shares of Schwab U.S. Large-Cap Growth ETF (NYSEARCA:SCHG – Free Report) by 23.7% during the second quarter, Holdings Channel.com reports. The firm owne… [+2765 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/ritholtz-wealth-management-sells-1284-shares-of-schwab-u-s-large-cap-growth-etf-nysearcaschg\/"
    },
    {
        "Date":"2024-09-05T10:48:51Z",
        "Title":"Stock market today: US futures steady as investors wait for next wave of data",
        "Description":"Labor data is in focus as the prospect of rate cuts fails to offset growing doubts about the health of the economy.",
        "Content":"US stock futures were steady on Thursday as investors awaited fresh data to provide a reality check for both interest-rate cut hopes and growing doubts about the health of the US economy.\r\nFutures on… [+1334 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-us-futures-steady-as-investors-wait-for-next-wave-of-data-104851389.html"
    },
    {
        "Date":"2024-09-05T10:42:58Z",
        "Title":"iShares Select Dividend ETF (NASDAQ:DVY) Shares Purchased by Founders Financial Securities LLC",
        "Description":"Founders Financial Securities LLC raised its position in iShares Select Dividend ETF (NASDAQ:DVY – Free Report) by 73.9% during the 2nd quarter, according to its most recent filing with the Securities and Exchange Commission (SEC). The fund owned 13,466 share…",
        "Content":"Founders Financial Securities LLC raised its position in iShares Select Dividend ETF (NASDAQ:DVY – Free Report) by 73.9% during the 2nd quarter, according to its most recent filing with the Securitie… [+3533 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/ishares-select-dividend-etf-nasdaqdvy-shares-purchased-by-founders-financial-securities-llc\/"
    },
    {
        "Date":"2024-09-05T10:26:55Z",
        "Title":"Van ECK Associates Corp Buys 406 Shares of S&P Global Inc. (NYSE:SPGI)",
        "Description":"Van ECK Associates Corp grew its stake in shares of S&P Global Inc. (NYSE:SPGI – Free Report) by 5.2% during the second quarter, according to the company in its most recent disclosure with the Securities and Exchange Commission. The fund owned 8,229 shares of…",
        "Content":"Van ECK Associates Corp grew its stake in shares of S&amp;P Global Inc. (NYSE:SPGI – Free Report) by 5.2% during the second quarter, according to the company in its most recent disclosure with the Se… [+6743 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/van-eck-associates-corp-buys-406-shares-of-sp-global-inc-nysespgi\/"
    },
    {
        "Date":"2024-09-05T10:22:00Z",
        "Title":"Barometers end with moderate losses; Realty shares decline",
        "Description":"As per provisional closing data, the barometer index, the S&P BSE Sensex, declined 151.48 points or 0.18% to 82,201.16. The Nifty 50 index lost 53.60 points or 0.21% to 25,145.10.",
        "Content":"The key equity benchmarks ended with limited losses on Thursday. The Nifty settled below 25,150 level after hitting the days high of 25,275.45 in early trade. Midsmall healthcare, media and consumer … [+4649 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/capital-market-news\/barometers-end-with-moderate-losses-realty-shares-decline-124090500936_1.html"
    },
    {
        "Date":"2024-09-05T10:18:49Z",
        "Title":"iShares U.S. Utilities ETF (NYSEARCA:IDU) Stock Position Lifted by Commonwealth Equity Services LLC",
        "Description":"Commonwealth Equity Services LLC grew its position in shares of iShares U.S. Utilities ETF (NYSEARCA:IDU – Free Report) by 11.3% during the second quarter, HoldingsChannel reports. The institutional investor owned 124,841 shares of the company’s stock after b…",
        "Content":"Commonwealth Equity Services LLC grew its position in shares of iShares U.S. Utilities ETF (NYSEARCA:IDU – Free Report) by 11.3% during the second quarter, HoldingsChannel reports. The institutional … [+2701 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/ishares-u-s-utilities-etf-nysearcaidu-stock-position-lifted-by-commonwealth-equity-services-llc\/"
    },
    {
        "Date":"2024-09-05T10:08:59Z",
        "Title":"TIAA Trust National Association Grows Stock Holdings in Schwab US Broad Market ETF (NYSEARCA:SCHB)",
        "Description":"TIAA Trust National Association increased its stake in Schwab US Broad Market ETF (NYSEARCA:SCHB – Free Report) by 5.0% during the 2nd quarter, according to its most recent disclosure with the Securities and Exchange Commission. The fund owned 36,345 shares o…",
        "Content":"TIAA Trust National Association increased its stake in Schwab US Broad Market ETF (NYSEARCA:SCHB – Free Report) by 5.0% during the 2nd quarter, according to its most recent disclosure with the Securi… [+2878 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/tiaa-trust-national-association-grows-stock-holdings-in-schwab-us-broad-market-etf-nysearcaschb\/"
    },
    {
        "Date":"2024-09-05T10:08:57Z",
        "Title":"TIAA Trust National Association Boosts Position in Schwab US Large-Cap ETF (NYSEARCA:SCHX)",
        "Description":"TIAA Trust National Association raised its stake in Schwab US Large-Cap ETF (NYSEARCA:SCHX – Free Report) by 10.8% in the 2nd quarter, Holdings Channel.com reports. The institutional investor owned 26,778 shares of the company’s stock after buying an addition…",
        "Content":"TIAA Trust National Association raised its stake in Schwab US Large-Cap ETF (NYSEARCA:SCHX – Free Report) by 10.8% in the 2nd quarter, Holdings Channel.com reports. The institutional investor owned 2… [+2394 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/tiaa-trust-national-association-boosts-position-in-schwab-us-large-cap-etf-nysearcaschx\/"
    },
    {
        "Date":"2024-09-05T10:00:00Z",
        "Title":"The Wall Street Journal Offers Advertisers a Performance Guarantee Timed to the Election",
        "Description":"The financial news publisher The Wall Street Journal is offering advertisers a performance guarantee, timed to the upcoming U.S. presidential election, to dissuade them from pausing their ad campaigns during the period. The guarantee, which is offered in coll…",
        "Content":"The financial news publisher The Wall Street Journal is offering advertisers a performance guarantee, timed to the upcoming U.S. presidential election, to dissuade them from pausing their ad campaign… [+4195 chars]",
        "Source":"Adweek",
        "URL":"https:\/\/www.adweek.com\/media\/wall-street-journal-adelaide-election-guarantee-advertisers\/"
    },
    {
        "Date":"2024-09-05T09:46:49Z",
        "Title":"Financial Counselors Inc. Acquires 46 Shares of SPDR Dow Jones Industrial Average ETF Trust (NYSEARCA:DIA)",
        "Description":"Financial Counselors Inc. raised its holdings in shares of SPDR Dow Jones Industrial Average ETF Trust (NYSEARCA:DIA – Free Report) by 3.8% in the 2nd quarter, according to its most recent 13F filing with the SEC. The fund owned 1,247 shares of the exchange t…",
        "Content":"Financial Counselors Inc. raised its holdings in shares of SPDR Dow Jones Industrial Average ETF Trust (NYSEARCA:DIA – Free Report) by 3.8% in the 2nd quarter, according to its most recent 13F filing… [+2871 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/financial-counselors-inc-acquires-46-shares-of-spdr-dow-jones-industrial-average-etf-trust-nysearcadia\/"
    },
    {
        "Date":"2024-09-05T09:38:49Z",
        "Title":"ProShares Ultra Health Care (NYSEARCA:RXL) Stock Pass Above 50-Day Moving Average of $107.21",
        "Description":"ProShares Ultra Health Care (NYSEARCA:RXL – Get Free Report)’s stock price crossed above its 50 day moving average during trading on Wednesday . The stock has a 50 day moving average of $107.21 and traded as high as $116.64. ProShares Ultra Health Care shares…",
        "Content":"ProShares Ultra Health Care (NYSEARCA:RXL – Get Free Report)’s stock price crossed above its 50 day moving average during trading on Wednesday . The stock has a 50 day moving average of $107.21 and t… [+1695 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/proshares-ultra-health-care-nysearcarxl-stock-pass-above-50-day-moving-average-of-107-21\/"
    },
    {
        "Date":"2024-09-05T09:22:57Z",
        "Title":"Aptus Capital Advisors LLC Lowers Stock Position in SPDR Portfolio S&P 500 Growth ETF (NYSEARCA:SPYG)",
        "Description":"Aptus Capital Advisors LLC lessened its position in shares of SPDR Portfolio S&P 500 Growth ETF (NYSEARCA:SPYG – Free Report) by 54.4% in the 2nd quarter, according to the company in its most recent 13F filing with the Securities & Exchange Commission. The in…",
        "Content":"Aptus Capital Advisors LLC lessened its position in shares of SPDR Portfolio S&amp;P 500 Growth ETF (NYSEARCA:SPYG – Free Report) by 54.4% in the 2nd quarter, according to the company in its most rec… [+3282 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/aptus-capital-advisors-llc-lowers-stock-position-in-spdr-portfolio-sp-500-growth-etf-nysearcaspyg\/"
    },
    {
        "Date":"2024-09-05T08:22:54Z",
        "Title":"Bank of New York Mellon Corp Sells 120 Shares of SPDR Dow Jones Industrial Average ETF Trust (NYSEARCA:DIA)",
        "Description":"Bank of New York Mellon Corp trimmed its holdings in SPDR Dow Jones Industrial Average ETF Trust (NYSEARCA:DIA – Free Report) by 0.2% during the second quarter, according to its most recent disclosure with the Securities and Exchange Commission. The instituti…",
        "Content":"Bank of New York Mellon Corp trimmed its holdings in SPDR Dow Jones Industrial Average ETF Trust (NYSEARCA:DIA – Free Report) by 0.2% during the second quarter, according to its most recent disclosur… [+3034 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/bank-of-new-york-mellon-corp-sells-120-shares-of-spdr-dow-jones-industrial-average-etf-trust-nysearcadia\/"
    },
    {
        "Date":"2024-09-05T08:14:46Z",
        "Title":"Raymond James & Associates Increases Position in iShares U.S. Telecommunications ETF (BATS:IYZ)",
        "Description":"Raymond James & Associates lifted its holdings in shares of iShares U.S. Telecommunications ETF (BATS:IYZ – Free Report) by 6.8% during the second quarter, according to the company in its most recent Form 13F filing with the SEC. The fund owned 69,720 shares …",
        "Content":"Raymond James &amp; Associates lifted its holdings in shares of iShares U.S. Telecommunications ETF (BATS:IYZ – Free Report) by 6.8% during the second quarter, according to the company in its most re… [+3078 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/raymond-james-associates-increases-position-in-ishares-u-s-telecommunications-etf-batsiyz\/"
    },
    {
        "Date":"2024-09-05T08:14:45Z",
        "Title":"Raymond James & Associates Has $1.51 Million Position in SPDR S&P 600 Small Cap Growth ETF (NYSEARCA:SLYG)",
        "Description":"Raymond James & Associates grew its stake in shares of SPDR S&P 600 Small Cap Growth ETF (NYSEARCA:SLYG – Free Report) by 30.0% during the 2nd quarter, according to the company in its most recent filing with the Securities & Exchange Commission. The instituti…",
        "Content":"Raymond James &amp; Associates grew its stake in shares of SPDR S&amp;P 600 Small Cap Growth ETF (NYSEARCA:SLYG – Free Report) by 30.0% during the 2nd quarter, according to the company in its most re… [+3198 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/raymond-james-associates-has-1-51-million-position-in-spdr-sp-600-small-cap-growth-etf-nysearcaslyg\/"
    },
    {
        "Date":"2024-09-05T08:10:00Z",
        "Title":"Broader market outperforms; Nifty hovers below 25,200",
        "Description":"At 13:30 IST, the barometer index, the S&P BSE Sensex, declined 91.56 points or 0.11% to 82,261.08. The Nifty 50 index lost 21.20 points or 0.08% to 25,177.50.",
        "Content":"The headline equity benchmarks continued trade with minor losses in afternoon trade. The Nifty hovered below 25,200 level after hitting the days high of 25,275.45 in early trade. Barring the Nifty Re… [+4029 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/capital-market-news\/broader-market-outperforms-nifty-hovers-below-25-200-124090500555_1.html"
    },
    {
        "Date":"2024-09-05T07:41:26Z",
        "Title":"Futures steady, private payrolls and jobless claims ahead - what's moving markets",
        "Description":"Futures steady, private payrolls and jobless claims ahead - what's moving markets",
        "Content":"Investing.com -- US stock futures hover mostly above the flatline on Thursday, ahead of a raft of new labor market figures due out this week that may play into an upcoming Federal Reserve interest ra… [+5265 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/economy-news\/futures-steady-private-payrolls-and-jobless-claims-ahead--whats-moving-markets-3602164"
    },
    {
        "Date":"2024-09-05T07:35:38Z",
        "Title":"Asian stocks mixed after Wall Street extends losses as technology and energy stocks fall",
        "Description":"Asian markets were mixed Thursday following a global sell-off a day earlier, as Wall Street declined in the technology, energy and other sectors. Japan’s benchmark Nikkei 225 slipped 1.1%, and closed at 36,657.09. Data released Thursday showed Japan's wage gr…",
        "Content":"Asian markets were mixed Thursday following a global sell-off a day earlier, as Wall Street declined in the technology, energy and other sectors.\r\nJapans benchmark Nikkei 225 slipped 1.1%, and closed… [+3558 chars]",
        "Source":"Japan Today",
        "URL":"https:\/\/japantoday.com\/category\/business\/asian-stocks-mixed-after-wall-street-extends-losses-as-technology-and-energy-stocks-fall"
    },
    {
        "Date":"2024-09-05T07:01:21Z",
        "Title":"Here are the top 10 ASX 200 shares today",
        "Description":"ASX shares bounced back this Thursday after yesterday's savage selling...\nThe post Here are the top 10 ASX 200 shares today appeared first on The Motley Fool Australia.",
        "Content":"It was a successful recovery day for the S&amp;P\/ASX 200 Index (ASX: XJO) this Thursday. Although the ASX 200 didn't make up all of the ground lost yesterday, it did lift by a strong 0.4%. That leave… [+2063 chars]",
        "Source":"Motley Fool Australia",
        "URL":"https:\/\/www.fool.com.au\/2024\/09\/05\/here-are-the-top-10-asx-200-shares-today-487\/"
    },
    {
        "Date":"2024-09-05T06:30:01Z",
        "Title":"CNBC Daily Open: Rate cuts need to start before inflation’s 2%",
        "Description":"In today's volatile markets, is bad news still good news? Or maybe the bad news is so bad it could just be bad?",
        "Content":"This report is from today's CNBC Daily Open, our international markets newsletter. CNBC Daily Open brings investors up to speed on everything they need to know, no matter where they are. Like what yo… [+3768 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/stock-markets-rate-cuts-need-to-start-before-inflations-2percent.html"
    },
    {
        "Date":"2024-09-05T06:02:00Z",
        "Title":"Benchmarks trade with minor cuts; Nifty slips below 25,200 level",
        "Description":"At 11:25 IST, the barometer index, the S&P BSE Sensex, declined 93.26 points or 0.11% to 82,259.59. The Nifty 50 index fell 19.35 points or 0.08% to 25,179.35.15.",
        "Content":"The key domestic indices traded with small losses in mid-morning trade. The Nifty traded below 25,200 level. Consumer durables shares advanced after declining in the past trading session.\r\nAt 11:25 I… [+3601 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/capital-market-news\/benchmarks-trade-with-minor-cuts-nifty-slips-below-25-200-level-124090500393_1.html"
    },
    {
        "Date":"2024-09-05T05:56:54Z",
        "Title":"ProShares Short Real Estate (NYSEARCA:REK) Shares Down 0.4%",
        "Description":"ProShares Short Real Estate (NYSEARCA:REK – Get Free Report) shares were down 0.4% during mid-day trading on Wednesday . The stock traded as low as $16.66 and last traded at $16.73. Approximately 8,636 shares were traded during mid-day trading, a decline of 5…",
        "Content":"ProShares Short Real Estate (NYSEARCA:REK – Get Free Report) shares were down 0.4% during mid-day trading on Wednesday . The stock traded as low as $16.66 and last traded at $16.73. Approximately 8,6… [+1782 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/05\/proshares-short-real-estate-nysearcarek-shares-down-0-4\/"
    },
    {
        "Date":"2024-09-05T04:54:28Z",
        "Title":"Asian stocks mixed after Wall Street extends losses as technology and energy stocks fall",
        "Description":"Asian markets are mixed following Wednesday’s global sell-off, as Wall Street declined in the technology, energy and other sectors",
        "Content":"HONG KONG -- Asian markets were mixed Thursday following a global sell-off a day earlier, as Wall Street declined in the technology, energy and other sectors.\r\nJapans benchmark Nikkei 225 slipped 0.9… [+3417 chars]",
        "Source":"ABC News",
        "URL":"https:\/\/abcnews.go.com\/Business\/wireStory\/asian-stocks-mixed-after-wall-street-extends-losses-113407615"
    },
    {
        "Date":"2024-09-05T04:54:27Z",
        "Title":"Asian stocks mixed after Wall Street extends losses as technology and energy stocks fall",
        "Description":"Asian markets are mixed following Wednesday’s global sell-off, as Wall Street declined in the technology, energy and other sectors",
        "Content":"HONG KONG -- Asian markets were mixed Thursday following a global sell-off a day earlier, as Wall Street declined in the technology, energy and other sectors.\r\nJapans benchmark Nikkei 225 slipped 0.9… [+3417 chars]",
        "Source":"ABC News",
        "URL":"https:\/\/abcnews.go.com\/US\/wireStory\/asian-stocks-mixed-after-wall-street-extends-losses-113407614"
    },
    {
        "Date":"2024-09-05T04:54:26Z",
        "Title":"Asian stocks mixed after Wall Street extends losses as technology and energy stocks fall",
        "Description":"Asian markets are mixed following Wednesday’s global sell-off, as Wall Street declined in the technology, energy and other sectors. U.S. futures fell, while oil prices were higher. The S&P 500 fell 0.2% Wednesday, following a 2.1% drop a day earlier. The Nasd…",
        "Content":"Currency traders work near a screen showing the Korea Composite Stock Price Index (KOSPI) at the foreign exchange dealing room of the KEB Hana Bank headquarters in Seoul, South Korea, Thursday, Sept.… [+4384 chars]",
        "Source":"seattlepi.com",
        "URL":"https:\/\/www.seattlepi.com\/news\/world\/article\/asian-stocks-mixed-after-wall-street-extends-19744066.php"
    },
    {
        "Date":"1970-01-01T00:00:00Z",
        "Title":"[Removed]",
        "Description":"[Removed]",
        "Content":"[Removed]",
        "Source":"[Removed]",
        "URL":"https:\/\/removed.com"
    },
    {
        "Date":"2024-09-05T04:41:01Z",
        "Title":"Asian stocks mixed after Wall Street extends losses as technology and energy stocks fall",
        "Description":"Asian markets were mixed Thursday following a global sell-off a day earlier, as Wall Street declined in the technology, energy and other sectors.  Japan’s...",
        "Content":"HONG KONG (AP) Asian markets were mixed Thursday following a global sell-off a day earlier, as Wall Street declined in the technology, energy and other sectors.\r\nJapans benchmark Nikkei 225 slipped 0… [+3416 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/asian-stocks-mixed-wall-street-044101896.html"
    },
    {
        "Date":"2024-09-05T04:30:51Z",
        "Title":"Stock Market’s $1.05 Trillion Wipeout Puts To Test Bitcoin Stability – What’s Next?",
        "Description":"In a single day, $1.05 trillion was wiped out of the US stock market. This decline represents one of the largest of any single day in recent times and also reflects a mix of unsatisfactory economic data and huge struggles among major companies. Related Readin…",
        "Content":"In a single day, $1.05 trillion was wiped out of the US stock market. This decline represents one of the largest of any single day in recent times and also reflects a mix of unsatisfactory economic d… [+3316 chars]",
        "Source":"Bitcoinist",
        "URL":"https:\/\/bitcoinist.com\/stock-market-wipeout-puts-to-test-bitcoin-stability\/"
    },
    {
        "Date":"2024-09-05T04:03:00Z",
        "Title":"Indices edge higher in early trade; breadth strong",
        "Description":"At 09:25 IST, the barometer index, the S&P BSE Sensex, advanced 143.74 points or 0.17% to 82,496.38. The Nifty 50 index added 18.55 points or 0.07% to 25,217.25.",
        "Content":"The key equity indices traded with minor gains in early trade. The Nifty traded above 25,200 level. Media, metal and banking stocks advanced while realty, pharma and IT stocks declined.\r\nAt 09:25 IST… [+3812 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/capital-market-news\/indices-edge-higher-in-early-trade-breadth-strong-124090500169_1.html"
    },
    {
        "Date":"2024-09-05T03:05:00Z",
        "Title":"Shares may rebound as selloff takes breather",
        "Description":"GIFT Nifty:",
        "Content":"The GIFT Nifty September futures contract is up 10 points, suggesting a positive start for the Nifty 50.\r\nForeign portfolio investors (FPIs) bought shares worth Rs 975.46 crore, while domestic instit… [+2911 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/capital-market-news\/shares-may-rebound-as-selloff-takes-breather-124090500115_1.html"
    },
    {
        "Date":"2024-09-05T02:24:35Z",
        "Title":"Share market today: Mixed global cues, falling crude & RLL listing in focus",
        "Description":"Share market today: Mixed Asian markets, RIL getting PLI approval for full 10 GWh battery making facility, crude oil falling 1% below $74, and Raymond Lifestyle IPO, are among triggers that will be on",
        "Content":"Share market today: Mixed Asian markets, RIL getting PLI approval for full 10 GWh battery making facility, crude oil falling 1% below $74, and Raymond Lifestyle IPO, are among triggers that will be o… [+5483 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/news\/share-market-today-mixed-global-cues-falling-crude-rll-listing-in-focus-124090500074_1.html"
    },
    {
        "Date":"2024-09-05T02:09:58Z",
        "Title":"Sensex, Nifty eye cautious start amid volatile global sentiment",
        "Description":"Kelvin Wong of OANDA discusses US stock indices, while Indian markets are expected to open flat amid global volatility.",
        "Content":"Indian benchmark indices, Sensex and Nifty, are expected to open on a flat note on Wednesday amid volatile global markets. With no domestic triggers, analysts expect the market to align with global s… [+2483 chars]",
        "Source":"BusinessLine",
        "URL":"https:\/\/www.thehindubusinessline.com\/markets\/sensex-nifty-eye-cautious-start-amid-volatile-global-sentiment\/article68608026.ece"
    },
    {
        "Date":"2024-09-05T01:57:42Z",
        "Title":"Weak US data halts Nifty’s strong 14-day run",
        "Description":"Indian equity indices fell on Wednesday, influenced by a sell-off on Wall Street due to weak US manufacturing data. The Nifty dropped 0.3% and Sensex declined 0.25%. Losses were limited by falling global oil prices. Analysts suggest a short-term correction bu…",
        "Content":"Indian equity indices ended weak on Wednesday, mirroring the overnight sell-off on Wall Street, as weak US manufacturing reading revived concerns of a downturn. The losses were limited compared to th… [+2680 chars]",
        "Source":"The Times of India",
        "URL":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/weak-us-data-halts-niftys-strong-14-day-run\/articleshow\/113078044.cms"
    },
    {
        "Date":"2024-09-05T01:53:26Z",
        "Title":"Wall Street ends slightly down after weak labor market data, dovish Fed comments",
        "Description":"U.S. stocks ended slightly down in volatile trading after labor market data and comments from a Federal Reserve official suggested an interest rate cut might be imminent. Job openings fell to a 3-1\/2-year low, potentially supporting the Fed's decision. Nvidia…",
        "Content":"U.S. stocks finished slightly down in choppy trading on Wednesday following labor market data and comments from a Federal Reserve official that bolster the case for an interest rate cut.Labor Departm… [+2295 chars]",
        "Source":"The Times of India",
        "URL":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/wall-street-ends-slightly-down-after-weak-labor-market-data-dovish-fed-comments\/articleshow\/113077980.cms"
    },
    {
        "Date":"2024-09-05T01:48:24Z",
        "Title":"Stock Market LIVE Updates: Gift Nifty signals positive start for Sensex, Nifty; Asian markets mixed",
        "Description":"Stock Market LIVE Updates: Markets in India were likely to open with a positive bias, as indicated by GIFT Nifty futures that were trading around 100 points ahead of Nifty futures last close.",
        "Content":"Stock Market LIVE Updates: Markets in India were likely to open with a positive bias, as indicated by GIFT Nifty futures that were trading around 100 points ahead of Nifty futures last close.\r\nStock … [+3829 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/news\/stock-market-live-updates-today-sensex-nifty-nse-bse-ril-gic-raymond-lifestyle-ipo-124090500064_1.html"
    },
    {
        "Date":"2024-09-05T01:08:30Z",
        "Title":"CNBC Daily Open: Can’t wait until 2% to start cutting rates",
        "Description":"In today's volatile markets, is bad news still good news? Or maybe the bad news is so bad it could just be bad?",
        "Content":"This report is from today's CNBC Daily Open, our international markets newsletter. CNBC Daily Open brings investors up to speed on everything they need to know, no matter where they are. Like what yo… [+3878 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/stock-markets-cant-wait-until-2percent-to-start-cutting-rates.html"
    },
    {
        "Date":"2024-09-05T01:01:12Z",
        "Title":"Stock Market Highlights - 5 September 2024: Sensex, Nifty settle lower on profit-taking",
        "Description":"Sensex, Nifty, Share Prices: The Indian stock markets closed lower on Thursday, breaking their recent winning streak amid profit-taking and cautious sentiment ahead of key US economic data. The benchmark BSE Sensex ended 151.48 points or 0.18 per cent lower a…",
        "Content":"<li><\/li>\r\nSeptember 05, 2024 16:30Stock market live updates: Rupee strengthens by 4 paise to close at 83.97 against the dollar\r\nThe rupee traded in a narrow range and settled for the day higher by 4… [+45210 chars]",
        "Source":"BusinessLine",
        "URL":"https:\/\/www.thehindubusinessline.com\/markets\/share-market-nifty-sensex-highlights-5-september-2024\/article68605850.ece"
    },
    {
        "Date":"2024-09-05T00:56:08Z",
        "Title":"Sempra Declares Common and Preferred Dividends",
        "Description":"Sempra Declares Common and Preferred Dividends",
        "Content":"SAN DIEGO\r\n, Sept. 4, 2024\r\n \/PRNewswire\/ -- Sempra (NYSE: SRE) (BMV: SRE) today announced that its board of directors has declared a $0.62\r\n per share quarterly dividend on the company's common stoc… [+1228 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/sempra-declares-common-and-preferred-dividends-93CH-3602009"
    },
    {
        "Date":"2024-09-05T00:00:27Z",
        "Title":"Asia-Pacific markets mostly set to extend losses, tracking Wall Street's second straight fall",
        "Description":"Investors are watching economic data out of Japan, Australia and Singapore on Thursday.",
        "Content":"Asia-Pacific markets are mostly set to open lower on Thursday, extending losses as both the S&amp;P 500 and Nasdaq Composite slipped for a second straight day.\r\n\"Investors are a bit on edge; it's a l… [+1565 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/05\/asia-markets.html"
    },
    {
        "Date":"2024-09-04T23:05:33Z",
        "Title":"US stock market today: S&P 500, Nasdaq down after Nvidia, Apple, Intel, US Steel shares fall. Check full list",
        "Description":"US stock market today traded in red as Nvidia, Apple, Intel, US Steel stocks fell.",
        "Content":"New York Stock Exchange, Wall Street continue to witness downfall of shares as the US stock indexes S&amp;P 500, and Nasdaq composite lost more ground Wednesday, with declines in the technology, ener… [+2635 chars]",
        "Source":"The Times of India",
        "URL":"https:\/\/economictimes.indiatimes.com\/news\/international\/us\/us-stock-market-today-sp-500-nasdaq-down-after-nvidia-apple-intel-us-steel-shares-fall-check-full-list\/articleshow\/113075963.cms"
    },
    {
        "Date":"2024-09-04T22:59:24Z",
        "Title":"Jim Cramer cuts through the market's 'doom and gloom' as the market wavers",
        "Description":"CNBC's Jim Cramer on Wednesday tried to quell investors' fears of a recession.",
        "Content":"CNBC's Jim Cramer on Wednesday tried to quell investors' recession fears. He pointed to several sectors that are seeing gains and said that the economy needs to slow for the Federal Reserve to make e… [+2311 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/04\/jim-cramer-cuts-through-the-markets-gloom-as-the-market-wavers.html"
    },
    {
        "Date":"2024-09-04T22:31:04Z",
        "Title":"How Nvidia doubled earnings, lost almost $300 billion in value and shook the stock market",
        "Description":"It’s been described as the most important company in the world at the moment.",
        "Content":"Nvidia's headquarters in Santa Clara, Calif.\r\nIts been described as the most important company in the world at the moment.\r\nBut new concerns surrounding Nvidia, the chipmaker powering the artificial … [+6060 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/nvidia-doubled-earnings-lost-almost-223104139.html"
    },
    {
        "Date":"2024-09-04T22:12:07Z",
        "Title":"MondelÄ“z International Selects 10 Start-Ups to Participate in Second CoLab Tech Accelerator Program",
        "Description":"MondelÄ“z International Selects 10 Start-Ups to Participate in Second CoLab Tech Accelerator Program",
        "Content":"<ul><li>Participants are early-stage companies selected based on potential to accelerate their novel or innovative technology through access to MondelÄz personnel and capabilities<\/li><li>Cohort repr… [+7957 chars]",
        "Source":"Investing.com",
        "URL":"https:\/\/www.investing.com\/news\/press-releases\/mondelaz-international-selects-10-startups-to-participate-in-second-colab-tech-accelerator-program-93CH-3601883"
    },
    {
        "Date":"2024-09-04T21:57:01Z",
        "Title":"Live: ASX to open steady, S&P 500 and Nasdaq edge lower",
        "Description":"The Australian share market is unlikely to recover much of Wednesday's heavy losses, while Wall Street's main indices — the S&P 500 and Nasdaq Composite — posted further losses.",
        "Content":"Good morning! I'll be here to guide you through the latest finance and economic news.\r\nAs you may recall, the Australian share market suffered heavy losses yesterday (that 1.9% drop was its worst per… [+752 chars]",
        "Source":"ABC News (AU)",
        "URL":"https:\/\/www.abc.net.au\/news\/2024-09-05\/asx-markets-business-live-news\/104313084"
    },
    {
        "Date":"2024-09-04T21:48:00Z",
        "Title":"U.S. stocks close mixed after sell-off",
        "Description":"NEW YORK, Sept. 4 (Xinhua) -- U.S. stocks ended mixed on Wednesday, as Wall Street tried to bounce back from a sluggish start to September. Read full story",
        "Content":"NEW YORK, Sept. 4 (Xinhua) -- U.S. stocks ended mixed on Wednesday, as Wall Street tried to bounce back from a sluggish start to September.\r\n The Dow Jones Industrial Average rose 38.04 points, or 0.… [+1781 chars]",
        "Source":"The Star Online",
        "URL":"https:\/\/www.thestar.com.my\/news\/world\/2024\/09\/05\/us-stocks-close-mixed-after-sell-off"
    },
    {
        "Date":"2024-09-04T20:35:58Z",
        "Title":"Stock market today: S&P 500, Nasdaq slip as sluggish start to September continues",
        "Description":"Josh Schafer\nIn this article:\nUS stocks were mixed on Wednesday, seesawing the day after a steep sell-off fueled by worries about economic growth.\nThe S&P 500 (^GSPC) fell around 0.2% while the tech-heavy Nasdaq Composite (^IXIC) fell about 0.3%. Meanwhile, t…",
        "Content":"Josh SchaferIn this article:US stocks were mixed on Wednesday, seesawing the day after a steep sell-off fueled by worries about economic growth.The S&amp;P 500 (^GSPC) fell around 0.2% while the tech… [+138 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/506b6d8088346087"
    },
    {
        "Date":"2024-09-04T20:31:04Z",
        "Title":"How Nvidia doubled earnings, lost almost $300 billion in value and shook the stock market",
        "Description":"It’s been described as the most important company in the world at the moment.",
        "Content":"Its been described as the most important company in the world at the moment.\r\nBut new concerns surrounding Nvidia, the chipmaker powering the artificial intelligence revolution and which this summer … [+6083 chars]",
        "Source":"NBC News",
        "URL":"https:\/\/www.nbcnews.com\/business\/business-news\/nvidia-stock-volatility-why-ai-payoff-explainer-rcna169600"
    },
    {
        "Date":"2024-09-04T20:27:23Z",
        "Title":"Dollar Tree Slumps 22.2%",
        "Description":"Stocks lost more ground on Wall Street Wednesday, led by declines in the technology and energy sectors. The S&P 500 fell 8.86 points, or 0.2%, to 5,520.07, following a 2.1% drop a day earlier. The Dow Jones Industrial Average rose 38.04 points, or 0....",
        "Content":"Shares of US Steel sank 17.5% after the Biden administration signaled that's it's open to formally blocking the company's acquisition by Nippon Steel of Japan. On Monday, Vice President Kamala Harris… [+1464 chars]",
        "Source":"Newser",
        "URL":"https:\/\/www.newser.com\/story\/355690\/dollar-tree-slumps-222.html"
    },
    {
        "Date":"2024-09-04T20:24:26Z",
        "Title":"Stock market today: S&P 500 slips as Nvidia rebound runs out of steam",
        "Description":"Investing.com - The S&P 500 slipped on Wednesday, as Nvidia's rebound faded, keeping a lid on tech stocks despite a sharp drop in Treasury yields amid rising bets on a jumbo Fed rate cut later this month.\nAt 4:00 p.m. EST (2000 GMT), the Dow Jones Industrial …",
        "Content":"Investing.com - The S&amp;P 500 slipped on Wednesday, as Nvidia's rebound faded, keeping a lid on tech stocks despite a sharp drop in Treasury yields amid rising bets on a jumbo Fed rate cut later th… [+141 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/4882709e4582f4d8"
    },
    {
        "Date":"2024-09-04T20:21:55Z",
        "Title":"How major US stock indexes fared Wednesday, 9\/4\/2024",
        "Description":"Stocks lost more ground on Wall Street Wednesday, led by declines in the technology and energy sectors",
        "Content":"Stocks lost more ground on Wall Street Wednesday, led by declines in the technology and energy sectors. \r\nThe S&amp;P 500 fell 0.2% Wednesday, following a 2.1% drop a day earlier. The Nasdaq composit… [+1057 chars]",
        "Source":"ABC News",
        "URL":"https:\/\/abcnews.go.com\/Business\/wireStory\/major-us-stock-indexes-fared-wednesday-942024-113397316"
    },
    {
        "Date":"2024-09-04T20:19:05Z",
        "Title":"5 things to watch on the ASX 200 on Thursday",
        "Description":"Another tough session is expected for Aussie investors today.\nThe post 5 things to watch on the ASX 200 on Thursday appeared first on The Motley Fool Australia.",
        "Content":"On Wednesday, the S&amp;P\/ASX 200 Index (ASX: XJO) had a day to forget and sank deep into the red. The benchmark index fell 1.9% to 7,950.5 points.\r\nWill the market be able to bounce back from this o… [+2219 chars]",
        "Source":"Motley Fool Australia",
        "URL":"https:\/\/www.fool.com.au\/2024\/09\/05\/5-things-to-watch-on-the-asx-200-on-thursday-234\/"
    },
    {
        "Date":"2024-09-04T20:10:00Z",
        "Title":"U.S. stocks close mixed",
        "Description":"NEW YORK, Sept. 4 (Xinhua) -- U.S. stocks ended mixed on Wednesday. Read full story",
        "Content":"NEW YORK, Sept. 4 (Xinhua) -- U.S. stocks ended mixed on Wednesday.\r\n The Dow Jones Industrial Average rose 38.04 points, or 0.09 percent, to 40,974.97. The S&amp;P 500 sank 8.86 points, or 0.16 perc… [+365 chars]",
        "Source":"The Star Online",
        "URL":"https:\/\/www.thestar.com.my\/news\/world\/2024\/09\/05\/us-stocks-close-mixed"
    },
    {
        "Date":"2024-09-04T20:05:00Z",
        "Title":"Mondelēz International Selects 10 Start-Ups to Participate in Second CoLab Tech Accelerator Program",
        "Description":"CHICAGO, Sept. 04, 2024 (GLOBE NEWSWIRE) -- Mondelēz International, Inc. (Nasdaq: MDLZ) today announced 10 companies selected for its second CoLab Tech program, an accelerator led by the global snack company’s research and development team. This year’s cohort…",
        "Content":"<ul><li>Participants are early-stage companies selected based on potential to accelerate their novel or innovative technology through access to Mondelz personnel and capabilities<\/li><li>Cohort repre… [+7885 chars]",
        "Source":"GlobeNewswire",
        "URL":"https:\/\/www.globenewswire.com\/news-release\/2024\/09\/04\/2940892\/35903\/en\/Mondel%C4%93z-International-Selects-10-Start-Ups-to-Participate-in-Second-CoLab-Tech-Accelerator-Program.html"
    },
    {
        "Date":"2024-09-04T18:46:32Z",
        "Title":"Job openings fell more than expected in July in another sign of labor market softening",
        "Description":"Job openings slumped to their lowest level in 3½ years in July, the Labor Department reported Wednesday in another sign of slack in the labor market.",
        "Content":"Job openings slumped to their lowest level in 3½ years in July, the Labor Department reported Wednesday in another sign of slack in the labor market.\r\nThe departments closely watched Job Openings and… [+2392 chars]",
        "Source":"NBC News",
        "URL":"https:\/\/www.nbcnews.com\/business\/economy\/job-openings-fell-expected-july-another-sign-labor-market-softening-rcna169606"
    },
    {
        "Date":"2024-09-04T17:58:57Z",
        "Title":"Job Seekers Found Fewer Opportunities In July As Labor Market Cooled",
        "Description":"In the latest sign that the labor market is cooling down, the number of job openings fell in July to its lowest since January 2021.",
        "Content":"<ul><li>The number of job openings slipped to its lowest in more than three years in July, adding to recent data showing the labor market is cooling off.<\/li><li>Job openings have slipped as the Fede… [+4340 chars]",
        "Source":"Investopedia",
        "URL":"https:\/\/www.investopedia.com\/job-seekers-found-fewer-opportunities-in-july-as-labor-market-cooled-8706236"
    },
    {
        "Date":"2024-09-04T17:27:13Z",
        "Title":"Midday stock movers: Nvidia, Dollar Tree, Hormel Foods",
        "Description":"The stock market is showing mixed performance midday. The S&P 500 lost 0.04% while the tech-heavy Nasdaq Composite added 0.11%. The Dow Jones Industrial Average lost 0.09%. The Russell 2000 Index rose 0.26%.\nJob openings slumped to their lowest level since Ja…",
        "Content":"The stock market is showing mixed performance midday. The S&amp;P 500 lost 0.04% while the tech-heavy Nasdaq Composite added 0.11%. The Dow Jones Industrial Average lost 0.09%. The Russell 2000 Index… [+139 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/82a1005a40acd838"
    },
    {
        "Date":"2024-09-04T16:39:35Z",
        "Title":"Intel Stock Drops Further as Silicon Wafers Reportedly Fail Broadcom Tests",
        "Description":"Intel shares fell Wednesday as a stretch of bad news for the chipmaker continued, with a report that its most advanced manufacturing process failed tests by Broadcom.",
        "Content":"<ul><li>Intel shares fell further Wednesday amid a broader selloff of chip stocks, as the company's contract manufacturing business got another piece of bad news.<\/li><li>Reuters reported that recent… [+1737 chars]",
        "Source":"Investopedia",
        "URL":"https:\/\/www.investopedia.com\/intel-stock-drops-further-as-silicon-wafers-reportedly-fail-broadcom-tests-8706115"
    },
    {
        "Date":"2024-09-04T16:19:17Z",
        "Title":"Dow Jones Titan Apple Breaks Critical Chart Level. Time To Sell The Mag 7 Member?",
        "Description":"Apple stock is breaking below a support level in today's stock market. Is it time to sell Apple?",
        "Content":"Dow Jones tech titan Apple (AAPL) sold off Wednesday, threatening to break below a key benchmark. Is it time to sell Apple stock?\r\nXNOW PLAYINGFrom Nvidia To Tesla, Here's How To Reel In A Big CatchE… [+2446 chars]",
        "Source":"Investor's Business Daily",
        "URL":"https:\/\/www.investors.com\/research\/apple-stock-aapl-dow-jones-stock\/"
    },
    {
        "Date":"2024-09-04T16:13:32Z",
        "Title":"U.S. July job openings lower than expected at 7.7 million",
        "Description":"U.S. job openings in July were 7.7 million, according to a Wednesday Bureau of Labor Statistics report. Openings were at three and a half year low and were significantly fewer than expected by Dow Jones economists.",
        "Content":"If you click 'Accept all', we and our partners, including 239 who are part of the IAB Transparency &amp; Consent Framework, will also store and\/or access information on a device (in other words, use … [+678 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/consent.yahoo.com\/v2\/collectConsent?sessionId=1_cc-session_a29a2afd-b2c4-4d6f-a1ef-d481ef28a75c"
    },
    {
        "Date":"2024-09-04T16:04:42Z",
        "Title":"US Job Openings Drop to Their Lowest Level Since January 2021",
        "Description":"July’s job openings fell by 237,000 to 7.673 million for the month, said the Department of Labor’s Bureau of Labor Statistics Wednesday.",
        "Content":"U.S. job openings plunged in July to their lowest level since January 2021, suggesting that the labor market is slowing down and may trigger the Federal Reserve to issue a large rate cut later this m… [+2313 chars]",
        "Source":"Theepochtimes.com",
        "URL":"https:\/\/www.theepochtimes.com\/business\/us-job-openings-drop-to-their-lowest-level-since-january-2021-post-5717953"
    },
    {
        "Date":"2024-09-04T15:56:51Z",
        "Title":"The September Effect",
        "Description":"September is the worst month for stocks. Markets underperform for a variety reasons. Here we look at Seasonality and the potential for arbitrage in September.",
        "Content":"The September Effect\r\nMan Group\r\nSeptember is my favorite month. Theres always a sense of energy, of dynamism, new beginnings rooted in memories of going back to school and university. For the market… [+5200 chars]",
        "Source":"Forbes",
        "URL":"https:\/\/www.forbes.com\/sites\/stevendesmyter\/2024\/09\/04\/the-september-effect\/"
    },
    {
        "Date":"2024-09-04T15:31:39Z",
        "Title":"Ahead of Market: 10 things that will decide stock action on Thursday",
        "Description":"The Nifty index ended its 14-day winning streak, falling 0.32% to 25,198 due to global market concerns and U.S. economic uncertainty. Analysts suggest a \"buy on dips\" strategy while maintaining support at 25,000-25,100, with potential resistance at 25,300-25,…",
        "Content":"The benchmark Nifty index broke its 14-day winning streak, closing in the red on Wednesday due to a global market downturn amid renewed concerns over a U.S. economic slowdown and caution ahead of key… [+5339 chars]",
        "Source":"The Times of India",
        "URL":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/ahead-of-market-10-things-that-will-decide-stock-action-on-thursday\/articleshow\/113069846.cms"
    },
    {
        "Date":"2024-09-04T15:13:00Z",
        "Title":"Athens Stock Exchange: New losses, but avoided the worst – Banks are the negative protagonists",
        "Description":"Initial pressures from abroad have been eased - The 1,430 points were tested, but held up\nThe post Athens Stock Exchange: New losses, but avoided the worst – Banks are the negative protagonists appeared first on ProtoThema English.",
        "Content":"The Greek stock market closed in the red, but far from the day’s lows, in a session marked by strong import pressure. The “breach” of 1,430 points proved to be temporary, with sellers gradually “down… [+3309 chars]",
        "Source":"Protothema.gr",
        "URL":"https:\/\/en.protothema.gr\/2024\/09\/04\/athens-stock-exchange-new-losses-but-avoided-the-worst-banks-are-the-negative-protagonists\/"
    },
    {
        "Date":"2024-09-04T15:03:00Z",
        "Title":"Stocks rebound from morning slump following Wall Street's worst day in a month",
        "Description":"Solid August job numbers when DOL releases its monthly employment data on Friday should allay any fears of hard landing amid September volatility, analysts say.",
        "Content":"Stocks are up on Wall Street following an early morning slump a day after the market's worst performance in a month. \r\nThe S&amp;P 500 is up 0.3%, or 17 points, as of 10:58 a.m. Eastern time on Wedne… [+3770 chars]",
        "Source":"CBS News",
        "URL":"https:\/\/www.cbsnews.com\/news\/stocks-up-nvidia-weak-tech-september-04-2024\/"
    },
    {
        "Date":"2024-09-04T14:46:58Z",
        "Title":"S&P 500 Fights For Support At This Level; Nvidia Struggles Below Key Moving Average (Live Coverage)",
        "Description":"The stock market struggled to rebound after Tuesday's hard knocks, and a new monthly report on job openings hurt investor sentiment on the economy. Nvidia failed to attract buyers after it triggered a sell rule.",
        "Content":"The stock market struggled to rebound after Tuesday's hard knocks, and a new monthly report on job openings hurt investor sentiment on the economy. Nvidia (NVDA) failed to attract buyers after it tri… [+3284 chars]",
        "Source":"Investor's Business Daily",
        "URL":"https:\/\/www.investors.com\/market-trend\/stock-market-today\/nasdaq-sp500-djia-nvidia-stock-warren-buffett\/"
    },
    {
        "Date":"2024-09-04T14:42:45Z",
        "Title":"Is US economy better or worse now than under Trump?",
        "Description":"BBC Verify looks at jobs, inflation, stocks and other indicators to compare the Trump and Biden economies.",
        "Content":"It has been a recurrent theme of this US presidential campaign - has the US economy performed better under Joe Biden or Donald Trump?\r\nBy many indicators our economy is the strongest in the world, De… [+6102 chars]",
        "Source":"BBC News",
        "URL":"https:\/\/www.bbc.com\/news\/articles\/c8xl5vnlzpwo?xtor=AL-72-%5Bpartner%5D-%5Byahoo.north.america%5D-%5Bheadline%5D-%5Bnews%5D-%5Bbizdev%5D-%5Bisapi%5D"
    },
    {
        "Date":"2024-09-04T14:22:16Z",
        "Title":"Job openings fell more than expected in July in another sign of labor market softening",
        "Description":"The closely watched Job Openings and Labor Turnover Survey showed that available positions fell to 7.67 million on the month.",
        "Content":"Job openings slumped to their lowest level in three and a half years in July, the Labor Department reported Wednesday in another sign of slack in the labor market.\r\nThe department's closely watched J… [+1269 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/04\/jolts-july-2024.html"
    },
    {
        "Date":"2024-09-04T14:17:00Z",
        "Title":"Intel's poor stock performance could lead to its removal from the Dow Jones",
        "Description":"The chipmaker's market cap has now dipped below $100 billion for the first time since its peak in 2000. Its stock has plummeted nearly 60% this year alone, making it the worst performer among the 30 Dow components that make up the DJIA. The company also repor…",
        "Content":"What a downfall: Back in the late 90s, Intel and Microsoft were the first major tech players to join the elite Dow Jones Industrial Average club. It was the heyday of the PC revolution that these two… [+2389 chars]",
        "Source":"TechSpot",
        "URL":"https:\/\/www.techspot.com\/news\/104572-intel-stock-performing-badly-could-booted-dow-jones.html"
    },
    {
        "Date":"2024-09-04T13:48:50Z",
        "Title":"Stock market today: Indexes trade mixed after worst sell-off since August rout",
        "Description":"Nvidia shares continued to lose ground after a report the Department of Justice is probing the AI titan over antitrust concerns.",
        "Content":"US struggled to regain momentum on Wednesday after the market saw its worst loss since the early August sell-off in the previous session. \r\nThe Dow Jones Industrial Average edged up slightly, while t… [+1867 chars]",
        "Source":"Business Insider",
        "URL":"https:\/\/markets.businessinsider.com\/news\/stocks\/stock-market-today-sell-off-nvidia-stock-price-doj-antitrust-2024-9"
    },
    {
        "Date":"2024-09-04T13:36:14Z",
        "Title":"Stocks Are Falling. The Market Is on Edge Ahead of Jobs Data",
        "Description":"LIVE UPDATES\nStock Market News: Dow Opens Down\nThe S&P 500 and Nasdaq are also falling.\nLast Updated:\nSep. 4, 2024 at 9:33 AM EDT\n2 min ago\nStocks Are Falling. The Market Is on Edge Ahead of Jobs Data.\nThe stock market opened lower again as September was livi…",
        "Content":"LIVE UPDATESStock Market News: Dow Opens DownThe S&amp;P 500 and Nasdaq are also falling.Last Updated:Sep. 4, 2024 at 9:33 AM EDT2 min agoStocks Are Falling. The Market Is on Edge Ahead of Jobs Data.… [+132 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/d03e2ddf1045fdb8"
    },
    {
        "Date":"2024-09-04T13:35:02Z",
        "Title":"US stocks open lower on growth concerns ahead of labor data",
        "Description":"Wall Street's main indexes opened lower on Wednesday as fresh worries over the health of the U.S. economy kept investors on the sidelines in the run-up to labor data.",
        "Content":"Wall Street's main indexes opened lower on Wednesday as fresh worries over the health of the U.S. economy kept investors on the sidelines in the run-up to labor data.The Dow Jones Industrial Average … [+275 chars]",
        "Source":"The Times of India",
        "URL":"https:\/\/economictimes.indiatimes.com\/markets\/stocks\/news\/us-stocks-open-lower-on-growth-concerns-ahead-of-labor-data\/articleshow\/113067752.cms"
    },
    {
        "Date":"2024-09-04T13:34:33Z",
        "Title":"Stock market today: Nasdaq leads declines as stocks extend slide",
        "Description":"Investors are looking to labor data to gauge the chances of a \"soft landing\" for the economy.",
        "Content":"US tech stocks extended losses on Wednesday morning, coming off a steep sell-off fueled by worries about economic growth and the AI trade amid a slide in Nvidia (NVDA) shares.\r\nThe S&amp;P 500 (^GSPC… [+1917 chars]",
        "Source":"Yahoo Entertainment",
        "URL":"https:\/\/finance.yahoo.com\/news\/live\/stock-market-today-nasdaq-leads-declines-as-stocks-extend-slide-133433472.html"
    },
    {
        "Date":"2024-09-04T13:18:56Z",
        "Title":"D.A. Davidson & CO. Acquires 6,968 Shares of iShares U.S. Aerospace & Defense ETF (BATS:ITA)",
        "Description":"D.A. Davidson & CO. boosted its stake in iShares U.S. Aerospace & Defense ETF (BATS:ITA – Free Report) by 27.0% during the 2nd quarter, according to the company in its most recent disclosure with the Securities & Exchange Commission. The institutional investo…",
        "Content":"D.A. Davidson &amp; CO. boosted its stake in iShares U.S. Aerospace &amp; Defense ETF (BATS:ITA – Free Report) by 27.0% during the 2nd quarter, according to the company in its most recent disclosure … [+2871 chars]",
        "Source":"ETF Daily News",
        "URL":"https:\/\/www.etfdailynews.com\/2024\/09\/04\/d-a-davidson-co-acquires-6968-shares-of-ishares-u-s-aerospace-defense-etf-batsita\/"
    },
    {
        "Date":"2024-09-04T12:51:52Z",
        "Title":"5 Dow Jones Industrials Blue Chip High-Yield Dividend Giants Are Still On Sale",
        "Description":"24\/7 Wall St. Insights\nThe stock market is way overbought, but some blue chips are at bargain prices.\nThe Dow is up 20% over the past year, but investors have looked the other way.\nBuy these five Dow bargains now, and grab your free report today, “2 Dividend …",
        "Content":"24\/7 Wall St. InsightsThe stock market is way overbought, but some blue chips are at bargain prices.The Dow is up 20% over the past year, but investors have looked the other way.Buy these five Dow ba… [+130 chars]",
        "Source":"Biztoc.com",
        "URL":"https:\/\/biztoc.com\/x\/2356f55fda2f06c4"
    },
    {
        "Date":"2024-09-04T12:35:00Z",
        "Title":"5 things to know before the stock market opens Wednesday",
        "Description":"Here are the most important news items that investors need to start their trading day.",
        "Content":"Here are the most important news items that investors need to start their trading day:\r\n1. Off to a rough start\r\nStocks kicked off the new month in the red, with all three major averages suffering th… [+3351 chars]",
        "Source":"CNBC",
        "URL":"https:\/\/www.cnbc.com\/2024\/09\/04\/5-things-to-know-before-the-stock-market-opens-wednesday-september-4.html"
    },
    {
        "Date":"2024-09-04T12:34:00Z",
        "Title":"Nifty snaps 14-day streak on weak global cues",
        "Description":"The domestic equity benchmarks ended with minor losses on Wednesday. The Nifty snapped its 14-day winning streak and settled a tad below the 25,200 level. Global market jitters over a potential US economic slowdown and anticipation of key economic data weighe…",
        "Content":"The domestic equity benchmarks ended with minor losses on Wednesday. The Nifty snapped its 14-day winning streak and settled a tad below the 25,200 level. Global market jitters over a potential US ec… [+6804 chars]",
        "Source":"Business Standard",
        "URL":"https:\/\/www.business-standard.com\/markets\/capital-market-news\/nifty-snaps-14-day-streak-on-weak-global-cues-124090401001_1.html"
    }
]